&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ общ_ЗащитаКлиентСервер.ПроверитьЛицензию() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не может быть открыт, т.к. система защиты не функционирует!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИмяОтчета = "ден_ПлатежныйКалендарь";
	
	ИспользоватьНастройкуПериода = Истина;
	ИзменятьСтруктуруОтчета = Истина;
	
	ИспользоватьСтандартныеНастройкиСтруктуры = Ложь;
	Элементы.РазделыНастроек.Доступность = Не ИспользоватьСтандартныеНастройкиСтруктуры;
	
	общ_ОтчетыВызовСервера.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, ДополнительныеПоля", Ложь, Истина, Ложь);
	ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки);
	
	Элементы.ПоказатьНастройки.Видимость 			= ИзменятьСтруктуруОтчета;
	Элементы.ПоказатьНастройкиВсеДействия.Видимость	= ИзменятьСтруктуруОтчета;
	
	Элементы.ПредставлениеСпискаОрганизаций.Видимость = Истина;
	Элементы.ПериодОтчета.Видимость=Истина;
	
	МассивПризнаковОтбора = Новый Массив;
	МассивПолейОтбора = Новый Массив;
	МассивГруппЭлементовОтбора = Новый Массив;
	Для Каждого ПараметрОтчета Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		ПараметрОтчета.Использование=Истина;
		Имя 		= Строка(ПараметрОтчета.Параметр);
		Параметр 	= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(ПараметрОтчета.Параметр);
		Если Имя = "Период" Тогда
			СписокПараметровОтчетаДляФормирования.Добавить(Имя);
			Продолжить;
		КонецЕсли;
		СписокПараметровОтчетаДляФормирования.Добавить(Имя);
		Если НЕ Параметр.Видимость Тогда
			Продолжить;
		КонецЕсли;
		Если ИспользоватьНастройкуПериода И (Имя="НачалоПериода" ИЛИ Имя="КонецПериода") Тогда
			Продолжить;
		КонецЕсли;
		Если Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Отбор"+Имя)<>Неопределено Тогда
			МассивПолейОтбора.Добавить(Имя);
			МассивПризнаковОтбора.Добавить("Отбор"+Имя);
		КонецЕсли;
	КонецЦикла;
	
	мОрганизацияПользователя 	= фин_ОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
	мСтруктурноеПодразделение 	= фин_ОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновноеСтруктурноеПодразделениеОрганизации");
	Если Параметры.Свойство("Организация") Тогда
		мОрганизацияПользователя = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("СтруктурноеПодразделение") Тогда
		мСтруктурноеПодразделение = Параметры.СтруктурноеПодразделение;
	КонецЕсли;

	УстановитьОтборИПараметры();
	Для Каждого Параметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если Параметры.Свойство(Строка(Параметр.Параметр)) Тогда
			Параметр.Значение = Параметры[Строка(Параметр.Параметр)];
			Параметр.Использование=Истина;
		КонецЕсли;
	КонецЦикла;
	ОбновитьЗначенияПараметров();
	Для Каждого ЭлементОтбора Из МассивПолейОтбора Цикл
		ПолеГруппыОтбора = Элементы.Добавить("ГруппаОтбор"+ЭлементОтбора,Тип("ГруппаФормы"),Элементы.ПараметрыОтчета);
		ПолеГруппыОтбора.Вид=ВидГруппыФормы.ОбычнаяГруппа;
		ПолеГруппыОтбора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ПолеГруппыОтбора.ОтображатьЗаголовок = Ложь;
		ПолеГруппыОтбора.Отображение 	= ОтображениеОбычнойГруппы.Нет;
		МассивГруппЭлементовОтбора.Добавить(ПолеГруппыОтбора);
    КонецЦикла;
	
	НадписьПараметры 	= "Параметры";
	НадписьОтбор 		= "Отбор";
	НадписьРезультат 	= "Результат";
	НадписьСортировка	= "Сортировка";
	//Заполним представление структурных единиц
	Объект = РеквизитФормыВЗначение("Отчет");
	РаботаСОрганизациямиИСтруктурнымиПодразделениями = Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы.Найти("Организация")<>Неопределено И Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.Элементы.Найти("СтруктурноеПодразделение")<>Неопределено;
	Если РаботаСОрганизациямиИСтруктурнымиПодразделениями Тогда
		Если Параметры.Свойство("НеВосстанавливатьНастройки") И Параметры.НеВосстанавливатьНастройки = Истина Тогда
			Если Параметры.Свойство("Организация") Тогда
				СписокСтруктурныхЕдиниц.Добавить(Параметры.Организация);
			КонецЕсли;
		ИначеЕсли СписокСтруктурныхЕдиниц.Количество()=0 И ЗначениеЗаполнено(мОрганизацияПользователя) Тогда
			СписокСтруктурныхЕдиниц.Добавить(мОрганизацияПользователя);
		КонецЕсли;
		Для Каждого ЗначениеСЗ Из СписокПодразделений Цикл
			Если ЗначениеСЗ.Значение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда 
				ЗначениеСЗ.Представление = "Головное подразделение";
			КонецЕсли;				
		КонецЦикла;
		ПредставлениеСпискаОрганизаций = ВыгрузитьСписокВСтроку(СписокСтруктурныхЕдиниц);
		
		Для Каждого ЭлементСписка Из СписокПодразделений Цикл
			Если ЭлементСписка.Значение = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка") Тогда 
				ЭлементСписка.Представление = "Головное подразделение";
			КонецЕсли;				
		КонецЦикла;
		
		ПредставлениеСпискаПодразделений = ВыгрузитьСписокВСтроку(СписокПодразделений);
		
	КонецЕсли;
	Если Параметры.Свойство("Отбор") Тогда
		Отбор = Параметры.Отбор;
		Если ТипЗнч(Отбор) = Тип("Структура") Тогда
			Для Каждого ЭлементОтбор Из Отбор  Цикл
				НайденОтбор = Ложь;
				Для Каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
					Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
						Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЭлементОтбор.Ключ) Тогда
							НайденОтбор = Истина;
							ЭлементОтбора.ПравоеЗначение = ЭлементОтбор.Значение;			
							ЭлементОтбора.Использование = Истина;
							ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Если НайденОтбор = Ложь Тогда
					НовыйОтбор = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ЭлементОтбор.Ключ);
					НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					НовыйОтбор.ПравоеЗначение = ЭлементОтбор.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.СформироватьПриОткрытии=Истина Тогда
		СформироватьОтчетНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КлючУникальности = ИмяОтчета;
	
	ИБФайловая = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая;
	ПодключитьОбработчикОжидания = Не ИБФайловая И ЗначениеЗаполнено(ИдентификаторЗадания);
	Если ПодключитьОбработчикОжидания Тогда		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
	
	общ_ОтчетыКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
	ПредставлениеСпискаОрганизаций = ВыгрузитьСписокВСтроку(СписокСтруктурныхЕдиниц);
	
	Для Каждого ЭлементСписка Из СписокПодразделений Цикл
		Если ЭлементСписка.Значение = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка") Тогда 
			ЭлементСписка.Представление = "Головное подразделение";
		КонецЕсли;				
	КонецЦикла;
	
	ПредставлениеСпискаПодразделений = ВыгрузитьСписокВСтроку(СписокПодразделений);
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыгрузитьСписокВСтроку(Список, МаксЧислоСимволовНаЭлемент = 50, РазделительЭлементов = "; ", ВыгружатьПолныеНаименованияОрганизаций=Ложь, ПредставлениеПустойСсылки = "") Экспорт

	Результат = "";
	Для Каждого ЭлементСписка Из Список Цикл
		Если НЕ ВыгружатьПолныеНаименованияОрганизаций Тогда
			Если Не ПустаяСтрока(ЭлементСписка.Представление) Тогда
				ПредставлениеЭлемента = ЭлементСписка.Представление;
			Иначе
				ПредставлениеЭлемента = Строка(ЭлементСписка.Значение);
			КонецЕсли;
			ПредставлениеЭлемента = СокрЛП(ПредставлениеЭлемента);
			Если Не ПустаяСтрока(ПредставлениеЭлемента) Тогда
				
				Если МаксЧислоСимволовНаЭлемент > 0 И Список.Количество() > 1 Тогда
					Если СтрДлина(ПредставлениеЭлемента) > МаксЧислоСимволовНаЭлемент Тогда
						ПредставлениеЭлемента = Лев(ПредставлениеЭлемента, МаксЧислоСимволовНаЭлемент) + "...";
					КонецЕсли;
				КонецЕсли;
			
				Если Не ПустаяСтрока(Результат) Тогда
					Результат = Результат + РазделительЭлементов;
				КонецЕсли;
			
				Результат = Результат + ПредставлениеЭлемента;
				
			КонецЕсли;
		Иначе
			Попытка 
				ПредставлениеЭлемента = ЭлементСписка.Значение.НаименованиеПолное;
			Исключение
				ПредставлениеЭлемента = "";
			КонецПопытки;
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + РазделительЭлементов;
			КонецЕсли;
		
			Результат = Результат + ПредставлениеЭлемента;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции // ВыгрузитьСписокВСтроку()

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	общ_ОтчетыКлиент.ПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОтменитьВыполнениеЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	ОбновитьЗначенияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Не ЗначениеЗаполнено(Настройки) Тогда
		ОбновитьЗначенияПараметров();
		УстановитьОтборИПараметры();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)
	
	Если Параметры.НеВосстанавливатьНастройки Тогда
		Настройки = Отчет.КомпоновщикНастроек.ФиксированныеНастройки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Если не ЗначениеЗаполнено(Настройки) И НЕ Параметры.НеВосстанавливатьНастройки Тогда
		ОбновитьЗначенияПараметров();
		УстановитьОтборИПараметры();
	КонецЕсли;
	Если Параметры.НеВосстанавливатьНастройки Тогда
		Для Каждого ПараметрОтчета Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
			Имя 			= Строка(ПараметрОтчета.Параметр);
			Параметр 	= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(ПараметрОтчета.Параметр);
			Если НЕ Параметр.Видимость Тогда
				Продолжить;
			КонецЕсли;
			Если ИспользоватьНастройкуПериода И (Имя="НачалоПериода" ИЛИ Имя="КонецПериода") Тогда
				Если Имя="НачалоПериода" Тогда
					ПараметрОтчета.Значение = НастройкаПериода.ДатаНачала;
				Иначе
					ПараметрОтчета.Значение = НастройкаПериода.ДатаОкончания;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			ПараметрОтчета.Значение = ЭтаФорма[Имя];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	СохраняемыеРеквизитыФормы = СписокПараметровОтчетаДляФормирования.ВыгрузитьЗначения();
	СохраняемыеРеквизитыФормы.Добавить("ОтображатьОтборИСортировку");
	СохраняемыеРеквизитыФормы.Добавить("ИспользоватьСтандартныеНастройкиСтруктуры");
	СохраняемыеРеквизитыФормы.Добавить("ИспользоватьНастройкуПериода");
	
	СохраняемыеТаблицыФормы = Новый Массив;
	СохраняемыеТаблицыФормы.Добавить("ГруппировкиОтчета");
	СохраняемыеТаблицыФормы.Добавить("ДополнительныеГруппировкиОтчета");
	СохраняемыеТаблицыФормы.Добавить("Показатели");
	
	общ_ОтчетыВызовСервера.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки,СохраняемыеТаблицыФормы,СохраняемыеРеквизитыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	СохраняемыеРеквизитыФормы = СписокПараметровОтчетаДляФормирования.ВыгрузитьЗначения();
	СохраняемыеРеквизитыФормы.Добавить("ОтображатьОтборИСортировку");
	СохраняемыеРеквизитыФормы.Добавить("ИспользоватьСтандартныеНастройкиСтруктуры");
	СохраняемыеРеквизитыФормы.Добавить("ИспользоватьНастройкуПериода");
	
	СохраняемыеТаблицыФормы = Новый Массив;
	СохраняемыеТаблицыФормы.Добавить("ГруппировкиОтчета");
	СохраняемыеТаблицыФормы.Добавить("ДополнительныеГруппировкиОтчета");
	СохраняемыеТаблицыФормы.Добавить("Показатели");
	
	ЗагруженыИндивидуальныеНастройки = Ложь;
	
	общ_ОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки,СохраняемыеТаблицыФормы,СохраняемыеРеквизитыФормы,ЗагруженыИндивидуальныеНастройки);
	Если ИзменятьСтруктуруОтчета Тогда
		
		
		общ_ОтчетыВызовСервера.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки,СохраняемыеТаблицыФормы,СохраняемыеРеквизитыФормы,ЗагруженыИндивидуальныеНастройки);
		
		ИспользоватьСтандартныеНастройкиСтруктуры = НЕ ЗагруженыИндивидуальныеНастройки;
		Элементы.РазделыНастроек.Доступность = НЕ ИспользоватьСтандартныеНастройкиСтруктуры;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(Настройки) Тогда
		ОбновитьЗначенияПараметров();
		УстановитьОтборИПараметры();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НастройкаПериодаДатаНачалаПриИзменении(Элемент)
	
	ПараметрДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если ПараметрДата<>Неопределено  Тогда
		ПараметрДата.Значение 		= НастройкаПериода.ДатаНачала;
		ПараметрДата.Использование 	= Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаДатаОкончанияПриИзменении(Элемент)
	
	ПараметрДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если ПараметрДата<>Неопределено  Тогда
		ПараметрДата.Значение 		= НастройкаПериода.ДатаОкончания;
		ПараметрДата.Использование 	= Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаВариантПриИзменении(Элемент)
	
	ПараметрДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если ПараметрДата<>Неопределено  Тогда
		ПараметрДата.Значение 		= НастройкаПериода.ДатаНачала;
		ПараметрДата.Использование 	= Истина;
	КонецЕсли;
	ПараметрДата = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если ПараметрДата<>Неопределено  Тогда
		ПараметрДата.Значение 		= НастройкаПериода.ДатаОкончания;
		ПараметрДата.Использование 	= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Период = КонецДня(Период);
	ПриИзмененииПараметра(Элементы.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСпискаОрганизацийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СписокСтруктурныхЕдиниц"              , СписокСтруктурныхЕдиниц);
	ДополнительныеПараметры.Вставить("СписокПодразделений"                  , СписокПодразделений);
	ДополнительныеПараметры.Вставить("СписокВладельцевГоловныхПодразделений", СписокВладельцевГоловныхПодразделений);
	ДополнительныеПараметры.Вставить("ВыборСтруктурныхПодразделений"        , ПоддержкаРаботыСоСтруктурнымиПодразделениями); 
	
	общ_ОтчетыКлиент.ПредставлениеСпискаОрганизацийНачалоВыбора(ЭтаФорма, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСпискаОрганизацийОчистка(Элемент, СтандартнаяОбработка)
	
	Если Не УчетПоВсемОрганизациям Тогда
		СтандартнаяОбработка = Ложь;
	Иначе 
		СписокПодразделений.Очистить();
		СписокСтруктурныхЕдиниц.Очистить();
		СписокВладельцевГоловныхПодразделений.Очистить();
		УправлениеФормой(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ ТАБЛИЧНОГО ДОКУМЕНТА

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(Результат.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
		ПодключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РезультатОбработки = ОбработатьРасшифровку(Расшифровка);
	Если РезультатОбработки = Неопределено Тогда
		Возврат;
	ИначеЕсли РезультатОбработки.Действие = "ОткрытьЗначение" Тогда
		ПоказатьЗначение(,РезультатОбработки.Параметр);
	ИначеЕсли РезультатОбработки.Действие = "ВыбратьРасшифровку" Тогда
		ОбратчикВыборРасшифровки = Новый ОписаниеОповещения("ОбрататьВыборРасшифровки",ЭтаФорма,Расшифровка);
		ПоказатьВыборИзСписка(ОбратчикВыборРасшифровки,РезультатОбработки.Параметр);
	Иначе
		ОткрытьФорму(РезультатОбработки.Действие,РезультатОбработки.Параметр,ЭтаФорма,УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ГРУППИРОВКА

&НаКлиенте
Процедура ГруппировкаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	общ_ОтчетыКлиент.ГруппировкаПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);  
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломИзменения(Элемент, Отказ)
	
	общ_ОтчетыКлиент.ГруппировкаПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Если ИспользоватьНастройкуПериода И НастройкаПериода.ДатаНачала>НастройкаПериода.ДатаОкончания Тогда
		ПоказатьПредупреждение(,"Дата начала отчетного периода не может быть больше даты его окончания!");
	Иначе
	
		ОчиститьСообщения();
		
		ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
		
		Попытка
			РезультатВыполнения = СформироватьОтчетНаСервере();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			ПоказатьПредупреждение(,"Отчет не сформирован из-за возникшей ошибки!");
			Возврат;
		КонецПопытки;
		Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
			ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("Подключаемый_ЗакрытьНастройки", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
	ПодключитьОбработчикОжидания("Подключаемый_ЗакрытьНастройки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;
	Элементы.РазделыОтчета.ТекущаяСтраница = Элементы.НастройкиОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ГруппировкиОтчета Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из ГруппировкиОтчета Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСнятьФлажки1(Команда)
	
	Для Каждого СтрокаТаблицы Из ДополнительныеГруппировкиОтчета Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаУстановитьФлажки1(Команда)
	
	Для Каждого СтрокаТаблицы Из ДополнительныеГруппировкиОтчета Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Показатели Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Показатели Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбрататьВыборРасшифровки(РезультатВыбора,Расшифровка) Экспорт
	
	Если РезультатВыбора<>Неопределено Тогда
		РезультатОбработки = ОбработатьРасшифровку(Расшифровка,РезультатВыбора.Значение);
		Если РезультатОбработки<>Неопределено Тогда
			ОткрытьФорму(РезультатОбработки.Действие,РезультатОбработки.Параметр,ЭтаФорма,УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
	
	Если Режим = "Выбор" ИЛИ Режим = "Группировка" ИЛИ Режим = "Отбор" Тогда
		Для Каждого ИмяПоказателя Из НаборПоказателей Цикл
			СписокПолей.Добавить(ИмяПоказателя);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция ОбработатьРасшифровку(Расшифровка,ВариантРасшифровки = Неопределено)
	
	ДанныеДляОбработки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки).ДанныеРасшифровки;
	ИнформацияДляРасшифровки = ДанныеДляОбработки.Элементы.Получить(Расшифровка);
	Если ИнформацияДляРасшифровки <> Неопределено Тогда
		ДействиеРасшифровки = СокрЛП(Строка(ИнформацияДляРасшифровки.ОсновноеДействие));
		Данные = ИнформацияДляРасшифровки.ПолучитьПоля();
		Если ДействиеРасшифровки= "Нет" Тогда
			Возврат Неопределено;
		ИначеЕсли ДействиеРасшифровки = "Открыть значение" Тогда
			Возврат Новый Структура("Действие,Параметр","ОткрытьЗначение",Данные[0].Значение);
		ИначеЕсли ДействиеРасшифровки = "Расшифровать" Тогда
			Если ИмяОтчета = "дог_АнализЗадолженностиБУПоДоговору" 
				ИЛИ ИмяОтчета = "дог_АнализЗадолженностиБУПоДоговоруВРазрезеПериодов"
				ИЛИ ИмяОтчета = "дог_ОстаткиЗадолженностиБУПоДоговору" Тогда
				ТаблицаОтбора = Новый ТаблицаЗначений;
				ТаблицаОтбора.Колонки.Добавить("Поле");
				ТаблицаОтбора.Колонки.Добавить("ВидСравнения");
				ТаблицаОтбора.Колонки.Добавить("Значение");
				ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
				ЗаполнитьОтборИзГруппировок(ТаблицаОтбора,ИнформацияДляРасшифровки,ДанныеДляОбработки);
				Если ТаблицаОтбора.Количество()=0 Тогда
					Возврат Неопределено;
				КонецЕсли;
				ИмяПоляРасшифровки = ИнформацияДляРасшифровки.ПолучитьПоля()[0].Поле;
				ВидОбязательства = Неопределено;
				ГруппаОбязательств = Неопределено;
				СрокЗадолженности = Неопределено;
				Счет = Неопределено;
				СтрокиПеременной = ТаблицаОтбора.НайтиСтроки(Новый Структура("Поле","ВидОбязательства"));
				Если СтрокиПеременной.Количество()>0 Тогда
					ВидОбязательства = СтрокиПеременной[0].Значение;
				КонецЕсли;
				СтрокиПеременной = ТаблицаОтбора.НайтиСтроки(Новый Структура("Поле","ГруппаОбязательств"));
				Если СтрокиПеременной.Количество()>0 Тогда
					ГруппаОбязательств = СтрокиПеременной[0].Значение;
				КонецЕсли;
				СтрокиПеременной = ТаблицаОтбора.НайтиСтроки(Новый Структура("Поле","СрокЗадолженности"));
				Если СтрокиПеременной.Количество()>0 Тогда
					СрокЗадолженности = СтрокиПеременной[0].Значение;
				КонецЕсли;
				СтрокиПеременной = ТаблицаОтбора.НайтиСтроки(Новый Структура("Поле","Счет"));
				Если СтрокиПеременной.Количество()>0 Тогда
					Счет = СтрокиПеременной[0].Значение;
				КонецЕсли;
				ПериодРасшифровкиНачало = НастройкаПериода.ДатаНачала;
				ПериодРасшифровкиКонец = НастройкаПериода.ДатаОкончания;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ПредставлениеСпискаПодразделений.Видимость = Форма.СписокПодразделений.Количество() > 0;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Процедура ОтменитьВыполнениеЗадания()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = общ_ОтчетыВызовСервера.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки) Экспорт
	
	Отчеты.ден_ПлатежныйКалендарь.ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки,Показатели,ГруппировкиОтчета,ДополнительныеГруппировкиОтчета);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере() Экспорт
	
	Если Не ПроверитьЗаполнениеНастроек() Тогда
		Возврат Новый Структура("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ИБФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	Если ИБФайловая Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		общ_ОтчетыВызовСервера.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"общ_ОтчетыВызовСервера.СформироватьОтчет",
			ПараметрыОтчета,
			общ_ОтчетыВызовСервера.ПолучитьНаименованиеЗаданияВыполненияОтчета(ЭтаФорма));
			
		АдресХранилища       = РезультатВыполнения.АдресХранилища;
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	КонецЕсли;
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура;
	Если ИспользоватьНастройкуПериода Тогда
		ПараметрыОтчета.Вставить("НачалоПериода"                     , НастройкаПериода.ДатаНачала);
		ПараметрыОтчета.Вставить("КонецПериода"                      , НастройкаПериода.ДатаОкончания);
	КонецЕсли;
	Если ИзменятьСтруктуруОтчета И Не ИспользоватьСтандартныеНастройкиСтруктуры Тогда
		ПараметрыОтчета.Вставить("Группировка"                       , ГруппировкиОтчета.Выгрузить());
		ПараметрыОтчета.Вставить("ДополнительныеГруппировки"         , ДополнительныеГруппировкиОтчета.Выгрузить());
	КонецЕсли;
	ПараметрыОтчета.Вставить("ДетализацияПоПериодам"                 , Отчет.ДетализацияПоПериодам);
	ПараметрыОтчета.Вставить("РежимРасшифровки"                      , Ложь);
	ПараметрыОтчета.Вставить("СписокСтруктурныхЕдиниц"               , СписокСтруктурныхЕдиниц);
	ПараметрыОтчета.Вставить("СписокПодразделений"                   , СписокПодразделений);
	ПараметрыОтчета.Вставить("СписокВладельцевГоловныхПодразделений" , СписокВладельцевГоловныхПодразделений);
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок"                     , ВыводитьЗаголовок);
	ПараметрыОтчета.Вставить("ВыводитьПодписи"                       , ВыводитьПодписи);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                     , ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("МакетОформления"                       , МакетОформления);	
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"                 , ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"                   , ИмяОтчета);
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"             , Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	СтруктураПараметровОтчетаДляФормирования = Новый Структура;
	Для Каждого ЭлементПараметров Из СписокПараметровОтчетаДляФормирования Цикл
		СтруктураПараметровОтчетаДляФормирования.Вставить(ЭлементПараметров.Значение,?(общ_ОтчетыВызовСервера.ЕстьРеквизитФормы(ЭтотОбъект,ЭлементПараметров.Значение),ЭтотОбъект[ЭлементПараметров.Значение],Отчет[ЭлементПараметров.Значение]));
	КонецЦикла;
	ПараметрыОтчета.Вставить("СтруктураПараметровОтчетаДляФормирования", СтруктураПараметровОтчетаДляФормирования);	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат           = РезультатВыполнения.Результат;
	ДанныеРасшифровки   = РезультатВыполнения.ДанныеРасшифровки;
	
	ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСтруктурногоПодразделения(РезультатВыбора, ДопПараметры) Экспорт
	
	ПослеВыбораСтруктурногоПодразделенияКлиент(ЭтаФорма, РезультатВыбора);
	
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСтруктурногоПодразделенияКлиент(Форма, РезультатВыбора) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		Форма.СписокСтруктурныхЕдиниц = РезультатВыбора.СписокСтруктурныхЕдиниц;
		Форма.ПредставлениеСпискаОрганизаций = ВыгрузитьСписокВСтроку(Форма.СписокСтруктурныхЕдиниц);
		общ_ОтчетыКлиент.ОрганизацияПриИзменении(Форма, Форма.ПредставлениеСпискаОрганизаций);
		
		//Если РаботаСОрганизациямиИСтруктурнымиПодразделениями Тогда
		//	Форма.СписокПодразделений = РезультатВыбора.СписокПодразделений;
		//	Форма.СписокВладельцевГоловныхПодразделений = РезультатВыбора.СписокВладельцевГоловныхПодразделений;
		//	
		//	Форма.ПредставлениеСпискаПодразделений = общ_ОтчетыВызовСервера.ВыгрузитьСписокВСтроку(Форма.СписокПодразделений);
		//	БухгалтерскиеОтчетыКлиент.ПодразделениеПриИзменении(Форма, Форма.ПредставлениеСпискаПодразделений);
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДопПараметры) Экспорт
	
	общ_ОтчетыКлиент.ГруппировкаПередНачаломДобавленияЗавершение(РезультатЗакрытия, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДопПараметры) Экспорт
	
	общ_ОтчетыКлиент.ГруппировкаПередНачаломИзмененияЗавершение(РезультатЗакрытия, ДопПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеНастроек()
	Отказ = Ложь;
	Если ИспользоватьНастройкуПериода И ЗначениеЗаполнено(НастройкаПериода.ДатаНачала) И НастройкаПериода.ДатаНачала > НастройкаПериода.ДатаОкончания Тогда
		ТекстСообщения = НСтр("ru = 'Дата начала периода не может быть больше даты конца периода'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "НастройкаПериода.ДатаНачала",, Отказ);
	КонецЕсли;
	Если ИспользованиеОрганизации Тогда
		
		Если НЕ ЗначениеЗаполнено(ПредставлениеСпискаОрганизаций) Тогда
			ТекстСообщения = НСтр("ru = 'Не указана организация.'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ПредставлениеСпискаОрганизаций",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	Возврат НЕ Отказ;	
КонецФункции

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	общ_ОтчетыКлиент.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьНастройки()
	
	Элементы.РазделыОтчета.ТекущаяСтраница = Элементы.Отчет;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 

			ЗагрузитьПодготовленныеДанные();
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборИПараметры()
	
	Попытка
		СтруктураПараметров = РеквизитФормыВЗначение("Отчет").ЗаполнениеПараметров;
		Для Каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
			мПараметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ЭлементСтруктуры.Ключ);
			Если мПараметр<>Неопределено И НЕ ЗначениеЗаполнено(мПараметр.Значение) Тогда
				мПараметр.Значение 		= ЭлементСтруктуры.Значение;
				мПараметр.Использование	= Истина;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	ОбновитьЗначенияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПараметров()
	
	Для Каждого ПараметрОтчета Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Имя 		= Строка(ПараметрОтчета.Параметр);
		Параметр 	= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(ПараметрОтчета.Параметр);
		Если НЕ Параметр.Видимость Тогда
			Продолжить;
		КонецЕсли;
		Если ИспользоватьНастройкуПериода И Имя="НачалоПериода" Тогда
			НастройкаПериода.ДатаНачала = ?(ТипЗнч(ПараметрОтчета.Значение)=Тип("СтандартнаяДатаНачала"),ПараметрОтчета.Значение.Дата,ПараметрОтчета.Значение);
			Продолжить;
		КонецЕсли;
		Если ИспользоватьНастройкуПериода И Имя="КонецПериода" Тогда
			НастройкаПериода.ДатаОкончания = ?(ТипЗнч(ПараметрОтчета.Значение)=Тип("СтандартнаяДатаНачала"),ПараметрОтчета.Значение.Дата,ПараметрОтчета.Значение);
			Продолжить;
		КонецЕсли;
		ЭтаФорма[Имя] 	= ПараметрОтчета.Значение;
		Если ЭтаФорма[Имя]<>ПараметрОтчета.Значение И ТипЗнч(ПараметрОтчета.Значение)=Тип("СтандартнаяДатаНачала") Тогда
			ЭтаФорма[Имя] = ПараметрОтчета.Значение.Дата;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
                                                                                       
&НаКлиенте
Процедура ПриИзмененииПараметра(Элемент)
	
	УстановитьЗначениеПараметра(Элемент.Имя,ЭтаФорма[Элемент.Имя]);
	Если Не ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПараметра(Имя,Значение)
	
	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(Имя);
	Параметр.Значение = Значение;
	Параметр.Использование=Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПредставлениеПериода(ОтчетОбъект = Неопределено, НачалоПериода = Неопределено, КонецПериода = Неопределено, ТолькоДаты  = Ложь) Экспорт
	
	ТекстПериод = "";
	
	Если ОтчетОбъект <> Неопределено Тогда 
		ПараметрНачало = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ПараметрКонец = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ПараметрПериод = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период");
		Если ПараметрНачало = Неопределено И  ПараметрКонец = Неопределено И ПараметрПериод = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		НачалоПериода = ?(ПараметрНачало=Неопределено,ПараметрПериод.Значение,ПараметрНачало.Значение);
		КонецПериода  = ?(ПараметрКонец=Неопределено,ПараметрПериод.Значение,ПараметрКонец.Значение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Если КонецПериода >= НачалоПериода Тогда
			ТекстПериод = ?(ТолькоДаты, "", " за ") + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП");
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) И Не ЗначениеЗаполнено(КонецПериода) Тогда
		ТекстПериод = ?(ТолькоДаты, "", " за ") + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(Дата(3999, 11, 11)), "ФП");
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, Найти(ТекстПериод, " - ")), " - ...");
	КонецЕсли;
	
	Возврат ТекстПериод;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОтборИзГруппировок(ТаблицаОтбора,ИнформацияДляРасшифровки,ДанныеРасшифровки)
	
	РодительскиеПоля = ИнформацияДляРасшифровки.ПолучитьРодителей();
	Для Каждого ПолеРодитель Из РодительскиеПоля Цикл
		ДанныеРодителя = ДанныеРасшифровки.Элементы.Получить(ПолеРодитель.Идентификатор);
		Если НЕ ТипЗнч(ДанныеРодителя)=Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
			Для Каждого ПолеРодителя Из ДанныеРодителя.ПолучитьПоля() Цикл
				Если ПолеРодителя.Поле = "ЕдиницаИзмерения" Тогда
					Продолжить;
				КонецЕсли;
				НС = ТаблицаОтбора.Добавить();
				НС.Поле = ПолеРодителя.Поле;
				НС.Значение = ПолеРодителя.Значение;
				НС.ВидСравнения = ?(ЗначениеЗаполнено(ПолеРодителя.Значение),?(ПолеРодителя.Иерархия,"ВИерархии","Равно"),"Незаполнено");
			КонецЦикла;
		КонецЕсли;
		ЗаполнитьОтборИзГруппировок(ТаблицаОтбора,ДанныеРодителя,ДанныеРасшифровки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОтборИСортировкуНаСервере()
	
	ОтображатьОтборИСортировку 					= НЕ ОтображатьОтборИСортировку;
	Элементы.ПоказатьОтборИСортировку.Пометка 	= ОтображатьОтборИСортировку;
	Элементы.ГруппаНастройки.Видимость 			= ОтображатьОтборИСортировку;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтборИСортировку(Команда)
	
	ПоказатьОтборИСортировкуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтандартныеНастройкиСтруктурыПриИзменении(Элемент)
	
	Элементы.РазделыНастроек.Доступность = НЕ ИспользоватьСтандартныеНастройкиСтруктуры;
	//Если ИспользоватьСтандартныеНастройкиСтруктуры Тогда
	//	ЗаполняемыеНастройки = Новый Структура("Показатели, Группировка, ДополнительныеПоля", Ложь, Истина, Ложь);
	//	ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки);
	//КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры
