
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Проводка Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Проводка.ВидУчетаДт) ИЛИ НЕ ЗначениеЗаполнено(Проводка.ВидУчетаКт) Тогда
			ВидУчетаДт = Проводка.ВидУчетаДт;
			ВидУчетаКт = Проводка.ВидУчетаКт;			
			//ПроцедурыНалоговогоУчета.ВидУчетаНУ(Проводка, Проводка.Регистратор.ОтражатьВНалоговомУчете, Проводка.Регистратор.ВидУчетаНУ);
			Если (ЗначениеЗаполнено(ВидУчетаДт)) И
				(ЗначениеЗаполнено(Проводка.СчетДт)) Тогда
				Проводка.ВидУчетаДт = ВидУчетаДт;
			КонецЕсли;	
			Если (ЗначениеЗаполнено(ВидУчетаКт)) И
				(ЗначениеЗаполнено(Проводка.СчетКт))  Тогда
				Проводка.ВидУчетаКт = ВидУчетаКт;
			КонецЕсли;			
		КонецЕсли;
		// Приведение пустых значений субконто составного типа.
		Для Каждого Субконто Из Проводка.СубконтоДт Цикл
			Если Субконто.Ключ.ТипЗначения.Типы().Количество() > 1
				И НЕ ЗначениеЗаполнено(Субконто.Значение) 
				И НЕ (Субконто.Значение = Неопределено) Тогда
				Проводка.СубконтоДт.Вставить(Субконто.Ключ, Неопределено);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Субконто Из Проводка.СубконтоКт Цикл
			Если Субконто.Ключ.ТипЗначения.Типы().Количество() > 1
				И НЕ ЗначениеЗаполнено(Субконто.Значение) 
				И НЕ (Субконто.Значение = Неопределено) Тогда
				Проводка.СубконтоКт.Вставить(Субконто.Ключ, Неопределено);
			КонецЕсли;
		КонецЦикла;
		
		СписокСчетовВА = Неопределено;
		
		Если ЗначениеЗаполнено(Проводка.СтруктурноеПодразделениеДт) И ЗначениеЗаполнено(Проводка.СчетДт) Тогда
			
			Если СписокСчетовВА = Неопределено Тогда 
				СписокСчетовВА = глЗначениеПеременной("глСписокСчетовВА")
			КонецЕсли;
			
			Если ПроцедурыБухгалтерскогоУчета.СчетЯвляетсяВАНУ(Проводка.СчетДт, СписокСчетовВА) Тогда 
				Проводка.СтруктурноеПодразделениеДт = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Проводка.СтруктурноеПодразделениеКт) И ЗначениеЗаполнено(Проводка.СчетКт) Тогда
			
			Если СписокСчетовВА = Неопределено Тогда 
				СписокСчетовВА = глЗначениеПеременной("глСписокСчетовВА")
			КонецЕсли;
			
			Если ПроцедурыБухгалтерскогоУчета.СчетЯвляетсяВАНУ(Проводка.СчетКт, СписокСчетовВА) Тогда 
				Проводка.СтруктурноеПодразделениеКт = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
