
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью" элемента.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	Если (Не ЭтоГруппа) И (Не ЗначениеЗаполнено(СпособСписания)) Тогда		
		ОбщегоНазначения.СообщитьОбОшибке("Не указан способ списания расходов будущих периодов", Отказ, "", СтатусСообщения.Важное);
	КонецЕсли;
	
	Если СпособСписания = Перечисления.СпособыСписанияРБП.Равномерно и Сумма = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана сумма расходов будущих периодов", Отказ, "", СтатусСообщения.Важное);
	КонецЕсли;                                                                                            	

КонецПроцедуры // ПередЗаписью()
