&наКлиенте
Перем мОбработкаТайпинга;
&наКлиенте
Перем мТекстТайпинга;
&наКлиенте
Перем мПоследнееЗначениеЭлементаТайпинга;
&наКлиенте
Перем мСтруктураИзмерений Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

// Процедура вызывается при ОбновлениеОтображения формы.
//

// Процедура вызывается при открытии формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Объект.ТолькоПросмотр     = НЕ Объект.ДоступностьОбъекта;
	Если Объект.Вид = Неопределено Тогда
		Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Объект) И Объект.ДоступностьОбъекта Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Объект;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Вид) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Вид;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.Представление;
	КонецЕсли; 
	мПоследнееЗначениеЭлементаТайпинга = Объект.Вид;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	Сохранение(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранение(Закрывать) 
	Если Объект.Представление <> "" И ЗначениеЗаполнено(Объект.Вид) Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Истина;
		ОповеститьОВыборе(куфиб_УправлениеКонтактнойИнформациейКлиент.СохранениеКИ(Объект, Параметры));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Кнопка)
	Сохранение(Истина);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

// Процедура вызывается при очистке значения элемента формы Объект.
//
&НаКлиенте
Процедура ОбъектОчистка(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Объект.Вид) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
		Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли; 
КонецПроцедуры

// Процедура перехватывает момент начала выбора вида контактной информации.
//
// Параметры
//  Элемент - элемент формы, выбор значения которого должен произойти
//  СтандартнаяОбработка - булево, флаг стандартной обработки выбора.
&НаКлиенте
Процедура ВидНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Объект = Неопределено ИЛИ Объект.Объект.Пустая() Тогда
		Сообщить("Выберите объект.");
		Возврат;
	КонецЕсли;
	куфиб_УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВыбораВидаКИ(Истина, Элемент, Объект.Тип, куфиб_УправлениеКонтактнойИнформацией.ВидОбъектаКИ(Объект.Объект));
КонецПроцедуры

// Процедура перехватывает момент начала выбора Объекта.
//
// Параметры
//  Элемент - элемент формы, выбор значения которого должен произойти
//  СтандартнаяОбработка - булево, флаг стандартной обработки выбора.
&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = куфиб_УправлениеКонтактнойИнформациейКлиент.НачалоВыбораОбъектаКИ(ЭтаФорма, Элемент, глТекущийПользователь);
КонецПроцедуры

// Процедура вызывается по кнопке Открытия значения реквизита Представление.
&НаКлиенте
Процедура ПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 	Если НЕ ПустаяСтрока(Элемент.ТекстРедактирования) Тогда
		Попытка
			ЗапуститьПриложение(СокрЛП(Элемент.ТекстРедактирования));
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик события ОкончаниеВводаТекста элемента формы Вид.
//
&НаКлиенте
Процедура ВидОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	мПоследнееЗначениеЭлементаТайпинга=Ложь;
	куфиб_РаботаСДиалогами.ОкончаниеВводаТекстаВЭлементеУправления(Элемент, Текст, Значение, СтандартнаяОбработка, Новый Структура("Тип, ВидОбъектаКонтактнойИнформации",Объект.Тип, куфиб_УправлениеКонтактнойИнформацией.ВидОбъектаКИ(Объект.Объект)), ЭтаФорма, Тип("СправочникСсылка.ВидыКонтактнойИнформации"), мОбработкаТайпинга, мТекстТайпинга, мПоследнееЗначениеЭлементаТайпинга);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	куфиб_УправлениеКонтактнойИнформацией.УстановкаПараметровОкна(Параметры, Объект, Элементы);		
	//оформление
	оф_ВебСтраницаЗаголовок = "Веб-страница";
КонецПроцедуры






мОбработкаТайпинга                 = Ложь;
мТекстТайпинга                     = "";
мПоследнееЗначениеЭлементаТайпинга = Неопределено;
мСтруктураИзмерений                = Неопределено;