// Обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)

	Если Не ОбменДанными.Загрузка Тогда
		Если НЕ ЗначениеЗаполнено(Эквайрер) Тогда
			#Если Клиент Тогда
			Если НЕ ЗначениеЗаполнено(Эквайрер) Тогда
				ОшибкаПриЗаписи("Для договора эквайринга """ + Наименование + """ не указан эквайрер.
							 |Элемент не записан.", 
							 СтатусСообщения.Важное);
			КонецЕсли;
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
			#Если Клиент Тогда
			Если НЕ ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
				ОшибкаПриЗаписи("Для договора эквайринга """ + Наименование + """ не указан договор взаиморасчетов.
							 |Элемент не записан.", 
							 СтатусСообщения.Важное);
			КонецЕсли;
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;

		Заголовок = "Справочник ""Договоры эквайринга"": ";

		СтруктураОбязательныхПолей = Новый Структура("ВидОплаты");
		ОбщегоНазначения.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ТарифыЗаРасчетноеОбслуживание", СтруктураОбязательныхПолей, Отказ, Заголовок);

	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

// Процедура выводит текст сообщения о ошибке
//
Процедура ОшибкаПриЗаписи(ТекстСообщения, Статус = Неопределено)

	ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Истина, "", Статус);

КонецПроцедуры

