
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИмяПоказателя") Тогда
		Заголовок = "Изменение показателя """+Параметры.ИмяПоказателя+"""";
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	Параметры.Свойство("ДействиеНадПоказателем",ДействиеНадПоказателем);
	Параметры.Свойство("Величина",Величина);
	Если НЕ ЗначениеЗаполнено(ДействиеНадПоказателем) Тогда
		ДействиеНадПоказателем = Перечисления.фин_ДействияНадПоказателем.УмножитьНаКоэффициент;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Величина) Тогда
		Величина = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если ПроверитьЗаполнение() Тогда
		Закрыть(Новый Структура("ДействиеНадПоказателем,Величина",ДействиеНадПоказателем,Величина));	
	КонецЕсли;
КонецПроцедуры
