
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.АвтоМасштаб = Истина;

	ПечатьРесстр(ПараметрКоманды,ТабДок);
	КоличествоЭкземпляров = 1;
	НаПринтер = Ложь;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ПараметрКоманды,"Реестр платежей "));	
КонецПроцедуры

&НаСервере
Процедура ПечатьРесстр(ПараметрКоманды,ТабДок)
	ТабДок.Очистить();
		
	Макет     = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ПолучитьМакет("Реестр");
	Шапка     = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строки");
	
	ИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
	
	ПодписьДиректораДК    = Макет.ПолучитьОбласть("ПодписьДиректораДК");
	ПодписьДиректораДЗСХП = Макет.ПолучитьОбласть("ПодписьДиректораДЗСХП");
	ПодписьДиректораФД    = Макет.ПолучитьОбласть("ПодписьДиректораФД");
	ПодписьГБ             = Макет.ПолучитьОбласть("ПодписьГБ");
	ПодписьМенДЗСХП       = Макет.ПолучитьОбласть("ПодписьМенДЗСХП");
	
	Подвал    = Макет.ПолучитьОбласть("Подвал");
	
	ПодписьДиректораДК.Параметры.ДолжностьДиректораДК       = "Курирующий руководитель";
	ПодписьДиректораДЗСХП.Параметры.ДолжностьДиректораДЗСХП = "Директор инициирующего структурного подразделения";
	ПодписьДиректораФД.Параметры.ДолжностьДиректораФД       = "Директор финансового департамента";
	ПодписьГБ.Параметры.ДолжностьГБ                         = "Главный бухгалтер";
	
	Шапка.Параметры.ДатаРеестра = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.НомерРеестра = ПараметрКоманды.Номер;
	ТабДок.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерСтроки КАК НомерСтроки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Контрагент,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора.НомерДоговора КАК НомерДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора.ДатаДоговора КАК ДатаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Культура,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Объем,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Цена,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Собственные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Заемные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Элеватор,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РасчетныйСчет,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Гарантия,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Гарантия.ДатаВыдачи,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Гарантия.НомерГарантии КАК НомерГарантии,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.БюджетКредит,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ППИ.Дата КАК ДатаФактическогоПлатежа,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ППИ.ДатаВыписки КАК ДатаПлатежногоПоручения,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РеспБюджет,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Примечание
	 |ИЗ
	 |	БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.РасчетнаяТаблица КАК СогласованиеПлатежейПоЗакупуРасчетнаяТаблица
	 |ГДЕ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка = &Ссылка
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    НомерСтроки = 0;
	ОбщийОбъем  = 0;
	ОбщаяСумма = 0;
	ОбщаяСобственные  = 0;
	ОбщаяЗаемные = 0;
	ОбщаяБюджетКредит = 0;
	ОбщаяРеспБюджет = 0;
	
	Пока Выборка.Следующий() Цикл 
		
		ОблСтрока.Параметры.Заполнить(Выборка);
		
		ОблСтрока.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy");
		//ОблСтрока.Параметры.ДатаЗерновой = Формат(Выборка.ДатаЗерновой,"ДФ=dd.MM.yyyy");
		
		ОблСтрока.Параметры.Объем = Выборка.Объем;
			ОбщийОбъем = ОбщийОбъем + Выборка.Объем;
		ОблСтрока.Параметры.СуммаДоговора = Выборка.СуммаДоговора;
			ОбщаяСумма = ОбщаяСумма + Выборка.СуммаДоговора;
		ОблСтрока.Параметры.Собственные = Выборка.Собственные;
			ОбщаяСобственные = ОбщаяСобственные + Выборка.Собственные;
		//ОблСтрока.Параметры.Заемные = Выборка.Заемные;
		//	ОбщаяЗаемные = ОбщаяЗаемные + Выборка.Заемные;	
			
		//ОблСтрока.Параметры.БюджетКредит = Выборка.БюджетКредит;
		//	ОбщаяБюджетКредит = ОбщаяБюджетКредит + Выборка.БюджетКредит;	
			
		ОблСтрока.Параметры.РеспБюджет = Выборка.РеспБюджет;
			ОбщаяРеспБюджет = ОбщаяРеспБюджет + Выборка.РеспБюджет;	

		ОблСтрока.Параметры.Примечание = Выборка.Примечание;

			
		Если ТипЗнч(Выборка.Гарантия) = ТипЗнч(Справочники.зм_Гарантии.ПустаяСсылка()) ИЛИ Выборка.Гарантия = Неопределено Тогда
			ОблСтрока.Параметры.ДатаГарантии = Формат(Выборка.ГарантияДатаВыдачи,"ДФ=dd.MM.yyyy");
		Иначе
			ОблСтрока.Параметры.ДатаГарантии = Формат(Выборка.Гарантия.ДатаДоговора,"ДФ=dd.MM.yyyy");
			ОблСтрока.Параметры.НомерГарантии = Выборка.Гарантия.НомерДоговора;
		КонецЕсли;

		//ОблСтрока.Параметры.ДатаФактическогоПлатежа = Формат(Выборка.ДатаФактическогоПлатежа,"ДФ=dd.MM.yyyy");
		//ОблСтрока.Параметры.ДатаПлатежногоПоручения = Формат(Выборка.ДатаПлатежногоПоручения,"ДФ=dd.MM.yyyy");

		ТабДок.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	// выводим итоговые суммы 	
	ИтогиТаблицы.Параметры.ИтогоОб = ОбщийОбъем;
	ИтогиТаблицы.Параметры.ИтогоСумма  = ОбщаяСумма;
	ИтогиТаблицы.Параметры.ИтогоСоб = ОбщаяСобственные;
	//Подвал.Параметры.ИтогоЗаем = ОбщаяЗаемные;
	//Подвал.Параметры.ИтогоБюджетКредит = ОбщаяБюджетКредит;
	ИтогиТаблицы.Параметры.ИтогоРеспБюджет = ОбщаяРеспБюджет;
	
	//ТабДок.Вывести(ИтогиТаблицы);
	
	// Получаем руководитель 
	//+++ Oleg SmartT. 2021-04-08	
	Для Каждого Стр из ПараметрКоманды.Подписи Цикл
		
		СФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
		ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;	
			
		Если Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСКурирующимЧП Тогда
			ПодписьДиректораДК.Параметры.ФИОДиректораДК       = СФио;
			ПодписьДиректораДК.Параметры.ДолжностьДиректораДК = ДолжностьДляПечФормы;
			ПодписьДиректораДК.Параметры.ВремяПодписания1     = Стр.Дата;
			ПодписьДиректораДК.Параметры.Согласовано1         = "Утверждено";
			ПодписьДиректораДК.Параметры.ФлСогл1		      = "V";
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСРП Тогда
			ПодписьДиректораДЗСХП.Параметры.ФИОДиректораДЗСХП       = СФио;
			ПодписьДиректораДЗСХП.Параметры.ДолжностьДиректораДЗСХП = ДолжностьДляПечФормы;
			ПодписьДиректораДЗСХП.Параметры.ВремяПодписания2        = Стр.Дата;
			ПодписьДиректораДЗСХП.Параметры.Согласовано2            = "Подписано";
			ПодписьДиректораДЗСХП.Параметры.ФлСогл2		            = "V";
			
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСФД Тогда;
			ПодписьДиректораФД.Параметры.ФИОДиректораФД       = СФио;
			ПодписьДиректораФД.Параметры.ДолжностьДиректораФД = ДолжностьДляПечФормы;
			ПодписьДиректораФД.Параметры.ВремяПодписания3     = Стр.Дата;
			ПодписьДиректораФД.Параметры.Согласовано3         = "Согласовано";
			ПодписьДиректораФД.Параметры.ФлСогл3		      = "V";	
			
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСГБ Тогда
			ПодписьГБ.Параметры.ФИОГБ            = СФио;
			ПодписьГБ.Параметры.ДолжностьГБ      = ДолжностьДляПечФормы;
			ПодписьГБ.Параметры.ВремяПодписания4 = Стр.Дата;
			ПодписьГБ.Параметры.Согласовано4     = "Согласовано";
			ПодписьГБ.Параметры.ФлСогл4		     = "V";
		КонецЕсли;
		
	КонецЦикла;
	
	СФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
	ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;
	ПодписьМенДЗСХП.Параметры.ФИОМенеджераДЗСХП       = СФио;
	ПодписьМенДЗСХП.Параметры.ДолжностьМенеджераДЗСХП = ДолжностьДляПечФормы;
	ПодписьМенДЗСХП.Параметры.ВремяПодписания5        = ПараметрКоманды.Дата;
	ПодписьМенДЗСХП.Параметры.Согласовано5            = "Согласовано";
	ПодписьМенДЗСХП.Параметры.ФлСогл5		          = "V";

	
	ТабДок.Вывести(ПодписьДиректораДК);
	ТабДок.Вывести(ПодписьДиректораДЗСХП);
	ТабДок.Вывести(ПодписьДиректораФД);
	ТабДок.Вывести(ПодписьГБ);
	ТабДок.Вывести(ПодписьМенДЗСХП);
	
	Подвал.Параметры.ДатаРеестра             = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	//--- Oleg SmartT. 2021-04-08	
		
	ТабДок.Вывести(Подвал);
КонецПроцедуры	
