////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ПередЗаписью" документа.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	Если ВидРезерва = Перечисления.ВидыРезервов.ПоВознаграждениямРаботникам Тогда
		// проверим, чтобы не было в табличной части двух одинаковых видов расчета
		ТаблицаДляПроверки = БазовыеВидыРасчета.Выгрузить();
		
		ТаблицаДляПроверки.Колонки.Добавить("КоличествоВР");
		ТаблицаДляПроверки.ЗаполнитьЗначения(1, "КоличествоВР");
		ТаблицаДляПроверки.Свернуть("ВидРасчета", "КоличествоВР");
		
		Для Каждого СтрокаТЗ Из ТаблицаДляПроверки Цикл
			Если СтрокаТЗ.КоличествоВР > 1 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Вид расчета '" + СтрокаТЗ.ВидРасчета + "' указан в качестве базового вида расчета " + СтрокаТЗ.КоличествоВР + " раз(а)!", Отказ, "", СтатусСообщения.Важное);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
