
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	куфиб_РаботаСДиалогами.УстановитьОтборПоОрганизации(ЭтаФорма, УчетПоВсемОрганизациям, ОсновнаяОрганизация, "СправочникСписок");
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если НЕ  Элементы.Список.ТекущиеДанные = Неопределено  Тогда
		Элементы.Дерево.ТекущийЭлемент = Элементы.Список.ТекущийРодитель;
		ЭтаФорма.Заголовок = ?(Элементы.Список.ТекущиеДанные.Владелец.Пустая(), "Владелец не задан",Элементы.Список.ТекущиеДанные.Владелец) ; 
		//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаСоздать").Видимость = Истина;	
	КонецЕсли;  
КонецПроцедуры