
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ЗаполнениеПараметров Экспорт; 	//Заполнение параметров
Перем ИзменятьСтруктуруОтчета Экспорт;  //изменять структуру

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

Сценарий = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ОсновнойСценарийПланированияЗакупок");
ЗаполнениеПараметров = Новый Структура;
ЗаполнениеПараметров.Вставить("Сценарий",Сценарий);
ЗаполнениеПараметров.Вставить("НачалоПериодаПланирования",	фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаНачалаПериода(ТекущаяДата(),Сценарий));
ЗаполнениеПараметров.Вставить("КонецПериодаПланирования",	фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьГоризонтПланирования(ТекущаяДата(),Сценарий));

ИзменятьСтруктуруОтчета = Истина;