
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ВРаботе;	
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
	
КонецПроцедуры

Функция ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСОбластноеПредставительство Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ОбластноеПредставительство) Тогда
			Возврат ЭтотОбъект.ОбластноеПредставительство;
		КонецЕсли;
	КонецЕсли;
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСДепартаментУчетаИХранения Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.ДепартаментУчетаИХранения) Тогда
			Возврат ЭтотОбъект.ДепартаментУчетаИХранения;
		КонецЕсли;
	КонецЕсли;
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ВозвращеноАвтору Тогда
		Возврат Постановщик;
	КонецЕсли;

	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСДиректорОбластноеПредставительство Тогда
		Возврат ДиректорОбластноеПредставительство;
	КонецЕсли;

	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеССогласующим Тогда
		Возврат Согласующий;
	КонецЕсли;

	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемСП Тогда
		
		//Если ЗначениеЗаполнено(ЭтотОбъект.ДиректорСТП) Тогда
		//	Возврат ЭтотОбъект.ДиректорСТП;
		//КонецЕсли;
		
		Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоРеквизиту("Физлицо", Постановщик.ФизЛицо);
		Подразделение = Сотрудник.ТекущееПодразделениеОрганизации;
		
			Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
		|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
		|ГДЕ
		|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
		|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
		|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
		|	И Бит_АдресацияУведомленийПоКомандировкам.Подразделение = &Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь УБЫВ";
		
		Запрос.УстановитьПараметр("Пользователь", Постановщик);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		Запрос.УстановитьПараметр("Подразделение", Подразделение);

		Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
		
		Результат = Запрос.Выполнить();
		Выборка = результат.Выбрать();
		Если Выборка.Следующий() тогда
			Возврат Выборка.Адресат;
		КонецЕсли;
		
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
	|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
	|ГДЕ
	|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
	|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
	|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Постановщик);
	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());

	Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
	
	Результат = Запрос.Выполнить();
	Выборка = результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Адресат;
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьЭтап(Постановщик, ТочкаЭтапа,ФормируемыеЗадачи,Отказ, ЯвныйАдресат = Неопределено)
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда 
		Адресат = Постановщик;
	Иначе    
		Если ЯвныйАдресат = Неопределено тогда
			Адресат = ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
		Иначе
			Адресат = ЯвныйАдресат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Адресат = Неопределено или Адресат.Пустая() тогда 
		Отказ = Истина;
		Сообщить("Для текущего пользователя на этапе " + ТочкаЭтапа + " не найден адресат");
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача из ФормируемыеЗадачи Цикл
		
		Если ТипЗнч(Адресат) = Тип("СправочникСсылка.Пользователи") тогда
			Задача.Пользователь = Адресат;
		Иначе
			Задача.Подразделение = Адресат;
		КонецЕсли;
		ЦС_ОбщегоНазначенияСервер.ОтправитьПисьмоПоИзменениюЗаявок(Задача.бизнеспроцесс, Адресат, Задача);
	КонецЦикла;
	
	ЭтотОбъект.Записать();

КонецПроцедуры

Процедура ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат,МаркерЭтапа)
	
	Если МаркерЭтапа = "Разрешено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Разрешено;
	ИначеЕсли МаркерЭтапа = "Возвращено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Возвращено;
	ИначеЕсли МаркерЭтапа = "Отказано" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказано;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ТекущаяТочка = ТочкаМаршрутаБизнесПроцесса;
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.СогласованиеСДиректорОбластноеПредставительство")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСДиректорОбластноеПредставительство;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.СогласованиеССогласующим")	Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеССогласующим;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.СогласованиеСОбластноеПредставительство")	Тогда     
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСОбластноеПредставительство;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.СогласованиеСДепартаментУчетаИХранения")	Тогда  
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСДепартаментУчетаИХранения;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.РаботаСЗаявкойАвтором") Тогда
		Этап = Справочники.ЦС_ЭтапыМаршрутовБП.ВозвращеноАвтору;
	КонецЕсли;	
	
	ОбработатьЭтап(Автор, Этап, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура РезультатПроверкиВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекущаяТочка = ТочкаВыбораВарианта;
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.РезультатПроверкиДиректорОбластноеПредставительство")	Тогда
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеДиректорОбластноеПредставительство; 
		МаркерЭтапа = ПроверкаНаПолнотуСведенийВыполнена; 		
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.РезультатПроверкиСогласующий")	Тогда
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеСогласующим; 	
		
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.РезультатСогласованиеСОбластноеПредставительство")	Тогда      
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеОбластноеПредставительство; 	
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.РасчетПоХранениюЗерна.ТочкаМаршрута.РезультатСогласованиеСДепартаментУчетаИХранения")	Тогда      
		МаркерЭтапа = ЗаявкаПрошлаСогласованиеДепартаментУчетаИХранения; 	
	КонецЕсли;
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, МаркерЭтапа);	
		
КонецПроцедуры

Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если ЗначениеЗаполнено(Согласующий) Тогда
		Результат = Истина
	Иначе
		Результат = Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура СогласованиеСРуководителемКДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемКД,ФормируемыеЗадачи,Отказ);
	
КонецПроцедуры

Процедура СозданиеПППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СозданиеПП,ФормируемыеЗадачи,Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.ЗаявкаПрошлаСогласованиеДиректорОбластноеПредставительство = "";
	ЭтотОбъект.ЗаявкаПрошлаСогласованиеСогласующим = "";
	//ЭтотОбъект.ПроверкаДиректоромКДВыполнена = "";
	ЭтотОбъект.ПроверкаНаПолнотуСведенийВыполнена = "";
	
	ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	ЭтотОбъект.Подписи.Очистить();

КонецПроцедуры







