&НаСервере
Процедура ЗаполнитьСписокВыбора()
	СписокОбъектов.Очистить();
	Если Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Справочник Тогда
		Для Каждого Справочник Из Метаданные.Справочники Цикл
			СписокОбъектов.Добавить(Справочник.Имя,Справочник.Синоним);
		КонецЦикла;
	ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Перечисление Тогда
		Для Каждого Справочник Из Метаданные.Перечисления Цикл
			СписокОбъектов.Добавить(Справочник.Имя,Справочник.Синоним);
		КонецЦикла;
	ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланСчетов Тогда
		Для Каждого Справочник Из Метаданные.ПланыСчетов Цикл
			СписокОбъектов.Добавить(Справочник.Имя,Справочник.Синоним);
		КонецЦикла;
	ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовРасчета Тогда
		Для Каждого Справочник Из Метаданные.ПланыВидовРасчета Цикл
			СписокОбъектов.Добавить(Справочник.Имя,Справочник.Синоним);
		КонецЦикла;
	ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовХарактеристик Тогда
		Для Каждого Справочник Из Метаданные.ПланыВидовХарактеристик Цикл
			СписокОбъектов.Добавить(Справочник.Имя,Справочник.Синоним);
		КонецЦикла;
	КонецЕсли;
	СписокОбъектов.СортироватьПоПредставлению();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбора();
	УстановитьТип();
КонецПроцедуры

&НаСервере
Процедура УстановитьТип()
	ОписаниеТипа = Новый ОписаниеТипов("Неопределено");
	Если ЗначениеЗаполнено(Объект.ТипПоказателя) И Объект.ИмяОбъекта<>"" Тогда
		Если Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Справочник Тогда
			База = "СправочникСсылка"
		ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.Перечисление Тогда
			База = "ПеречислениеСсылка"
		ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланСчетов Тогда
			База = "ПланСчетовСсылка"
		ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовРасчета Тогда
			База = "ПланВидовРасчетаСсылка"
		ИначеЕсли Объект.ТипПоказателя = Перечисления.фин_ТипыВходящихПоказателейБюджетирования.ПланВидовХарактеристик Тогда
			База = "ПланВидовХарактеристикСсылка"
		КонецЕсли;
		Если Метаданные.НайтиПоПолномуИмени(СтрЗаменить(База,"Ссылка","")+"."+Объект.ИмяОбъекта)<>Неопределено Тогда
			ОписаниеТипа = Новый ОписаниеТипов(База+"."+Объект.ИмяОбъекта);
		Иначе
			ОписаниеТипа = Новый ОписаниеТипов("Неопределено");
		КонецЕсли;
	КонецЕсли;
	Элементы.СписокДанныхЗначение.ОграничениеТипа=ОписаниеТипа;
КонецПроцедуры

&НаКлиенте
Процедура ТипПоказателяПриИзменении(Элемент)
	ЗаполнитьСписокВыбора();
	Объект.ИмяОбъекта = "";
	Объект.ПредставлениеОбъекта = "";
	Объект.СписокДанных.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Объект.ИмяОбъекта = ВыбранноеЗначение;
	Объект.ПредставлениеОбъекта = СписокОбъектов.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	Объект.СписокДанных.Очистить();
	УстановитьТип();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ДанныеВыбора = СписокОбъектов;
КонецПроцедуры
