

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Заполнение


////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ДополнительныеДанные = Новый Массив;
	ДополнительныеДанные.Добавить("ЗакрытиеПериода");
	
	ДополнительныеПараметры = Новый Структура;
	
	ДополнительныеПараметры.Вставить("БюджетированиеПоОрганизациям",фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("БюджетированиеПоОрганизациям"));
	ДополнительныеПараметры.Вставить("ВестиУчетПоПроектам",фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("фин_ВестиУчетПоПроектам"));
	
	ПараметрыПроведения = фин_УправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ,,,,,,,ДополнительныеПараметры,ДополнительныеДанные);
	
	Возврат ПараметрыПроведения;

КонецФункции 


Функция ТекстЗапросаЗакрытиеПериода(НомераТаблиц,ПараметрыПроведения, Реквизиты)  Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	фин_ЗакрытиеБюджетныхПериодов.Ссылка,
	               |	фин_ЗакрытиеБюджетныхПериодов.ВерсияДанных,
	               |	фин_ЗакрытиеБюджетныхПериодов.ПометкаУдаления,
	               |	фин_ЗакрытиеБюджетныхПериодов.Номер,
	               |	фин_ЗакрытиеБюджетныхПериодов.Дата,
	               |	фин_ЗакрытиеБюджетныхПериодов.Проведен,
	               |	фин_ЗакрытиеБюджетныхПериодов.Автор,
	               |	фин_ЗакрытиеБюджетныхПериодов.ГраницаФиксации,
	               |	фин_ЗакрытиеБюджетныхПериодов.Комментарий,
	               |	ВЫБОР
	               |		КОГДА &БюджетированиеПоОрганизациям
	               |			ТОГДА фин_ЗакрытиеБюджетныхПериодов.Организация
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |	КОНЕЦ КАК Организация,
	               |	фин_ЗакрытиеБюджетныхПериодов.Ответственный,
	               |	ВЫБОР
	               |		КОГДА &ВестиУчетПоПроектам
	               |			ТОГДА фин_ЗакрытиеБюджетныхПериодов.Проект
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ИмяСправочникаПроектов()+".ПустаяСсылка)
	               |	КОНЕЦ КАК Проект,
	               |	фин_ЗакрытиеБюджетныхПериодов.РучнаяКорректировка,
	               |	фин_ЗакрытиеБюджетныхПериодов.Сценарий,
	               |	фин_ЗакрытиеБюджетныхПериодов.УправленческоеПодразделение,
	               |	фин_ЗакрытиеБюджетныхПериодов.Дата КАК Период
	               |ИЗ
	               |	Документ.фин_ЗакрытиеБюджетныхПериодов КАК фин_ЗакрытиеБюджетныхПериодов";
	ТекстЗапроса = ТекстЗапроса + фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();
	НомераТаблиц.Вставить("ТаблицаЗакрытиеПериода",  НомераТаблиц.Количество());
	Возврат ТекстЗапроса;	
КонецФункции 


////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Подготовка табличных печатных документов.


////////////////////////////////////////////////////////////////////////////////
// Прочие служебные процедуры и функции


#КонецЕсли