
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.АвтоМасштаб = Истина;

	ПечатьРесстр(ПараметрКоманды,ТабДок);
	КоличествоЭкземпляров = 1;
	НаПринтер = Ложь;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ПараметрКоманды,"Реестр платежей "));	
КонецПроцедуры

&НаСервере
Процедура ПечатьРесстрСтарая(ПараметрКоманды,ТабДок)
	ТабДок.Очистить();
		
	Макет     = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ПолучитьМакет("Реестр");
	Шапка     = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строки");
	Подвал    = Макет.ПолучитьОбласть("Подвал");
	
	//Шапка.Параметры.ДатаРеестра = Формат(ПараметрКоманды.ДатаОкончания,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.НомерРеестра = ПараметрКоманды.Номер;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерСтроки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Контрагент,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора.НомерДоговора КАК НомерДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Культура,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Объем,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Цена,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Собственные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Заемные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Элеватор,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерЗерновой,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаЗерновой,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РасчетныйСчет,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СФ,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаВыписки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РегНомер
	 |ИЗ
	 |	БизнесПроцесс.СогласованиеПлатежейПоЗакупу.РасчетнаяТаблица КАК СогласованиеПлатежейПоЗакупуРасчетнаяТаблица
	 |ГДЕ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    НомерСтроки = 0;
	ОбщийОбъем  = 0;
	ОбщаяСумма  = 0;
    втчИтого    = 0;
	втчИтогоРБ    = 0;
	втчШапка    = "";
	
	//получим значение шапки
	Пока Выборка.Следующий() Цикл 
		
		//Если Выборка.Собственные > 0 тогда
			втчШапка = "за счет собственных средств Корпорации";
		//Иначе
			втчШапкаРБ = "за счет республиканского бюджета";
		//КонецЕсли;
		
	КонецЦикла;
	
	Шапка.Параметры.втчШапка = втчШапка;
	Шапка.Параметры.втчШапкаРБ = втчШапкаРБ;
	ТабДок.Вывести(Шапка);
	
	Выборка.Сбросить();
	
	//получим значения строки
	Пока Выборка.Следующий() Цикл 
		
		ОблСтрока.Параметры.Заполнить(Выборка);
		
		ОблСтрока.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy");
		ОблСтрока.Параметры.ДатаЗерновой = Формат(Выборка.ДатаЗерновой,"ДФ=dd.MM.yyyy");
		
		ОблСтрока.Параметры.Объем = Выборка.Объем;
		ОбщийОбъем = ОбщийОбъем + Выборка.Объем;
		ОблСтрока.Параметры.СуммаДоговора = Выборка.СуммаДоговора;
		ОбщаяСумма = ОбщаяСумма + Выборка.СуммаДоговора;
		
		//Если Выборка.Собственные > 0 тогда
			втчИтого = втчИтого + Выборка.Собственные;
			ОблСтрока.Параметры.втчСтрока = Выборка.Собственные;
		//Иначе
			втчИтогоРБ = втчИтогоРБ + Выборка.Заемные;
			ОблСтрока.Параметры.втчСтрокаРБ = Выборка.Заемные;
		//КонецЕсли;
		
		ТабДок.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	// выводим итоговые суммы 	
	Подвал.Параметры.ИтогоОб = ОбщийОбъем;
	Подвал.Параметры.ИтогоСумма  = ОбщаяСумма;
	
	// Получаем руководитель 
	//+++ Oleg SmartT. 2021-04-08	
	Для Каждого Стр из ПараметрКоманды.Подписи Цикл
		сФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
		//ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеДолжности(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность; //-=-=
        //-=-=
		ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;
		//-=-=
		Если Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСКурирующимЧП Тогда
			Подвал.Параметры.ФИОДиректораДК          = сФио;
			Подвал.Параметры.ДолжностьДиректораДК    = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания1        = Стр.Дата;
			//-=-=
			Подвал.Параметры.Подписано               = "Подписано";
			Подвал.Параметры.ФлПодп                  = "V";
			//-=-=
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСРП Тогда
			Подвал.Параметры.ФИОДиректораДЗСХП       = сФио;
			Подвал.Параметры.ДолжностьДиректораДЗСХП = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания2        = Стр.Дата;
			//-=-=
			Подвал.Параметры.Согласовано1             = "Согласовано";
			Подвал.Параметры.ФлСогл1                  = "V";
			//-=-=
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСФД Тогда
			Подвал.Параметры.ФИОДиректораФД          = сФио;
			Подвал.Параметры.ДолжностьДиректораФД    = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания3        = Стр.Дата;
			//-=-=
			Подвал.Параметры.Согласовано2             = "Согласовано";
			Подвал.Параметры.ФлСогл2                  = "V";
			//-=-=
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСГБ Тогда
			Подвал.Параметры.ФИОГБ                   = сФио;
			Подвал.Параметры.ДолжностьГБ             = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания4        = Стр.Дата;
			//-=-=
			Подвал.Параметры.Согласовано3             = "Согласовано";
			Подвал.Параметры.ФлСогл3                  = "V";
			//-=-=
		КонецЕсли;
		
	КонецЦикла;
	
	сФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
	ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;
	Подвал.Параметры.ФИОМенеджераДЗСХП       = сФио;
	Подвал.Параметры.ДолжностьМенеджераДЗСХП = ДолжностьДляПечФормы;
	//-=-=
	Подвал.Параметры.Согласовано4             = "Согласовано";
	Подвал.Параметры.ФлСогл4                  = "V";
	//-=-=
	Подвал.Параметры.ВремяПодписания5        = ПараметрКоманды.Дата;
	Подвал.Параметры.ДатаРеестра             = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	Подвал.Параметры.втчИтого                = втчИтого;
	Подвал.Параметры.втчИтогоРБ                = втчИтогоРБ;
	//--- Oleg SmartT. 2021-04-08	
		
	ТабДок.Вывести(Подвал);
КонецПроцедуры	

&НаСервере
Процедура ПечатьРесстр(ПараметрКоманды,ТабДок)
	ТабДок.Очистить();
		
	Макет     = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ПолучитьМакет("Реестр");
	Шапка     = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строки");
	
	ИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
	
	ПодписьДиректораДК    = Макет.ПолучитьОбласть("ПодписьДиректораДК");
	ПодписьДиректораДЗСХП = Макет.ПолучитьОбласть("ПодписьДиректораДЗСХП");
	ПодписьДиректораФД    = Макет.ПолучитьОбласть("ПодписьДиректораФД");
	ПодписьГБ             = Макет.ПолучитьОбласть("ПодписьГБ");
	ПодписьМенДЗСХП       = Макет.ПолучитьОбласть("ПодписьМенДЗСХП");
	
	Подвал    = Макет.ПолучитьОбласть("Подвал");
	
	ПодписьДиректораДК.Параметры.ДолжностьДиректораДК       = "Курирующий руководитель";
	ПодписьДиректораДЗСХП.Параметры.ДолжностьДиректораДЗСХП = "Директор инициирующего структурного подразделения";
	ПодписьДиректораФД.Параметры.ДолжностьДиректораФД       = "Директор финансового департамента";
	ПодписьГБ.Параметры.ДолжностьГБ                         = "Главный бухгалтер";
	
	//Шапка.Параметры.ДатаРеестра = Формат(ПараметрКоманды.ДатаОкончания,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.НомерРеестра = ПараметрКоманды.Номер;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерСтроки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Контрагент,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора.НомерДоговора КАК НомерДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Культура,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Объем,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Цена,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Собственные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Заемные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Элеватор,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерЗерновой,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаЗерновой,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РасчетныйСчет,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СФ,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаВыписки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РегНомер
	 |ИЗ
	 |	БизнесПроцесс.СогласованиеПлатежейПоЗакупу.РасчетнаяТаблица КАК СогласованиеПлатежейПоЗакупуРасчетнаяТаблица
	 |ГДЕ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    НомерСтроки = 0;
	ОбщийОбъем  = 0;
	ОбщаяСумма  = 0;
    втчИтого    = 0;
	втчИтогоРБ    = 0;
	втчШапка    = "";
	
	//получим значение шапки
	Пока Выборка.Следующий() Цикл 
		
		//Если Выборка.Собственные > 0 тогда
			втчШапка = "за счет собственных средств Корпорации";
		//Иначе
			втчШапкаРБ = "за счет республиканского бюджета";
		//КонецЕсли;
		
	КонецЦикла;
	
	Шапка.Параметры.втчШапка = втчШапка;
	Шапка.Параметры.втчШапкаРБ = втчШапкаРБ;
	ТабДок.Вывести(Шапка);
	
	Выборка.Сбросить();
	
	//получим значения строки
	Пока Выборка.Следующий() Цикл 
		
		ОблСтрока.Параметры.Заполнить(Выборка);
		
		ОблСтрока.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy");
		ОблСтрока.Параметры.ДатаЗерновой = Формат(Выборка.ДатаЗерновой,"ДФ=dd.MM.yyyy");
		
		ОблСтрока.Параметры.Объем = Выборка.Объем;
		ОбщийОбъем = ОбщийОбъем + Выборка.Объем;
		ОблСтрока.Параметры.СуммаДоговора = Выборка.СуммаДоговора;
		ОбщаяСумма = ОбщаяСумма + Выборка.СуммаДоговора;
		
		//Если Выборка.Собственные > 0 тогда
			втчИтого = втчИтого + Выборка.Собственные;
			ОблСтрока.Параметры.втчСтрока = Выборка.Собственные;
		//Иначе
			втчИтогоРБ = втчИтогоРБ + Выборка.Заемные;
			ОблСтрока.Параметры.втчСтрокаРБ = Выборка.Заемные;
		//КонецЕсли;
		
		ТабДок.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	// выводим итоговые суммы 	
	ИтогиТаблицы.Параметры.ИтогоОб     = ОбщийОбъем;
	ИтогиТаблицы.Параметры.ИтогоСумма  = ОбщаяСумма;
	ИтогиТаблицы.Параметры.втчИтого    = втчИтого;
	ИтогиТаблицы.Параметры.втчИтогоРБ  = втчИтогоРБ;
	
	ТабДок.Вывести(ИтогиТаблицы);
	
	Для Каждого Стр из ПараметрКоманды.Подписи Цикл
		
		СФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
		ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;	
			
		Если Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСКурирующимЧП Тогда
			ПодписьДиректораДК.Параметры.ФИОДиректораДК       = СФио;
			ПодписьДиректораДК.Параметры.ДолжностьДиректораДК = ДолжностьДляПечФормы;
			ПодписьДиректораДК.Параметры.ВремяПодписания1     = Стр.Дата;
			ПодписьДиректораДК.Параметры.Согласовано1         = "Утверждено";
			ПодписьДиректораДК.Параметры.ФлСогл1		      = "V";
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСРП Тогда
			ПодписьДиректораДЗСХП.Параметры.ФИОДиректораДЗСХП       = СФио;
			ПодписьДиректораДЗСХП.Параметры.ДолжностьДиректораДЗСХП = ДолжностьДляПечФормы;
			ПодписьДиректораДЗСХП.Параметры.ВремяПодписания2        = Стр.Дата;
			ПодписьДиректораДЗСХП.Параметры.Согласовано2            = "Подписано";
			ПодписьДиректораДЗСХП.Параметры.ФлСогл2		            = "V";
			
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСФД Тогда;
			ПодписьДиректораФД.Параметры.ФИОДиректораФД       = СФио;
			ПодписьДиректораФД.Параметры.ДолжностьДиректораФД = ДолжностьДляПечФормы;
			ПодписьДиректораФД.Параметры.ВремяПодписания3     = Стр.Дата;
			ПодписьДиректораФД.Параметры.Согласовано3         = "Согласовано";
			ПодписьДиректораФД.Параметры.ФлСогл3		      = "V";	
			
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.СогласованиеСГБ Тогда
			ПодписьГБ.Параметры.ФИОГБ            = СФио;
			ПодписьГБ.Параметры.ДолжностьГБ      = ДолжностьДляПечФормы;
			ПодписьГБ.Параметры.ВремяПодписания4 = Стр.Дата;
			ПодписьГБ.Параметры.Согласовано4     = "Согласовано";
			ПодписьГБ.Параметры.ФлСогл4		     = "V";
		КонецЕсли;
		
	КонецЦикла;
	
	СФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
	ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;
	ПодписьМенДЗСХП.Параметры.ФИОМенеджераДЗСХП       = СФио;
	ПодписьМенДЗСХП.Параметры.ДолжностьМенеджераДЗСХП = ДолжностьДляПечФормы;
	ПодписьМенДЗСХП.Параметры.ВремяПодписания5        = ПараметрКоманды.Дата;
	ПодписьМенДЗСХП.Параметры.Согласовано5            = "Согласовано";
	ПодписьМенДЗСХП.Параметры.ФлСогл5		          = "V";
	
	ТабДок.Вывести(ПодписьДиректораДК);
	ТабДок.Вывести(ПодписьДиректораДЗСХП);
	ТабДок.Вывести(ПодписьДиректораФД);
	ТабДок.Вывести(ПодписьГБ);
	ТабДок.Вывести(ПодписьМенДЗСХП);
	
	Подвал.Параметры.ДатаРеестра = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	//--- Oleg SmartT. 2021-04-08	
		
	ТабДок.Вывести(Подвал);
КонецПроцедуры	
