&НаКлиенте
Процедура ИсходныеКомплектующиеНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ИсходныеКомплектующие.ТекущиеДанные;
	Если ПолеОбъекта(СтрокаТабличнойЧасти.Номенклатура,"Услуга") Тогда
		Сообщить("Указана номенклатура "+ПолеОбъекта(СтрокаТабличнойЧасти.Номенклатура,"Наименование")+", являющаяся услугой, это недопустимо");
		СтрокаТабличнойЧасти.Номенклатура = "";
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолеОбъекта(ОбъектДанных,ИмяПоля)
	Возврат ОбъектДанных[ИмяПоля];	
КонецФункции

// Процедура вызывается при нажатии кнопки "Подбор" командной панели
// табличного поля "Товары", вызывает сервисный механизм для
// подбора номеклатуры в табличную часть "Товары".
//
&НаКлиенте
Процедура КоманднаяПанельТоварыДействиеПодбор(Кнопка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Ложь);
	ФормаВыбора = ОткрытьФорму("Справочник.Номенклатура.Форма.УправляемаяФормаПодбора",ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

//Обработчик события ОбработкаВыбора формы
//
&НаКлиенте
Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.Номенклатура") Тогда
			СтрокаТабличнойЧасти = Объект.ИсходныеКомплектующие.НайтиСтроки(Новый Структура("Номенклатура",ЗначениеВыбора));
			// = Новый СписокЗначений;
			//СтрокаТабличнойЧасти.ЗагрузитьЗначения(НайденныеСтроки);
			
			Если СтрокаТабличнойЧасти.Количество() > 0 Тогда
        		Сообщить("Номенклатура - " + ЗначениеВыбора+ " уже подобрана!");
			Иначе
        		НоваяСтрока = Объект.ИсходныеКомплектующие.Добавить();
				НоваяСтрока.Номенклатура = ЗначениеВыбора;
				Если ЗапрашиватьКоличествоПриПодборе Тогда
					ВвестиЧисло(НоваяСтрока.Количество, "Укажите количество номенклатуры", 15, 3);
				КонецЕсли;
        	КонецЕсли;

		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыПечать(Кнопка)
	ТабДок = ОсновныеДействияФормыПечатьНаСервере();
	ТабДок.Показать("Спецификация """ + СокрЛП(Объект.Наименование) + """ ");
КонецПроцедуры

&НаСервере
Функция ОсновныеДействияФормыПечатьНаСервере()
	Макет = Справочники.СпецификацииНоменклатуры.ПолучитьМакет("Спецификация");
	ТабДок = Новый ТабличныйДокумент;
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ТекстЗаголовка = "Спецификация """ + СокрЛП(Объект.Наименование) +""" ";
	Шапка.Параметры.ВыходноеИзделие = Объект.Владелец.Наименование;
	Шапка.Параметры.Количество = Объект.Количество;
	Шапка.Параметры.ЕдиницаИзмерения = Объект.Владелец.БазоваяЕдиницаИзмерения;
	ТабДок.Вывести(Шапка);
	ШапкаКомплектующих = Макет.ПолучитьОбласть("ШапкаКомплектующих");
	ТабДок.Вывести(ШапкаКомплектующих);
	Для Каждого СтрокаТЧ Из Объект.ИсходныеКомплектующие Цикл
		СтрокаКомплектующих = Макет.ПолучитьОбласть("Строка");
		СтрокаКомплектующих.Параметры.НомерСтроки = СтрокаТЧ.НомерСтроки;
		СтрокаКомплектующих.Параметры.Номенклатура = СтрокаТЧ.Номенклатура;
		СтрокаКомплектующих.Параметры.Количество = СтрокаТЧ.Количество;
		СтрокаКомплектующих.Параметры.ЕдиницаИзмерения = СтрокаТЧ.Номенклатура.БазоваяЕдиницаИзмерения;
		ТабДок.Вывести(СтрокаКомплектующих);
	КонецЦикла;
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(Подвал);
	Подписи = Макет.ПолучитьОбласть("Подписи");
	Подписи.Параметры.ОтветственныйПредставление = ПараметрыСеанса.ТекущийПользователь.ФизЛицо.Наименование;
	ТабДок.Вывести(Подписи);
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	Возврат ТабДок;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ
