
&НаКлиенте
Процедура ОткрытьСправочник(Элемент)
	ИмяФормыОбъекта = "Справочник."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Элемент)
	ИмяФормыОбъекта = "Документ."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрСведений(Элемент)
	ИмяФормыОбъекта = "РегистрСведений."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработку(Элемент)
	ИмяФормыОбъекта = "Обработка."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".Форма";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция ОтсечьЦифры(ИсходнаяСтрока)

	ФинальнаяСтрока = ИсходнаяСтрока;
	
	КодСимвола = КодСимвола(Прав(ИсходнаяСтрока, 1));
	
	Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		ФинальнаяСтрока = Лев(ИсходнаяСтрока, СтрДлина(ИсходнаяСтрока) - 1);
	КонецЕсли; 
	
	КодСимвола = КодСимвола(Прав(ФинальнаяСтрока, 1));
	
	Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		ФинальнаяСтрока = Лев(ФинальнаяСтрока, СтрДлина(ФинальнаяСтрока) - 1);
	КонецЕсли; 
	
	Возврат ФинальнаяСтрока;
		
КонецФункции // ОтсечьЦифры()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьГруппы("ГруппаЗависимостиФинансовыхПоказателей",ПолучитьФункциональнуюОпцию("фин_ИспользоватьЗависимостиФинансовыхПоказателей"));
	УстановитьВидимостьГруппы("ГруппаМоделиРаспределения",ПолучитьФункциональнуюОпцию("фин_ИспользоватьМоделиРаспределения"));
	УстановитьВидимостьГруппы("ГруппаПроизводственныеМодели",ПолучитьФункциональнуюОпцию("фин_ИспользоватьПроизводственныеМодели"));
	УстановитьВидимостьГруппы("ГруппаРасчетныеМодели",ПолучитьФункциональнуюОпцию("фин_ИспользоватьРасчетныеМодели"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_НастройкаДополнительныхРазрезовБюджетирования.Измерение
		|ИЗ
		|	РегистрСведений.фин_НастройкаДополнительныхРазрезовБюджетирования КАК фин_НастройкаДополнительныхРазрезовБюджетирования";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Элементы.ГруппаРасчетСвязанныхРазрезов.Видимость=НЕ РезультатЗапроса.Пустой();
	Элементы.Декорация_ГруппаРасчетСвязанныхРазрезов.Видимость=НЕ РезультатЗапроса.Пустой();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппы(ИмяГруппы,Признак)
	Элементы[ИмяГруппы].Видимость = Признак;	
	Элементы["Декорация_"+ИмяГруппы].Видимость = Признак;	
	Элементы["Подсказка_"+ИмяГруппы].Видимость = Признак;	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКорректностиНастроекБюджетнойСтруктуры(Команда)
	Попытка	
		ОткрытьФорму("Обработка.фин_КонтрольКорректностиНастроекБюджетнойСтруктуры.Форма");
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура Декорация_Группа(Элемент)
	ИмяСтраницы = СтрЗаменить(Элемент.Имя,"Декорация_","");
	Элементы.Страницы.ТекущаяСтраница=Элементы.Страницы.ПодчиненныеЭлементы[ИмяСтраницы];
КонецПроцедуры


&НаСервере
Функция ИмяВидаОбъектовМетаданных(ИмяЭлемента)
	Возврат СтрЗаменить(Элементы.Найти(ИмяЭлемента).ПолучитьДействие("Нажатие"),"Открыть","");	
КонецФункции

&НаКлиенте
Процедура ОткрытьВОтдельномОкне(Команда)
	ИмяЭлемента = ТекущийЭлемент.Имя;
	ИмяВидаОбъектов = ИмяВидаОбъектовМетаданных(ИмяЭлемента);
	ИмяФормыОбъекта = ИмяВидаОбъектов+"."+ОтсечьЦифры(СтрЗаменить(ТекущийЭлемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
