
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Валюта = Параметры.Валюта;
	КурсВалюты = Параметры.КурсВалюты;
	КратностьВалюты = Параметры.КратностьВалюты;
	ДатаУстановкиКурсаИКратности = Параметры.ДатаУстановкиКурсаИКратности;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)

	// Заполним структуру возвращаемых параметров
	СтруктураВозвращаемыхЗначений = Новый Структура();
	СтруктураВозвращаемыхЗначений.Вставить("КратностьВалюты", КратностьВалюты);
	СтруктураВозвращаемыхЗначений.Вставить("КурсВалюты",      КурсВалюты);

	// Все сделали, можно закрывать форму
	ОповеститьОВыборе(СтруктураВозвращаемыхЗначений);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаДату(Команда)

	// Выберем дату курса
	Если ВвестиДату(ДатаУстановкиКурсаИКратности, "Выберите дату установки курса и кратности.", ЧастиДаты.Дата) Тогда

		// Если дата введена, заполним значение курса и кратности
		СтруктураВалюты = куфиб_ОбщегоНазначения.ПолучитьКурсВалюты(Валюта, ДатаУстановкиКурсаИКратности);
		КурсВалюты      = СтруктураВалюты.Курс;
		КратностьВалюты = СтруктураВалюты.Кратность;

	КонецЕсли;

КонецПроцедуры
