
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителяПоСогласованиюПлатежей.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителяПоСогласованиюПлатежей КАК ЗадачаИсполнителяПоСогласованиюПлатежей
		|ГДЕ
		|	ЗадачаИсполнителяПоСогласованиюПлатежей.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачаИсполнителяПоСогласованиюПлатежей.Выполнена = ЛОЖЬ
		|	И ЗадачаИсполнителяПоСогласованиюПлатежей.ТочкаМаршрута <> &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", ПараметрКоманды);
	Запрос.УстановитьПараметр("ТочкаМаршрута", БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.ПередачаВКазначейство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если ПараметрКоманды.Автор <> ПараметрыСеанса.ТекущийПользователь Тогда
		Сообщить("Чужую заявку нельзя отозвать!");
		Возврат;
	КонецЕсли;

	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("Данную заявку нельзя отозвать");
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
		ТекЗадача = Выборка.Ссылка.ПолучитьОбъект();	
		ТекЗадача.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		ТекЗадача.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.ТочкаМаршрута.РаботаСЗаявкойАвтором");
		ТекЗадача.Наименование = "Отозванная заявка для исправления";
		ТекЗадача.Записать();
		Сообщить("Заявка отозвана");
	КонецЦикла;
	   	
КонецПроцедуры
