
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтбор(Этаформа);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтбор(Форма) 
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("усд_УправлениеСогласованиемИУтверждениемДокументов") Тогда
		Отбор = Ложь;
	Иначе
		Отбор = Истина;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Форма.Список, "Автор", ПараметрыСеанса.ТекущийПользователь, Отбор );	
	
КонецПроцедуры
