
&НаСервере
Процедура СформироватьНаСервере()
	
	СтрокВШапке = Результат.ФиксацияСверху;
	КоличествоКолонок = Результат.ШиринаТаблицы;
	
	ОбластьШапки = Результат.Область(СтрокВШапке,,СтрокВШапке);
	ОбластьПриемник = Результат.Область(СтрокВШапке+1,,СтрокВШапке+1);
	Результат.ВставитьОбласть(ОбластьШапки, ОбластьПриемник, ТипСмещенияТабличногоДокумента.ПоГоризонтали, Ложь);
	
	Для Ном =1 По КоличествоКолонок Цикл
		ТекОбласть = Результат.Область(СтрокВШапке+1, Ном);
		
		Если КоличествоКолонок = 44 Тогда
			Если Ном = 42 Тогда
				ТекОбласть.Текст = "42=14/8";
			ИначеЕсли Ном = 43 Тогда
				ТекОбласть.Текст = "43=14/6";
	        ИначеЕсли Ном = 44 Тогда
				ТекОбласть.Текст = "44=14/5";
			ИначеЕсли Ном = 12 Тогда
				ТекОбласть.Текст = "12=8/7";
	        ИначеЕсли Ном = 13 Тогда
				ТекОбласть.Текст = "13=8/6";	
			Иначе
				ТекОбласть.Текст = "" + Ном;
			КонецЕсли;
		ИначеЕсли КоличествоКолонок = 20 Тогда
			
			Если Ном = 20 Тогда
				ТекОбласть.Текст = "20=11/5";
			ИначеЕсли Ном = 19 Тогда
				ТекОбласть.Текст = "19=11/6";
	        ИначеЕсли Ном = 18 Тогда
				ТекОбласть.Текст = "18=11/8";
			ИначеЕсли Ном = 9 Тогда
				ТекОбласть.Текст = "9=8/7";
	        ИначеЕсли Ном = 10 Тогда
				ТекОбласть.Текст = "10=8/6";	
			Иначе
				ТекОбласть.Текст = "" + Ном;
			КонецЕсли;
			
		ИначеЕсли КоличествоКолонок = 17 Тогда
			
			Если Ном = 17 Тогда
				ТекОбласть.Текст = "17=8/5";
			ИначеЕсли Ном = 16 Тогда
				ТекОбласть.Текст = "16=8/6";
	        ИначеЕсли Ном = 15 Тогда
				ТекОбласть.Текст = "15=8/7";
			Иначе
				ТекОбласть.Текст = "" + Ном;
			КонецЕсли;	
		Иначе
			ТекОбласть.Текст = "" + Ном;
		КонецЕсли;	
		
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		
		ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ТекОбласть.ЦветФона = Новый Цвет(203, 228, 229);
		ТекОбласть.ГраницаСправа = Линия;
		ТекОбласть.ЦветРамки = ЦветаСтиля.ЦветРамки;

		ТекОбласть.Шрифт = Новый Шрифт("Arial", 10,Истина);
		ТекОбласть.ЦветТекста = Новый Цвет(0, 0, 92);
	КонецЦикла;
	
	Результат.ФиксацияСверху = Результат.ФиксацияСверху + 1;
	Результат.ФиксацияСлева = 4;
	    
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Непосредственно);
	СформироватьНаСервере();
	
	ДоработатьЗаголовок();
	
КонецПроцедуры

&НаСервере
Процедура ДоработатьЗаголовок()

	КоличествоКолонок = Результат.ШиринаТаблицы;
		
	ТекОбласть = Результат.Область(1, КоличествоКолонок);
	ТекОбласть.Текст = "4 БК";
	
	ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
    ТекОбласть.Шрифт = Новый Шрифт("Arial", 12, Истина);

	ТекОбласть2 = Результат.Область(5, КоличествоКолонок);
	ТекОбласть2.Текст = "тыс.тенге";
	
	ТекОбласть2.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
    ТекОбласть2.Шрифт = Новый Шрифт("Arial", 12, Истина);

КонецПроцедуры
