
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаДополнительныхРазрезовБюджетирования.Измерение,
		|	НастройкаДополнительныхРазрезовБюджетирования.Разрез
		|ИЗ
		|	РегистрСведений.фин_НастройкаДополнительныхРазрезовБюджетирования КАК НастройкаДополнительныхРазрезовБюджетирования";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	ОбработанныеРазрезы=Новый Массив;
	Пока Выборка.Следующий() Цикл
		ИмяРазреза = фин_ПроцедурыМеханизмовБюджетирования.ИмяРазреза(Выборка.Измерение);
		НомерРазреза = Сред(ИмяРазреза,СтрДлина("Разрез")+1);
		ЭтотОбъект["ТипРазреза"+НомерРазреза]=Выборка.Разрез;
		Элементы["Разрез"+НомерРазреза].Заголовок = ?(СокрЛП(Выборка.Разрез.ПредставлениеДополнительногоРеквизита)="",Строка(Выборка.Разрез),Выборка.Разрез.ПредставлениеДополнительногоРеквизита);
		Элементы["Разрез"+НомерРазреза].ОграничениеТипа = Выборка.Разрез.ТипЗначения;
		ОбработанныеРазрезы.Добавить("Группа"+ИмяРазреза);
	КонецЦикла;
	Для Инд=1 По 10 Цикл
		имяЭлемента = "ГруппаРазрез"+Строка(Инд);
		Если ОбработанныеРазрезы.Найти(имяЭлемента)=Неопределено Тогда
			Элементы[имяЭлемента].Видимость=Ложь;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
