////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит список структурных единиц, по которым строится отчет
Перем мСписокСтруктурныхЕдиниц Экспорт; // (отчет)

Процедура СформироватьОтчет(РезультатОтчета) Экспорт
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период").Значение = Дата;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Организация").Значение = мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения();
	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Объявление").Значение = Объявление;
	РезультатОтчета.Очистить();
	СкомпоноватьРезультат(РезультатОтчета);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
