////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

Функция СформироватьЗапрос()
	
	мВидыСубконто = Новый Массив;
	//мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты);
	мВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Договоры);
	
	мСписокСчетов = Новый Массив;
	мСписокСчетов.Добавить(ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоставщикамИПодрядчикам);
	мСписокСчетов.Добавить(ПланыСчетов.Типовой.КраткосрочнаяЗадолженностьПоАренде);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачалоГода(Год)));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонецГода(Год)));
	Запрос.УстановитьПараметр("мВидыСубконто", мВидыСубконто);
	Запрос.УстановитьПараметр("мСписокСчетов", мСписокСчетов);
	Запрос.УстановитьПараметр("выбГод", Год);
	
	ТекстУсловия = "";
	ТекстДопУсловия = "";
	Союз = " И ";
	
	Если ОтборОрганизации Тогда
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если ВидСравненияОрганизации = ВидСравнения.Равно Тогда
			ВидСравненияОрганизацииСтрокой = " = &Организация" 
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			ВидСравненияОрганизацииСтрокой = " <> &Организация"
		ИначеЕсли ВидСравненияОрганизации = ВидСравнения.ВСписке Тогда
			ВидСравненияОрганизацииСтрокой = " В (&Организация)"
		Иначе
			ВидСравненияОрганизацииСтрокой = " НЕ В (&Организация)"
		КонецЕсли; 
		
		ТекстУсловия = ТекстУсловия + Союз + "Организация " + ВидСравненияОрганизацииСтрокой;
		ТекстДопУсловия = "Организация " + ВидСравненияОрганизацииСтрокой;
		Союз         = " И ";
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕстьNull(гз_СтатусыДоговоровПоГосударственнымЗакупкамСрезПоследних.Статус,ЗНАЧЕНИЕ(Перечисление.гз_СтатусыДоговоров.Статус_0)) КАК СтатусДоговора,
	|	гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.Регистратор КАК Регистратор,
	|	гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.Сумма КАК СуммаПоДоговору,
	|	ЕстьNull(ДанныеПОБУ.СуммаОплаты,0) КАК ОплаченнаяСумма,
	|	ЕстьNull(ДанныеПОБУ.СуммаПоставки,0) КАК СуммаПоставки
	|
	|ИЗ
	|	РегистрСведений.гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам КАК гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гз_СтатусыДоговоровПоГосударственнымЗакупкам.СрезПоследних(&КонПериода, ) КАК гз_СтатусыДоговоровПоГосударственнымЗакупкамСрезПоследних
	|		ПО  гз_СтатусыДоговоровПоГосударственнымЗакупкамСрезПоследних.ДоговорКонтрагента = гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.ДоговорКонтрагента
	|   ЛЕВОЕ СОЕДИНЕНИЕ
	|         (ВЫБРАТЬ
	|				ТиповойОбороты.Субконто1 КАК ДоговорКонтрагента,
	|				ТиповойОбороты.СуммаОборотДт КАК СуммаОплаты,
	|				ТиповойОбороты.СуммаОборотКт КАК СуммаПоставки
	|			ИЗ
	|				РегистрБухгалтерии.Типовой.Обороты(&Начпериода, &КонПериода, , Счет В ИЕРАРХИИ (&мСписокСчетов), &мВидыСубконто, "+ТекстДопУсловия+", , ) КАК ТиповойОбороты
	|          ) КАК ДанныеПОБУ
	|   	ПО ДанныеПОБУ.ДоговорКонтрагента = гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.ДоговорКонтрагента
	|ГДЕ
	|	гз_ДоговорыКонтрагентовПоГосударственнымЗакупкам.Год = &выбГод"+ТекстУсловия+"
	|ИТОГИ Сумма(СуммаПоДоговору),
	|      Сумма(ОплаченнаяСумма),
	|      Сумма(СуммаПоставки)
	|	ПО Общие";
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапрос()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

Процедура СформироватьОтчет(ДокументРезультат) Экспорт	
	
	ДокументРезультат.Очистить();
	
	Макет 		 = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	СтрокаОтбора = "Отбор:";
	
	// Информация об отборе.
	Если ОтборОрганизации Тогда
		
		СписокОтборПоОрганизации = "";
		
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			Если Организация = Справочники.Организации.ПустаяСсылка() Тогда
			Иначе
				СписокОтборПоОрганизации = Организация
			КонецЕсли;
		Иначе
			Если Организация.Количество() = 0 Тогда
			Иначе	
				СписокОтборПоОрганизации =  Организация
			КонецЕсли; 
		КонецЕсли;
		//СтрокаОтбора = СтрокаОтбора + Символы.ПС + СписокОтбор;
		
	КонецЕсли;
	
	
	ОбластьЗаголовок.Параметры.СписокОтборПоОрганизации = СписокОтборПоОрганизации;
	//ОбластьШапка.Параметры.Отбор = СтрокаОтбора;
	
	ТекстПериода = Отчеты_БК.СформироватьСтрокуВыводаПараметровПоДатам(НачалоГода(Год), КонецГода(Год));
	ОбластьЗаголовок.Параметры.ПредставлениеЗаголовка = "Исполнение договоров за "+ТекстПериода;
	
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ДокументРезультат.Вывести(ОбластьШапка);
	
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИТОГО = Макет.ПолучитьОбласть("ИТОГО");
	
	РЕзультат = СформироватьЗапрос();
	
	выборкаОбщие = РЕзультат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Общие");
    выборкаОбщие.Следующий();
	
	ВыборкаПоДеталям = выборкаОбщие.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НомПП=0;
	
	Пока  ВыборкаПоДеталям.Следующий() Цикл
		
		ДокументРегистрации = ВыборкаПоДеталям.Регистратор;
		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаПоДеталям);
		
		ОбластьСтрока.Параметры.БИНЗаказчика = ДокументРегистрации.Организация.ИдентификационныйНомер;
		ОбластьСтрока.Параметры.РННЗаказчика = ДокументРегистрации.Организация.РНН;
		ОбластьСтрока.Параметры.НаименованиеКЗ = ДокументРегистрации.Организация.НаименованиеПолноеКЗ;
		ОбластьСтрока.Параметры.Наименование = ДокументРегистрации.Организация.НаименованиеПолное;
		ОбластьСтрока.Параметры.КОдЗаказчикаКАТО = ДокументРегистрации.Организация.КодПоКАТО;
		ОбластьСтрока.Параметры.НомерДоговора = ДокументРегистрации.НомерДоговора;
		ОбластьСтрока.Параметры.ДатаДоговора = ДокументРегистрации.ДатаДоговора;
		ОбластьСтрока.Параметры.ДатаОкончания = ДокументРегистрации.ДатаОкончанияДействияДоговора;
		ОбластьСтрока.Параметры.ПоставщикКЗ = ДокументРегистрации.Контрагент.НаименованиеПолноеКЗ;
		ОбластьСтрока.Параметры.Поставщик = ДокументРегистрации.Контрагент.НаименованиеПолное;
		ОбластьСтрока.Параметры.БИНПоставщика = ДокументРегистрации.Контрагент.ИдентификационныйКодЛичности;
		ОбластьСтрока.Параметры.РННПоставщика = ДокументРегистрации.Контрагент.РНН;
		ОбластьСтрока.Параметры.КодСтраныПоставщика = ?(ЗНАЧЕНИЕЗАПОЛНЕНО(ДокументРегистрации.Контрагент.СтранаРезидентства),ДокументРегистрации.Контрагент.СтранаРезидентства.Код,"398");
		ОбластьСтрока.Параметры.КодРегионаПоставщикаПоКАТО = ДокументРегистрации.Контрагент.КодПоКАТО;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;           	
	
		//ОбластьИТОГО.Параметры.Заполнить(выборкаОбщие);
		//ОбластьИТОГО.Параметры.ПредставлениеИтого = "Всего по области";
		//ДокументРезультат.Вывести(ОбластьИТОГО);
	
КонецПроцедуры // СформироватьОтчет()

#КонецЕсли
