
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Бюджет,СформироватьПриОткрытии,НеВосстанавливатьНастройки",ПараметрКоманды,Истина,Истина);
	ОткрытьФорму("Отчет.фин_СтруктураБюджета.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,ПараметрыВыполненияКоманды.Окно), ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
