
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПЕЧАТИ

Функция ПолучитьДанныеПоПодборуКадров(Запрос, СтруктураДанных) Экспорт
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияРезюмеКандидатовКандидаты.ДатаПоступленияРезюме КАК ДатаПринятияРешения,
	|	""Зарегистрирован"" КАК Решение,
	|	NULL КАК Оценка,
	|	РегистрацияРезюмеКандидатовКандидаты.Ссылка.Представление
	|ИЗ
	|	Документ.РегистрацияКандидатов.Кандидаты КАК РегистрацияРезюмеКандидатовКандидаты
	|
	|ГДЕ
	|	РегистрацияРезюмеКандидатовКандидаты.Ссылка.Проведен = &Проведен И
	|	РегистрацияРезюмеКандидатовКандидаты.ФизЛицо = &ФизЛицо
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОценкаКандидатаКандидаты.ДатаПринятияРешения,
	|	ОценкаКандидатаКандидаты.Решение,
	|	ОценкаКандидатаКандидаты.Оценка,
	|	ОценкаКандидатаКандидаты.Ссылка.Представление
	|ИЗ
	|	Документ.ОценкаКандидата.Кандидаты КАК ОценкаКандидатаКандидаты
	|
	|ГДЕ
	|	ОценкаКандидатаКандидаты.ФизЛицо = &ФизЛицо И
	|	ОценкаКандидатаКандидаты.Ссылка.Проведен = &Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОценкаИспытательногоСрокаРаботники.ДатаПринятияРешения,
	|	ОценкаИспытательногоСрокаРаботники.Решение,
	|	NULL,
	|	ОценкаИспытательногоСрокаРаботники.Ссылка.Представление
	|ИЗ
	|	Документ.ОценкаИспытательногоСрока.Работники КАК ОценкаИспытательногоСрокаРаботники
	|
	|ГДЕ
	|	ОценкаИспытательногоСрокаРаботники.ФизЛицо = &ФизЛицо И
	|	ОценкаИспытательногоСрокаРаботники.Ссылка.Проведен = &Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПринятияРешения";

	СтруктураДанных.Вставить("ПодборКадров", Запрос.Выполнить().Выбрать());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезультатыАнкетирования.Ссылка.ТиповаяАнкета.Представление КАК Анкета,
	|	РезультатыАнкетирования.Вопрос.ПолнаяФормулировка КАК Вопрос,
	|	РезультатыАнкетирования.ТиповойОтвет КАК Ответ,
	|	РезультатыАнкетирования.Ссылка.Представление КАК РегистраторПредставление,
	|	ВариантыОтветовОпросов.ОценкаОтвета
	|ИЗ
	|	Документ.Опрос.Вопросы КАК РезультатыАнкетирования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовОпросов КАК ВариантыОтветовОпросов
	|		ПО РезультатыАнкетирования.ТиповойОтвет = ВариантыОтветовОпросов.Ссылка
	|
	|ГДЕ
	|	РезультатыАнкетирования.Ссылка.ОпрашиваемоеЛицо = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезультатыАнкетирования.Ссылка.Дата";
	
	СтруктураДанных.Вставить("Опросы", Запрос.Выполнить().Выбрать());

КонецФункции

Процедура ДополнитьСтруктуруДанных(Запрос, СтруктураДанных, ФизЛицоСсылка) Экспорт
	
	// В данной конфгурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ВывестиДополнительныеДанные(ТабДокумент, Макет, СекцияДанных) Экспорт
	
	// В данной конфгурации дополнительных действий не предусмотрено
	
КонецПроцедуры

