Перем ЗаполнениеПараметров Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем ДанныеРасшифровки Экспорт;

// Получить параметры исполнения отчета
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура("ИспользоватьПередКомпоновкойМакета,
							|ИспользоватьПослеКомпоновкиМакета,
							|ИспользоватьПослеВыводаРезультата,
							|ИспользоватьДанныеРасшифровки",
							Ложь, Ложь, Истина, Ложь);
							
КонецФункции

// После вывода результата
//
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	Макет 			= ПолучитьМакет("Макет");
	Область 		= Макет.ПолучитьОбласть("Заголовок");
//	ВысотаОбласти 	= Макет.ВысотаТаблицы;

	ЗаполнитьПараметрыОбласти(Область,ПараметрыОтчета.Документ);

	Результат.ВставитьОбласть(Область,Результат.Область("R1"),ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры

Процедура Скомпоновать(ДокументРезультат) Экспорт
	СкомпоноватьРезультат(ДокументРезультат,ДанныеРасшифровки);	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Документ = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Документ").Значение;
	Макет = ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	
	ЗаполнитьПараметрыОбласти(Область,Документ);
	
	ДокументРезультат.Вывести(Область);

КонецПроцедуры

Процедура ЗаполнитьПараметрыОбласти(Область,Документ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Период,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Документ,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ОтветственноеЛицо,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Этап,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Маршрут,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ВидДокументов,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ВозвращенНаЭтап,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Статус,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.Приоритет,
		|	усд_ДвижениеДокументовПоМаршрутамСрезПоследних.ПричинаВозврата
		|ИЗ
		|	РегистрСведений.усд_ДвижениеДокументовПоМаршрутам.СрезПоследних(, Документ = &Документ) КАК усд_ДвижениеДокументовПоМаршрутамСрезПоследних";

	Запрос.УстановитьПараметр("Документ", Документ);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Область.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
	КонецЕсли;
КонецПроцедуры

ЗаполнениеПараметров = Новый Структура;

