////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	фин_ПроцедурыРаботыСОбъектамиКлиентПереопределяемый.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фин_БюджетированиеОбщегоНазначения.НастроитьОформлениеТабличногоПоля(Элементы.Список);
КонецПроцедуры


&НаКлиенте
Процедура ОтображатьОписаниеУсловий(Команда)
	Элементы.ФормаОтображатьОписаниеУсловий.Пометка = НЕ Элементы.ФормаОтображатьОписаниеУсловий.Пометка;
	Элементы.ОписаниеУсловия.Видимость = Элементы.ФормаОтображатьОписаниеУсловий.Пометка;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
