#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ЗаполнениеПараметров Экспорт; 	// заполнение параметров
Перем ИзменятьСтруктуруОтчета Экспорт; 	// заполнение параметров

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ЗаполнениеПараметров = Новый Структура;

ЗаполнениеПараметров.Вставить("НачалоПериода",	НачалоМесяца(ТекущаяДата()));
ЗаполнениеПараметров.Вставить("КонецПериода", 	КонецМесяца(ТекущаяДата()));
ЗаполнениеПараметров.Вставить("ДетализацияПоПериодам", 	Перечисления.фин_Периодичность.Месяц);


ИзменятьСтруктуруОтчета = Истина;

#КонецЕсли

