
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодготовитьФормуНаСервере();
КонецПроцедуры

// Управление формой

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	Элементы.ПериодСмещения.ОграничениеТипа	= Новый ОписаниеТипов("ПеречислениеСсылка.Фин_Периодичность");
	Элементы.ПериодЦикла.ОграничениеТипа 	= Новый ОписаниеТипов("ПеречислениеСсылка.Фин_Периодичность");
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	// установка видимости и доступности элементов в зависимости от значений реквизитов

	Элементы.ПериодЦикла.Видимость = (Объект.ВидПрофиля = ПредопределенноеЗначение("Перечисление.фин_ВидыПрофилейИзмененияПоПериодам.Периодический"));
	
КонецПроцедуры

&НаКлиенте
Процедура Автозаполнение(Команда)
	ОткрытьФорму("Справочник.фин_ПрофилиИзмененияПлановПоПериодам.Форма.ФормаАвтозаполнения",,Элементы.ПрофильИзменения,УникальныйИдентификатор,?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,Окно));
КонецПроцедуры

&НаКлиенте
Процедура ПрофильИзмененияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение<>Неопределено Тогда
		ПрофильИзмененияОбработкаВыбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрофильИзмененияОбработкаВыбораНаСервере(ВыбранноеЗначение)
	ТабИзменения 	= Новый ТаблицаЗначений;
	ТабИзменения.Колонки.Добавить("НомерПериода");
	ТабИзменения.Колонки.Добавить("Коэффициент");
	БазовоеЗначение = ВыбранноеЗначение.БазовыйКоэффициент;
	Объект.ПрофильИзменения.Очистить();
	Для Индекс=1 По ВыбранноеЗначение.КоличествоПериодовРаспределения Цикл
        СтрокаРаспределения 				= Объект.ПрофильИзменения.Добавить();
		СтрокаРаспределения.НомерПериода 	= ВыбранноеЗначение.СмещениеПервогоПериодаРаспределения+Индекс-1;
		Если ВыбранноеЗначение.ТипРаспределения	= Перечисления.фин_ВидыРаспределенияЗначенийБюджетирования.ПоПериодамСИзменением Тогда
			Если ВыбранноеЗначение.ТипИзменения	= Перечисления.фин_ВидыИзмененийПоПериодамБюджетирования.ЦепноеОтносительноеИзменение Тогда
				БазовоеЗначение 					= БазовоеЗначение+БазовоеЗначение*ВыбранноеЗначение.ПриращениеЗаПериод;
                СтрокаРаспределения.Коэффициент		= БазовоеЗначение;
			 Иначе
				 СтрокаРаспределения.Коэффициент	= БазовоеЗначение+ВыбранноеЗначение.ПриращениеЗаПериод*Индекс;
			КонецЕсли;
		 Иначе
			СтрокаРаспределения.Коэффициент			= 1/ВыбранноеЗначение.КоличествоПериодовРаспределения;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
