
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.АвтоМасштаб = Истина;

	ПечатьРесстр(ПараметрКоманды,ТабДок);
	КоличествоЭкземпляров = 1;
	НаПринтер = Ложь;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ПараметрКоманды,"Реестр платежей "));	
КонецПроцедуры

&НаСервере
Процедура ПечатьРесстр(ПараметрКоманды,ТабДок)
	ТабДок.Очистить();
		
	Макет     = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупу.ПолучитьМакет("Реестр");
	Шапка     = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строки");
	Подвал    = Макет.ПолучитьОбласть("Подвал");
	
	//Шапка.Параметры.ДатаРеестра = Формат(ПараметрКоманды.ДатаОкончания,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.НомерРеестра = ПараметрКоманды.Номер;
	ТабДок.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерСтроки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Контрагент,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора.НомерДоговора КАК НомерДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора.ДатаДоговора КАК ДатаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Культура,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Объем,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Цена,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Собственные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Заемные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Элеватор,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РасчетныйСчет,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Гарантия,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Гарантия.ДатаВыдачи,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Гарантия.НомерГарантии КАК НомерГарантии
	 |ИЗ
	 |	БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупу.РасчетнаяТаблица КАК СогласованиеПлатежейПоЗакупуРасчетнаяТаблица
	 |ГДЕ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    НомерСтроки = 0;
	ОбщийОбъем  = 0;
	ОбщаяСумма = 0;
	ОбщаяСобственные  = 0;
	ОбщаяЗаемные = 0;
	
	Пока Выборка.Следующий() Цикл 
		
		ОблСтрока.Параметры.Заполнить(Выборка);
		
		ОблСтрока.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДФ=dd.MM.yyyy");
		//ОблСтрока.Параметры.ДатаЗерновой = Формат(Выборка.ДатаЗерновой,"ДФ=dd.MM.yyyy");
		
		ОблСтрока.Параметры.Объем = Выборка.Объем;
			ОбщийОбъем = ОбщийОбъем + Выборка.Объем;
		ОблСтрока.Параметры.СуммаДоговора = Выборка.СуммаДоговора;
			ОбщаяСумма = ОбщаяСумма + Выборка.СуммаДоговора;
		ОблСтрока.Параметры.Собственные = Выборка.Собственные;
			ОбщаяСобственные = ОбщаяСобственные + Выборка.Собственные;
		ОблСтрока.Параметры.Заемные = Выборка.Заемные;
			ОбщаяЗаемные = ОбщаяЗаемные + Выборка.Заемные;	
			
			//+++ Oleg SmartT. 2021-06-23
			ОблСтрока.Параметры.ДатаГарантии = "";
			ОблСтрока.Параметры.НомерГарантии = "";
			
			Если Выборка.Гарантия = Неопределено Тогда 
				//
			Иначе
				Если ТипЗнч(Выборка.Гарантия) = ТипЗнч(Справочники.зм_Гарантии.ПустаяСсылка()) Тогда
					ОблСтрока.Параметры.ДатаГарантии = Формат(Выборка.ГарантияДатаВыдачи,"ДФ=dd.MM.yyyy");
				Иначе
					ОблСтрока.Параметры.ДатаГарантии = Формат(Выборка.Гарантия.ДатаДоговора,"ДФ=dd.MM.yyyy");
					ОблСтрока.Параметры.НомерГарантии = Выборка.Гарантия.НомерДоговора;
				КонецЕсли;
			КонецЕсли;
			//--- Oleg SmartT. 2021-06-23	
			
		ТабДок.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	// выводим итоговые суммы 	
	Подвал.Параметры.ИтогоОб = ОбщийОбъем;
	Подвал.Параметры.ИтогоСумма  = ОбщаяСумма;
	Подвал.Параметры.ИтогоСоб = ОбщаяСобственные;
	Подвал.Параметры.ИтогоЗаем = ОбщаяЗаемные;
	
	// Получаем руководитель 
	//+++ Oleg SmartT. 2021-05-14	
	Для Каждого Стр из ПараметрКоманды.Подписи Цикл
		сФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
		ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеДолжности(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;

		Если Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупу.ТочкиМаршрута.СогласованиеСКурирующимЧП Тогда
			Подвал.Параметры.ФИОДиректораДК          = сФио;
			Подвал.Параметры.ДолжностьДиректораДК    = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания1        = Стр.Дата;
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупу.ТочкиМаршрута.СогласованиеСРП Тогда
			Подвал.Параметры.ФИОДиректораДЗСХП       = сФио;
			Подвал.Параметры.ДолжностьДиректораДЗСХП = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания2        = Стр.Дата;
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупу.ТочкиМаршрута.СогласованиеСФД Тогда
			Подвал.Параметры.ФИОДиректораФД          = сФио;
			Подвал.Параметры.ДолжностьДиректораФД    = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания3        = Стр.Дата;
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупу.ТочкиМаршрута.СогласованиеСГБ Тогда
			Подвал.Параметры.ФИОГБ                   = сФио;
			Подвал.Параметры.ДолжностьГБ             = ДолжностьДляПечФормы;
			Подвал.Параметры.ВремяПодписания4        = Стр.Дата;
		КонецЕсли;
		
	КонецЦикла;
	
	сФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
	ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;
	Подвал.Параметры.ФИОМенеджераДЗСХП       = сФио;
	Подвал.Параметры.ДолжностьМенеджераДЗСХП = ДолжностьДляПечФормы;
	Подвал.Параметры.ВремяПодписания5        = ПараметрКоманды.Дата;
	Подвал.Параметры.ДатаРеестра             = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	//--- Oleg SmartT. 2021-05-14	
		
	ТабДок.Вывести(Подвал);
КонецПроцедуры	
