
&НаКлиенте
Процедура НастройкиСхемы(Команда)
	//ПараметрыФормы = Новый Структура("СхемаРасчета",Новый Структура("СхемаРасчета",Объект.Ссылка));
	ФормаНастройки = ПолучитьФорму("Документ.узп_НастройкаСхемРасчетаРейтинговыхОценок.ФормаОбъекта");
	ФормаНастройки.Объект.СхемаРасчета = Объект.Ссылка;
	ФормаНастройки.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьНастройкиСхемыРасчета(Объект.Ссылка, Настройки);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьНастройкиСхемыРасчета(Ссылка,ТабДок)
	Запрос			 	= Новый Запрос;
	Запрос.УстановитьПараметр("СхемаРасчета",Ссылка);
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	запрос.Текст 		= "ВЫБРАТЬ
	             		  |	узп_НастройкиСхемРасчетаОценокСрезПоследних.Критерий,
	             		  |	узп_НастройкиСхемРасчетаОценокСрезПоследних.Приоритет КАК Приоритет
	             		  |ИЗ
	             		  |	РегистрСведений.узп_НастройкиСхемРасчетаОценок.СрезПоследних(&Период, СхемаРасчета = &СхемаРасчета) КАК узп_НастройкиСхемРасчетаОценокСрезПоследних
	             		  |
	             		  |УПОРЯДОЧИТЬ ПО
	             		  |	Приоритет УБЫВ";
	Результат 			= Запрос.Выполнить();
	Выборка 			= Результат.Выбрать();
	ТД 					= Справочники.узп_СхемыРасчетаРейтинговыхОценок.ПолучитьМакет("Макет");
	ОбластьПустаяСтрока = ТД.ПолучитьОбласть("ОбластьПустаяСтрока");
	ТабДок.Вывести(ОбластьПустаяСтрока);
	ОбластьШапки 		= ТД.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(ОбластьШапки);
	Номер = 1;
	Пока Выборка.Следующий() Цикл
		ОбластьСтрока 	= ТД.ПолучитьОбласть("ОбластьСтрока");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,Выборка);
		ОбластьСтрока.Параметры["Номер"] = Номер;
		ТабДок.Вывести(ОбластьСтрока);
		Номер = Номер + 1;
	КонецЦикла;
КонецПроцедуры
