Процедура ДокументыПланирования(ТабДок,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ПодчиненныеДоговорыТекущего) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Макет = ПолучитьМакет("МакетДокументыПланирования");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Документ,
		|	ВложенныйЗапрос.ДоговорКонтрагента КАК Договор,
		|	ВложенныйЗапрос.СуммаПлатежа,
		|	ВложенныйЗапрос.ДатаПлатежа КАК ДатаПлатежа,
		|	ВложенныйЗапрос.ВидДвижения,
		|	ВложенныйЗапрос.Остаток,
		|	ВложенныйЗапрос.ВключеноВПланыПлатежей
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ЗаявкаРасходование.Ссылка КАК Документ,
		|		ЗаявкаРасходование.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|		ЗаявкаРасходование.СуммаПлатежа КАК СуммаПлатежа,
		|		ЗаявкаРасходование.Ссылка.ДатаРасхода КАК ДатаПлатежа,
		|		""Расход"" КАК ВидДвижения,
		|		ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток КАК Остаток,
		|		ПланыПлатежей.Сумма КАК ВключеноВПланыПлатежей
		|	ИЗ
		|		Документ.ден_ЗаявкаНаРасходованиеСредств.РасшифровкаПлатежа КАК ЗаявкаРасходование
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ден_ЗаявкиНаРасходованиеСредств.Остатки(, "+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ДоговорКонтрагента В (&ДоговорыКонтрагента)","ДоговорКонтрагента = &ДоговорКонтрагента")+") КАК ЗаявкиНаРасходованиеСредствОстатки
		|			ПО ЗаявкаРасходование.Ссылка = ЗаявкиНаРасходованиеСредствОстатки.ЗаявкаНаРасходование
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				СУММА(ПланПлатежейПлатежи.Сумма) КАК Сумма,
		|				ПланПлатежейПлатежи.ЗРС КАК ЗРС
		|			ИЗ
		|				Документ.ден_ПланПлатежей.Платежи КАК ПланПлатежейПлатежи
		|			ГДЕ
		|				ПланПлатежейПлатежи.Ссылка.Проведен
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ПланПлатежейПлатежи.ЗРС) КАК ПланыПлатежей
		|			ПО ЗаявкаРасходование.Ссылка = ПланыПлатежей.ЗРС
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ЗаявкаРасходование.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ЗаявкаРасходование.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ЗаявкаРасходование.Ссылка.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ПланируемоеПоступление.Ссылка,
		|		ПланируемоеПоступление.ДоговорКонтрагента,
		|		ПланируемоеПоступление.СуммаПлатежа,
		|		ПланируемоеПоступление.Ссылка.ДатаПоступления,
		|		""Приход"",
		|		ПланируемыеПоступленияДенежныхСредствОстатки.СуммаОстаток,
		|		NULL
		|	ИЗ
		|		Документ.ден_ПланируемоеПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПланируемоеПоступление
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ден_ПланируемыеПоступленияДенежныхСредств.Остатки(, "+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ДоговорКонтрагента В (&ДоговорыКонтрагента)","ДоговорКонтрагента = &ДоговорКонтрагента")+") КАК ПланируемыеПоступленияДенежныхСредствОстатки
		|			ПО ПланируемоеПоступление.Ссылка = ПланируемыеПоступленияДенежныхСредствОстатки.ДокументПланирования
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПланируемоеПоступление.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПланируемоеПоступление.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПланируемоеПоступление.Ссылка.Проведен) КАК ВложенныйЗапрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПлатежа";

	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.УстановитьПараметр("ДоговорыКонтрагента", ПодчиненныеДоговорыТекущего);

	Результат = Запрос.Выполнить();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьДетальныхЗаписей.Параметры.ДокументТекст = Строка(ВыборкаДетальныеЗаписи.Документ);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ДокументыОплаты(ТабДок,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ПодчиненныеДоговорыТекущего) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Макет = Обработки.дог_РаботаСДоговором.ПолучитьМакет("МакетОплаты");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросПоОплатам.Документ КАК Документ,
		|	ЗапросПоОплатам.Договор КАК Договор,
		|	ЗапросПоОплатам.ДатаПлатежа КАК ДатаПлатежа,
		|	ЗапросПоОплатам.СуммаПлатежа,
		|	ЗапросПоОплатам.Оплачено КАК Оплачено
		|ПОМЕСТИТЬ ВТ_ДокументыОплаты
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка КАК Документ,
		|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента КАК Договор,
		|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК ДатаПлатежа,
		|		ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
		|		ИСТИНА КАК Оплачено
		|	ИЗ
		|		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата,
		|		РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа,
		|		ИСТИНА
		|	ИЗ
		|		Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента В (&ДоговорыКонтрагента)","РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка,
		|		ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ДоговорКонтрагента,
		|		ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.ДатаВыписки,
		|		ПлатежноеПоручениеВходящееРасшифровкаПлатежа.СуммаПлатежа,
		|		ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Оплачено
		|	ИЗ
		|		Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка,
		|		ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента,
		|		ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ДатаВыписки,
		|		ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.СуммаПлатежа,
		|		ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Оплачено
		|	ИЗ
		|		Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка,
		|		ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента,
		|		ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаВыписки,
		|		ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.СуммаПлатежа,
		|		ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Оплачено
		|	ИЗ
		|		Документ.ПлатежныйОрдерПоступлениеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПлатежныйОрдерПоступлениеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка,
		|		ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента,
		|		ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.ДатаВыписки,
		|		ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.СуммаПлатежа,
		|		ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Оплачено
		|	ИЗ
		|		Документ.ПлатежныйОрдерСписаниеДенежныхСредств.РасшифровкаПлатежа КАК ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПлатежныйОрдерСписаниеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен) КАК ЗапросПоОплатам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументыОплаты.Документ,
		|	ВТ_ДокументыОплаты.Договор,
		|	ВТ_ДокументыОплаты.ДатаПлатежа КАК ДатаПлатежа,
		|	ВТ_ДокументыОплаты.СуммаПлатежа,
		|	ВТ_ДокументыОплаты.Оплачено
		|ИЗ
		|	ВТ_ДокументыОплаты КАК ВТ_ДокументыОплаты
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПлатежа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	дог_СобытияПоДоговорам.Событие,
		|	дог_СобытияПоДоговорам.ДоговорКонтрагента КАК Договор,
		|	дог_СобытияПоДоговорам.СуммаСобытия,
		|	ВТ_ДокументыОплаты.Документ
		|ИЗ
		|	ВТ_ДокументыОплаты КАК ВТ_ДокументыОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.дог_СобытияПоДоговорам КАК дог_СобытияПоДоговорам
		|		ПО ВТ_ДокументыОплаты.Документ = дог_СобытияПоДоговорам.Регистратор
		|			И ВТ_ДокументыОплаты.Договор = дог_СобытияПоДоговорам.ДоговорКонтрагента
		|ГДЕ
		|	"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"дог_СобытияПоДоговорам.ДоговорКонтрагента В (&ДоговорыКонтрагента)","дог_СобытияПоДоговорам.ДоговорКонтрагента = &ДоговорКонтрагента");

	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.УстановитьПараметр("ДоговорыКонтрагента", ПодчиненныеДоговорыТекущего);

	Результат = Запрос.ВыполнитьПакет();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетальныеЗаписи = Результат[1].Выбрать();
	СобытияВыгрузка = Результат[2].Выгрузить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьДетальныхЗаписей.Параметры.ДокументТекст = Строка(ВыборкаДетальныеЗаписи.Документ);
		СтрокаОписанияСобытия = "";
		СтрокиСобытия = СобытияВыгрузка.НайтиСтроки(Новый Структура("Документ,Договор",ВыборкаДетальныеЗаписи.Документ,ВыборкаДетальныеЗаписи.Договор));
		Для Каждого СтрокаСобытия Из СтрокиСобытия Цикл
			СтрокаОписанияСобытия = СтрокаОписанияСобытия + ?(СтрокаОписанияСобытия="","","; ")+Строка(СтрокаСобытия.Событие)+" ("+Строка(СтрокаСобытия.СуммаСобытия)+" "+Строка(Договор.ВалютаВзаиморасчетов)+")";
		КонецЦикла;
		ОбластьДетальныхЗаписей.Параметры.События = СтрокаОписанияСобытия;
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ДокументыСделок(ТабДок,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ПодчиненныеДоговорыТекущего) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Макет = Обработки.дог_РаботаСДоговором.ПолучитьМакет("МакетСделки");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросПоСделкам.Ссылка КАК Документ,
		|	ЗапросПоСделкам.Договор КАК Договор,
		|	ЗапросПоСделкам.Дата КАК Дата,
		|	ЗапросПоСделкам.СуммаДокумента КАК СуммаОперации
		|ПОМЕСТИТЬ ВТ_Сделки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВозвратТоваровОтПокупателя.Ссылка КАК Ссылка,
		|		ВозвратТоваровОтПокупателя.ДоговорКонтрагента КАК Договор,
		|		ВозвратТоваровОтПокупателя.Дата КАК Дата,
		|		ВозвратТоваровОтПокупателя.СуммаДокумента КАК СуммаДокумента
		|	ИЗ
		|		Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ВозвратТоваровОтПокупателя.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ВозвратТоваровОтПокупателя.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ВозвратТоваровОтПокупателя.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВозвратТоваровПоставщику.Ссылка,
		|		ВозвратТоваровПоставщику.ДоговорКонтрагента,
		|		ВозвратТоваровПоставщику.Дата,
		|		ВозвратТоваровПоставщику.СуммаДокумента
		|	ИЗ
		|		Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ВозвратТоваровПоставщику.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ВозвратТоваровПоставщику.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ВозвратТоваровПоставщику.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АктОбОказанииПроизводственныхУслуг.Ссылка,
		|		АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента,
		|		АктОбОказанииПроизводственныхУслуг.Дата,
		|		АктОбОказанииПроизводственныхУслуг.СуммаДокумента
		|	ИЗ
		|		Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента В (&ДоговорыКонтрагента)","АктОбОказанииПроизводственныхУслуг.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И АктОбОказанииПроизводственныхУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Ссылка,
		|		ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ДоговорКонтрагента,
		|		ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Дата,
		|		ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.СуммаДокумента
		|	ИЗ
		|		Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПередачаНМА.Ссылка,
		|		ПередачаНМА.ДоговорКонтрагента,
		|		ПередачаНМА.Дата,
		|		ПередачаНМА.СуммаДокумента
		|	ИЗ
		|		Документ.ПередачаНМА КАК ПередачаНМА
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПередачаНМА.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПередачаНМА.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПередачаНМА.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПередачаОС.Ссылка,
		|		ПередачаОС.ДоговорКонтрагента,
		|		ПередачаОС.Дата,
		|		ПередачаОС.СуммаДокумента
		|	ИЗ
		|		Документ.ПередачаОС КАК ПередачаОС
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПередачаОС.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПередачаОС.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПередачаОС.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПередачаТоваров.Ссылка,
		|		ПередачаТоваров.ДоговорКонтрагента,
		|		ПередачаТоваров.Дата,
		|		NULL
		|	ИЗ
		|		Документ.ПередачаТоваров КАК ПередачаТоваров
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПередачаТоваров.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПередачаТоваров.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПередачаТоваров.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеДопРасходов.Ссылка,
		|		ПоступлениеДопРасходов.ДоговорКонтрагента,
		|		ПоступлениеДопРасходов.Дата,
		|		ПоступлениеДопРасходов.СуммаДокумента
		|	ИЗ
		|		Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПоступлениеДопРасходов.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПоступлениеДопРасходов.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПоступлениеДопРасходов.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеИзПереработки.Ссылка,
		|		ПоступлениеИзПереработки.ДоговорКонтрагента,
		|		ПоступлениеИзПереработки.Дата,
		|		ПоступлениеИзПереработки.СуммаДокумента
		|	ИЗ
		|		Документ.ПоступлениеИзПереработки КАК ПоступлениеИзПереработки
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПоступлениеИзПереработки.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПоступлениеИзПереработки.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПоступлениеИзПереработки.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеНМА.Ссылка,
		|		ПоступлениеНМА.ДоговорКонтрагента,
		|		ПоступлениеНМА.Дата,
		|		ПоступлениеНМА.СуммаДокумента
		|	ИЗ
		|		Документ.ПоступлениеНМА КАК ПоступлениеНМА
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПоступлениеНМА.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПоступлениеНМА.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПоступлениеНМА.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ПоступлениеТоваровУслуг.Ссылка,
		|		ПоступлениеТоваровУслуг.ДоговорКонтрагента,
		|		ПоступлениеТоваровУслуг.Дата,
		|		ПоступлениеТоваровУслуг.СуммаДокумента
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ПоступлениеТоваровУслуг.ДоговорКонтрагента В (&ДоговорыКонтрагента)","ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И ПоступлениеТоваровУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетНалоговПриПоступленииАктивовУслуг.Ссылка,
		|		РасчетНалоговПриПоступленииАктивовУслуг.ДоговорКонтрагента,
		|		РасчетНалоговПриПоступленииАктивовУслуг.Дата,
		|		РасчетНалоговПриПоступленииАктивовУслуг.СуммаДокумента
		|	ИЗ
		|		Документ.РасчетНалоговПриПоступленииАктивовУслуг КАК РасчетНалоговПриПоступленииАктивовУслуг
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"РасчетНалоговПриПоступленииАктивовУслуг.ДоговорКонтрагента В (&ДоговорыКонтрагента)","РасчетНалоговПриПоступленииАктивовУслуг.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И РасчетНалоговПриПоступленииАктивовУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РеализацияТоваровУслуг.Ссылка,
		|		РеализацияТоваровУслуг.ДоговорКонтрагента,
		|		РеализацияТоваровУслуг.Дата,
		|		РеализацияТоваровУслуг.СуммаДокумента
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"РеализацияТоваровУслуг.ДоговорКонтрагента В (&ДоговорыКонтрагента)","РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И РеализацияТоваровУслуг.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РеализацияУслугПоПереработке.Ссылка,
		|		РеализацияУслугПоПереработке.ДоговорКонтрагента,
		|		РеализацияУслугПоПереработке.Дата,
		|		РеализацияУслугПоПереработке.СуммаДокумента
		|	ИЗ
		|		Документ.РеализацияУслугПоПереработке КАК РеализацияУслугПоПереработке
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"РеализацияУслугПоПереработке.ДоговорКонтрагента В (&ДоговорыКонтрагента)","РеализацияУслугПоПереработке.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И РеализацияУслугПоПереработке.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС.Ссылка,
		|		РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС.ДоговорКонтрагента,
		|		РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС.Дата,
		|		РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС.СуммаДокумента
		|	ИЗ
		|		Документ.РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС КАК РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС.ДоговорКонтрагента В (&ДоговорыКонтрагента)","РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И РегистрацияПрочихОперацийПоПриобретеннымТоварамВЦеляхНДС.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС.Ссылка,
		|		РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС.ДоговорКонтрагента,
		|		РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС.Дата,
		|		РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС.СуммаДокумента
		|	ИЗ
		|		Документ.РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС КАК РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС.ДоговорКонтрагента В (&ДоговорыКонтрагента)","РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И РегистрацияПрочихОперацийПоРеализованнымТоварамВЦеляхНДС.Проведен) КАК ЗапросПоСделкам
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СчетФактураВыданный.Ссылка,
		|		СчетФактураВыданный.ДоговорКонтрагента,
		|		СчетФактураВыданный.Дата,
		|		СчетФактураВыданный.СуммаДокумента
		|	ИЗ
		|		Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"СчетФактураВыданный.ДоговорКонтрагента В (&ДоговорыКонтрагента)","СчетФактураВыданный.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И СчетФактураВыданный.Проведен
		|	
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СчетФактураПолученный.Ссылка,
		|		СчетФактураПолученный.ДоговорКонтрагента,
		|		СчетФактураПолученный.Дата,
		|		СчетФактураПолученный.СуммаДокумента
		|	ИЗ
		|		Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"СчетФактураПолученный.ДоговорКонтрагента В (&ДоговорыКонтрагента)","СчетФактураПолученный.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И СчетФактураПолученный.Проведен
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		узп_ЗаказПокупателя.Ссылка,
		|		узп_ЗаказПокупателя.ДоговорКонтрагента,
		|		узп_ЗаказПокупателя.Дата,
		|		узп_ЗаказПокупателя.СуммаДокумента
		|	ИЗ
		|		Документ.узп_ЗаказПокупателя КАК узп_ЗаказПокупателя
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"узп_ЗаказПокупателя.ДоговорКонтрагента В (&ДоговорыКонтрагента)","узп_ЗаказПокупателя.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И узп_ЗаказПокупателя.Проведен
		|	
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		узп_ЗаказПоставщику.Ссылка,
		|		узп_ЗаказПоставщику.ДоговорКонтрагента,
		|		узп_ЗаказПоставщику.Дата,
		|		узп_ЗаказПоставщику.СуммаДокумента
		|	ИЗ
		|		Документ.узп_ЗаказПоставщику КАК узп_ЗаказПоставщику
		|	ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"узп_ЗаказПоставщику.ДоговорКонтрагента В (&ДоговорыКонтрагента)","узп_ЗаказПоставщику.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|		И узп_ЗаказПоставщику.Проведен
		|	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сделки.Документ,
		|	ВТ_Сделки.Договор,
		|	ВТ_Сделки.Дата КАК Дата,
		|	ВТ_Сделки.СуммаОперации
		|ИЗ
		|	ВТ_Сделки КАК ВТ_Сделки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сделки.Документ,
		|	ВТ_Сделки.Договор,
		|	дог_СобытияПоДоговорам.Событие,
		|	дог_СобытияПоДоговорам.СуммаСобытия
		|ИЗ
		|	ВТ_Сделки КАК ВТ_Сделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.дог_СобытияПоДоговорам КАК дог_СобытияПоДоговорам
		|		ПО ВТ_Сделки.Документ = дог_СобытияПоДоговорам.Регистратор
		|			И ВТ_Сделки.Договор = дог_СобытияПоДоговорам.ДоговорКонтрагента
		|ГДЕ
		|		"+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"дог_СобытияПоДоговорам.ДоговорКонтрагента В (&ДоговорыКонтрагента)","дог_СобытияПоДоговорам.ДоговорКонтрагента = &ДоговорКонтрагента")+"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Сделки.Документ,
		|	ВТ_Сделки.Договор,
		|	дог_ИсполнениеДоговоровОбороты.СуммаРасход
		|ИЗ
		|	ВТ_Сделки КАК ВТ_Сделки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.дог_ИсполнениеДоговоров.Обороты(, , Регистратор, "+?(ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,"ДоговорКонтрагента В (&ДоговорыКонтрагента)","ДоговорКонтрагента = &ДоговорКонтрагента")+") КАК дог_ИсполнениеДоговоровОбороты
		|		ПО ВТ_Сделки.Документ = дог_ИсполнениеДоговоровОбороты.Регистратор
 		|			И ВТ_Сделки.Договор = дог_ИсполнениеДоговоровОбороты.ДоговорКонтрагента";

	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.УстановитьПараметр("ДоговорыКонтрагента", ПодчиненныеДоговорыТекущего);

	Результат = Запрос.ВыполнитьПакет();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетальныеЗаписи = Результат[1].Выбрать();
	СобытияВыгрузка = Результат[2].Выгрузить();
	ИсполненияВыгрузка = Результат[3].Выгрузить();
	

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ОбластьДетальныхЗаписей.Параметры.ДокументТекст = Строка(ВыборкаДетальныеЗаписи.Документ);
		СтрокаОписанияСобытия = "";
		СтрокиСобытия = СобытияВыгрузка.НайтиСтроки(Новый Структура("Документ",ВыборкаДетальныеЗаписи.Документ));
		Для Каждого СтрокаСобытия Из СтрокиСобытия Цикл
			СтрокаОписанияСобытия = СтрокаОписанияСобытия + ?(СтрокаОписанияСобытия="","","; ")+Строка(СтрокаСобытия.Событие)+" ("+Строка(СтрокаСобытия.СуммаСобытия)+" "+Строка(Договор.ВалютаВзаиморасчетов)+")";
		КонецЦикла;
		ОбластьДетальныхЗаписей.Параметры.События = СтрокаОписанияСобытия;
		СтрокиИсполнения = ИсполненияВыгрузка.НайтиСтроки(Новый Структура("Документ",ВыборкаДетальныеЗаписи.Документ));
		ОбластьДетальныхЗаписей.Параметры.СуммаИсполнения = ?(СтрокиИсполнения.Количество()=0,0,СтрокиИсполнения[0].СуммаРасход);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры