
&НаСервереБезКонтекста
Функция ВернутьБП(Задача)
	возврат Задача.БизнесПроцесс;
КонецФункции	

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежей.ФормаОбъекта");	
КонецПроцедуры

&НаКлиенте
Процедура БизнесПроцессы(Команда)
	ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежей.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыполненные(Команда)
	Если не ПоказыватьВыполненные тогда
		Элементы.ФормаПоказатьВыполненные.Заголовок = "Скрыть выполненные";
		ПоказыватьВыполненные = Истина;
	Иначе
		Элементы.ФормаПоказатьВыполненные.Заголовок = "Показать выполненные";
		ПоказыватьВыполненные = Ложь;
		
	КонецЕсли;  
	УстановитьОтбор(ЭтаФорма);	
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтбор(Этаформа);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтбор(Форма) 
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Форма.Список, "Выполнена", Ложь, не Форма.Показыватьвыполненные);	
КонецПроцедуры

&НаСервере
Процедура ПечатьРеестра(Команда)
	
	Отчеты.ЦС_РеестрЗаявокНаРасходованиеДенежныхСредств.ПолучитьФорму("Форма").Открыть();

КонецПроцедуры

&НаСервере
Процедура СписокВыборНаСервере(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = ложь;
	//БП = ВернутьБП(ВыбраннаяСтрока);
	//	
	//Если ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип(БизнесПроцессы.СогласованиеРеестров) Тогда
	//	ОткрытьФорму("БизнесПроцесс.СогласованиеРеестров.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	//Иначе
	//	ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежей.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор1(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СписокВыборНаСервере(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
	СтандартнаяОбработка = ложь;
	БП = ВернутьБП(ВыбраннаяСтрока);
		
	//Если ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = ТипЗнч("БизнесПроцессы.СогласованиеРеестров.пустаяСсылка()") Тогда
	Если ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеРеестров") Тогда
		ОткрытьФорму("БизнесПроцесс.СогласованиеРеестров.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ЗаявкаНаКомандировку") Тогда
		ОткрытьФорму("БизнесПроцесс.ЗаявкаНаКомандировку.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ВнутренниеПереводыПоЦА") Тогда
		ОткрытьФорму("БизнесПроцесс.ВнутренниеПереводыПоЦА.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПредставительств") Тогда
		ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежейПредставительств.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
		
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.РасчетПоХранениюЗерна") Тогда
		ОткрытьФорму("БизнесПроцесс.РасчетПоХранениюЗерна.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
		
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПоЗакупу") Тогда
		ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежейПоЗакупу.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПоФорвардномуЗакупу") Тогда
		ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупу.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеПлатежейПоФорвардномуЗакупуСХТП") Тогда
		ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	Иначе
		ОткрытьФорму("БизнесПроцесс.СогласованиеПлатежей.Форма.ФормаБизнесПроцесса", новый Структура("Ключ,Задача",ВернутьБП(ВыбраннаяСтрока),ВыбраннаяСтрока));
	КонецЕсли;

КонецПроцедуры



