
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ИмяОбработки = ?(фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("фин_РежимИнтеграцииСУчетнойСистемой")=ПредопределенноеЗначение("Перечисление.фин_РежимыИнтеграцииСУчетнойСистемой.КомплексноеУправлениеФинансамиИБюджетированиеДляКазахстана"),"общ_ПросмотрДвиженийДокумента","фин_ПросмотрДвиженийДокумента");
	Если НЕ фин_ОбщегоНазначенияСервер.ЕстьОбъектМетаданных(ИмяОбработки,"Обработки") Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ОткрытьФорму("Обработка."+ИмяОбработки+".Форма",Новый Структура("Документ,РазрешитьРедактированиеДвижений",ПараметрКоманды,Ложь),,ПараметрКоманды);
	КонецЕсли;
КонецПроцедуры
