&НаКлиенте
Перем СоответствиеКоманд;

&НаКлиенте
Процедура ВыборФункции(Команда)
	Если Найти(Команда.Имя,"Цифра")=0 Тогда
		Элементы.Формула.ВыделенныйТекст = СоответствиеКоманд.Получить(Команда.Имя);
	Иначе
		Элементы.Формула.ВыделенныйТекст = Сред(Команда.Имя,СтрДлина("Цифра")+1);
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НадписьПоказателиФормулы = "Показатели формулы";
	НадписьФормула = "Формула";
	Если Параметры.Свойство("Формула") Тогда
		ТекстФормулы = Параметры.Формула;
	КонецЕсли;
	Если Параметры.Свойство("Входящиепоказатели") Тогда
		Для Каждого показатель Из Параметры.Входящиепоказатели Цикл
			НС = ВходящиеПоказатели.Добавить();
			НС.ПредставлениеПоказателя = Показатель;
		КонецЦикла;
	КонецЕсли;
	ТекстФормулы = СтрЗаменить(ТекстФормулы,	"Sqrt(",	"КореньКв(");
	ТекстФормулы = СтрЗаменить(ТекстФормулы,	"Pow(",		"Степень(");
	ПредставлениеФормулы.УстановитьТекст(ТекстФормулы);
	НастроитьДоступность();
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступность()
    Элементы.ВходящиеПоказателиЗначение.Видимость=УказыватьТестовыеЗначения;
КонецПроцедуры

&НаКлиенте
Процедура ВходящиеПоказателиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Если Элементы.ВходящиеПоказатели.ТекущиеДанные.ПредставлениеПоказателя="" Тогда
		Выполнение = Ложь;
	Иначе
		ПараметрыПеретаскивания.Значение = Элементы.ВходящиеПоказатели.ТекущиеДанные.ПредставлениеПоказателя;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВФормулу(Команда)
	Если Элементы.ВходящиеПоказатели.ТекущиеДанные<>Неопределено И Элементы.ВходящиеПоказатели.ТекущиеДанные.ПредставлениеПоказателя<>"" Тогда
		Элементы.Формула.ВыделенныйТекст = Элементы.ВходящиеПоказатели.ТекущиеДанные.ПредставлениеПоказателя;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТригонометрическиеФункции(Команда)
	СписокФункций = Новый СписокЗначений;
	СписокФункций.Добавить("Sin()",		"Sin(Угол) - синус от аргумента, заданного в радианах");
	СписокФункций.Добавить("Cos()",		"Cos(Угол) - косинус от аргумента, заданного в радианах");
	СписокФункций.Добавить("Tan()",		"Tan(Угол) - тангенс от аргумента, заданного в радианах");
	СписокФункций.Добавить("ASin()",	"ASin(Число) - вычисление арксинуса в радианах от аргумента в диапазоне -1 ... 1");
	СписокФункций.Добавить("ACos()",	"ACos(Число) - вычисление арккосинуса в радианах от аргумента в диапазоне -1 ... 1");
	СписокФункций.Добавить("ATan()",	"ATan(Число) - вычисление арктангенса в радианах от аргумента в диапазоне -1 ... 1");
	ОписаниеОбработкаВыбораТригонометрическихФункций = Новый ОписаниеОповещения("ОбработкаВыбораТригонометрическихФункций",ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОбработкаВыбораТригонометрическихФункций,СписокФункций,Элементы.ТригонометрическиеФункции,СписокФункций[0]);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораТригонометрическихФункций(РезультатВыбора,ДополнительныеПараметры) Экспорт
	Если РезультатВыбора <> Неопределено Тогда
		Элементы.Формула.ВыделенныйТекст = РезультатВыбора.Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаФормулы(Команда)
	Если ПроверитьЗаполнение() Тогда
		ВыполнитьПроверку();
	Иначе
		ПоказатьПредупреждение(,"Перед продолжением заполните все необходимые поля!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверку()
	ТекстФормулы = ПредставлениеФормулы.ПолучитьТекст();
	ТекстФормулы = СтрЗаменить(ТекстФормулы,"КореньКв(",	"Sqrt(");
	ТекстФормулы = СтрЗаменить(ТекстФормулы,"Степень(",		"Pow(");
	ТаблицаЗначенийПоказателей = ВходящиеПоказатели.Выгрузить();
	ТаблицаЗначенийПоказателей.Колонки.Добавить("КодПоказателя");
	Для Каждого СтрокаТЗ Из ТаблицаЗначенийПоказателей Цикл
		СтрокаТЗ.КодПоказателя = СтрокаТЗ.ПредставлениеПоказателя;
		Если НЕ УказыватьТестовыеЗначения Тогда
			СтрокаТЗ.Значение = 1;
		КонецЕсли;
	КонецЦикла;
	РезультатРасчета =  фин_ПроцедурыМеханизмовБюджетирования.РассчитатьОтрезокФормулы(ТекстФормулы,ТаблицаЗначенийПоказателей,"Проверка формулы: ",ТекущаяДата());
	Если УказыватьТестовыеЗначения Тогда
		Сообщить("Результат: "+Строка(РезультатРасчета));
	КонецЕсли;
	Сообщить("Готово.");
КонецПроцедуры

&НаКлиенте
Процедура УказыватьТестовыеЗначенияПриИзменении(Элемент)
	НастроитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(ПредставлениеФормулы.ПолучитьТекст());
КонецПроцедуры


СоответствиеКоманд = Новый Соответствие;
СоответствиеКоманд.Вставить("Выбор",	"?(,,)");
СоответствиеКоманд.Вставить("Макс",		"Макс(,)");
СоответствиеКоманд.Вставить("Мин",		"Мин(,)");
СоответствиеКоманд.Вставить("Окр",		"Окр(,)");
СоответствиеКоманд.Вставить("Цел",		"Цел()");
СоответствиеКоманд.Вставить("Оценить",	"ОценитьПо(,)");
СоответствиеКоманд.Вставить("Log",		"Log()");
СоответствиеКоманд.Вставить("Log10",	"Log10()");
СоответствиеКоманд.Вставить("Корень",	"Sqrt()");
СоответствиеКоманд.Вставить("Минус",	"-");
СоответствиеКоманд.Вставить("Плюс",		"+");
СоответствиеКоманд.Вставить("СкобкаЗакрывающая",	")");
СоответствиеКоманд.Вставить("СкобкаОткрывающая",	"(");
СоответствиеКоманд.Вставить("Степень",	"Pow(,)");
СоответствиеКоманд.Вставить("Умножить",	"*");
СоответствиеКоманд.Вставить("Делить",	"/");
СоответствиеКоманд.Вставить("Exp",		"Exp()");
СоответствиеКоманд.Вставить("Больше",		">");
СоответствиеКоманд.Вставить("Меньше",		"<");
СоответствиеКоманд.Вставить("Равно",		"=");
СоответствиеКоманд.Вставить("БольшеИлиРавно",		"=>");
СоответствиеКоманд.Вставить("МеньшеИлиРавно",		"<=");
СоответствиеКоманд.Вставить("НеРавно",		"<>");
СоответствиеКоманд.Вставить("Точка",		".");
