
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр _ФуражныйФонд Приход
	Движения._ФуражныйФонд.Записывать = Истина;
	Движения._ФуражныйФонд.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения._ФуражныйФонд.Добавить();
		Если ВидОперации = Перечисления.зм_ВидыОперацийЗалоговогоОбеспечения.Регистрация ИЛИ ВидОперации = Перечисления.зм_ВидыОперацийЗалоговогоОбеспечения.Увеличение Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		ИначеЕсли ВидОперации = Перечисления.зм_ВидыОперацийЗалоговогоОбеспечения.Закрытие Или ВидОперации = Перечисления.зм_ВидыОперацийЗалоговогоОбеспечения.Уменьшение Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ВидРесурса = ВидРесурса;
		Движение.Склад = ТекСтрокаТовары.Склад;
		Движение.ТипОперации = ТекСтрокаТовары.ТипОперации;
		Движение.ГодУрожая = ТекСтрокаТовары.ГодУрожая;
		Движение.Культура = ТекСтрокаТовары.Культура;
		Движение.Класс = ТекСтрокаТовары.Класс;
		Движение.Зерноваярасписка = ТекСтрокаТовары.Зерноваярасписка;
		Движение.Получатель = ТекСтрокаТовары.Получатель;
		Движение.Зачтенныйвес = ТекСтрокаТовары.Зачтенныйвес;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
