
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	оф_ОписаниеЗаголовок = "Описание";
	оф_ДополнительноЗаголовок = "Дополнительно";
	оф_ПериодАктивностиЗаголовок = "Период активности";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

