
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметры,"ПериодСбораДанных,Периодичность,НачалоПериода,КонецПериода,Лаг");
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УправлениеФормой(Форма)
	Форма.Элементы.ГруппаПериод.Видимость = Форма.ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.Произвольный");
	Форма.Элементы.Лаг.Видимость = Форма.ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ПредшествующийПериод");
	Форма.Элементы.Периодичность.Видимость = Форма.ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ПредшествующийПериод") ИЛИ Форма.ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ПланируемыйПериодСНакоплением") ИЛИ Форма.ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ИсторическиеДанные") ИЛИ Форма.ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ИсторическиеДанныеСНакоплением");
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("ПериодСбораДанных,Периодичность,НачалоПериода,КонецПериода,Лаг",ПериодСбораДанных,Периодичность,НачалоПериода,КонецПериода,Лаг));
КонецПроцедуры

&НаКлиенте
Процедура СпособОпределенияПериодаПриИзменении(Элемент)
	Если НЕ ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.Произвольный") Тогда
		НачалоПериода = '00010101';
		КонецПериода = '00010101';
	КонецЕсли;
	Если НЕ ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ПредшествующийПериод") Тогда
		Лаг = 0;
	КонецЕсли;
	Если НЕ (ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ИсторическиеДанные") ИЛИ ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ИсторическиеДанныеСНакоплением") ИЛИ ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ПредшествующийПериод") ИЛИ ПериодСбораДанных = ПредопределенноеЗначение("Перечисление.ден_СпособыОпределенияПериодов.ПланируемыйПериодСНакоплением")) Тогда
		Периодичность = ПредопределенноеЗначение("Перечисление.фин_Периодичность.ПустаяСсылка");
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры
