
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фин_БюджетированиеОбщегоНазначения.НастроитьОформлениеТабличногоПоля(Элементы.Список);
	Если фин_УправлениеОтчетамиБюджетирование.ОграничиватьВидимостьНастроекОтчетов() Тогда
	     ДоступныеНастройки 		= фин_УправлениеОтчетамиБюджетирование.ДоступныеПользователюНастройки();
	     НовыйОтбор 				= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
		 НовыйОтбор.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
		 НовыйОтбор.ПравоеЗначение	= ДоступныеНастройки;
		 НовыйОтбор.Использование	= Истина;
	КонецЕсли;
КонецПроцедуры
