
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	Настройки = КомпоновщикНастроек.Настройки;
//	
//	ГруппаТоварныйКредит = Настройки.ПараметрыДанных.Элементы.Найти("ГруппаТоварныйКредит");
//    ГруппаТоварныйКредит.Значение = Справочники.ТипыОпераций.НайтиПоКоду("ЮР-00105");
//    ГруппаТоварныйКредит.Использование = Истина;
//	
//	ДополнительныйПараметрТипОперации = Настройки.ПараметрыДанных.Элементы.Найти("ДополнительныйПараметрТипОперации");
//    ДополнительныйПараметрТипОперации.Значение = ПланыВидовХарактеристик.дог_ДополнительныеПараметрыДоговоров.НайтиПоКоду("ПР0000016");
//    ДополнительныйПараметрТипОперации.Использование = Истина;

//	Объем = Настройки.ПараметрыДанных.Элементы.Найти("Объем");
//    Объем.Значение = ПланыВидовХарактеристик.дог_ДополнительныеПараметрыДоговоров.НайтиПоКоду("ПР0000012");
//    Объем.Использование = Истина;

//	
//КонецПроцедуры
