
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	Идентификатор = ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор;
	ПараметрыФормы = Новый Структура("Адрес",АдресПараметров(ПараметрКоманды,Идентификатор));
	ОткрытьФорму("Обработка.фин_ПостроениеЦепочкиСвязей.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, Идентификатор);//, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры

&НаСервере
Функция АдресПараметров(ПараметрКоманды,УникальныйИдентификатор)
	Возврат фин_ПроцедурыМеханизмовБюджетирования.ПередатьДанныеАнализаСтруктуры(ПараметрКоманды,УникальныйИдентификатор);	
КонецФункции
