
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаИзмерения Из ИзмеренияИсточника Цикл
		Для Каждого СтрокаСвязь ИЗ ИзмеренияИсточника Цикл
			Если СтрокаСвязь=СтрокаИзмерения Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаСвязь.ИзмерениеБюджетирования=СтрокаИзмерения.ИзмерениеБюджетирования Тогда
				ТекстСообщения = НСтр("ru = 'Повторяющееся измерение бюджетирования: "+Строка(СтрокаИзмерения.ИзмерениеБюджетирования)+"'");
				Поле = "ИзмеренияИсточника" + "[" + Формат(СтрокаСвязь.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ИзмерениеБюджетирования";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


