#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

Функция РазрешеноИзменятьСтруктурныеХарактеристикиОтклонения(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_РассмотрениеОтклоненийФактическихДанных.Ссылка
		|ИЗ
		|	Документ.фин_РассмотрениеОтклоненийФактическихДанных КАК фин_РассмотрениеОтклоненийФактическихДанных
		|ГДЕ
		|	фин_РассмотрениеОтклоненийФактическихДанных.ПричинаОтклонения = &ПричинаОтклонения
		|	И фин_РассмотрениеОтклоненийФактическихДанных.Проведен";
	
	Запрос.УстановитьПараметр("ПричинаОтклонения", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецЕсли