
&НаКлиенте
Процедура ПериодПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериода",ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.фин_ВыборБюджетногоПериода",Новый Структура("РазрешитьПроизвольныйПериод,НачалоПериодаПланирования,Периодичность",Истина,Запись.ПериодПланирования,Запись.Сценарий),ЭтотОбъект,УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериода(РезультатВыбора,ДополнительныеПараметры) Экспорт
	Если РезультатВыбора<>Неопределено Тогда
		Запись.ПериодПланирования = РезультатВыбора.НачалоПериода;	
	КонецЕсли;
КонецПроцедуры
