
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.фин_ФинансовыеПоказатели.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	ОткрытьФорму("Отчет.фин_НастройкиФактическихДанныхПоФинансовомуПоказателю.Форма",Новый Структура("НеВосстанавливатьНастройки,СформироватьПриОткрытии,ФинансовыйПоказатель,Дата",Истина,Истина,ПараметрКоманды,ТекущаяДата()),,ПараметрыВыполненияКоманды.Уникальность);
КонецПроцедуры
