
&НаСервере
Процедура БанкПриИзмененииНаСервере()
	Объект.БИК = Объект.Банк.БИК;
КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	БанкПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура БИНПриИзмененииНаСервере()
	
	ДанныеКонтрагента = Справочники.Контрагенты.НайтиПоРеквизиту("ИдентификационныйКодЛичности", Объект.БИН);
		
	//Запрос по юридическому адресу на русском
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Поле1,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Поле4,
		|	КонтактнаяИнформация.Поле5,
		|	КонтактнаяИнформация.Поле6,
		|	КонтактнаяИнформация.Поле7,
		|	КонтактнаяИнформация.Поле8,
		|	КонтактнаяИнформация.Поле9,
		|	КонтактнаяИнформация.Поле10,
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Запрос.УстановитьПараметр("Объект", ДанныеКонтрагента);
	ВыборкаЮрАдрес = Запрос.Выполнить().Выбрать();
 	//Запрос по телефону
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле2 + "" "" + КонтактнаяИнформация.Поле3 КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Запрос.УстановитьПараметр("Объект", ДанныеКонтрагента);
	ВыборкаТелефон = Запрос.Выполнить().Выбрать();
	//Запрос по электронной почте
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле2 + "" "" + КонтактнаяИнформация.Поле3 КАК Телефон
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Объект", ДанныеКонтрагента);
	ВыборкаЕмайл = Запрос.Выполнить().Выбрать();
	//Запрос по юридическому адресу на казахском языке
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Поле1,
		|	КонтактнаяИнформация.Поле2,
		|	КонтактнаяИнформация.Поле3,
		|	КонтактнаяИнформация.Поле4,
		|	КонтактнаяИнформация.Поле5,
		|	КонтактнаяИнформация.Поле6,
		|	КонтактнаяИнформация.Поле7,
		|	КонтактнаяИнформация.Поле8,
		|	КонтактнаяИнформация.Поле9,
		|	КонтактнаяИнформация.Поле10,
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Вид = &Вид";
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагентаКаз);
	Запрос.УстановитьПараметр("Объект", ДанныеКонтрагента);
	ВыборкаЮрАдресКаз = Запрос.Выполнить().Выбрать();
	
			Объект.НаименованиеРус = ДанныеКонтрагента.НаименованиеПолное;
			Объект.НаименованиеКаз = ДанныеКонтрагента.НаименованиеПолноеКЗ;
			Объект.КБЕ = ДанныеКонтрагента.КБЕ;
			Объект.Пол = ДанныеКонтрагента.Пол;
			Объект.СтранаРезиденства = ДанныеКонтрагента.СтранаРезидентства;
			Объект.Банк = ДанныеКонтрагента.ОсновнойБанковскийСчет.Банк;
			Объект.ИИК = ДанныеКонтрагента.ОсновнойБанковскийСчет.НомерСчета;
			Объект.БИК = ДанныеКонтрагента.ОсновнойБанковскийСчет.Банк.БИК;
			Объект.ЮЛ_ФЛ = ДанныеКонтрагента.ЮрФизЛицо;
			Объект.СубъектПредпринимательства = ДанныеКонтрагента.ВидыСубъектаПредпринимательства;
			Объект.КодКАТО = ДанныеКонтрагента.КодПоКАТО;
			Объект.Индекс = ВыборкаЮрАдрес.Поле1;
			Объект.ОбластьРус = ВыборкаЮрАдрес.Поле2;
			Объект.РайонРус = ВыборкаЮрАдрес.Поле3;
			Объект.ГородРус = ВыборкаЮрАдрес.Поле4;
			Объект.УлицаРус = ВыборкаЮрАдрес.Поле6;
			Объект.НомерЗдания = ВыборкаЮрАдрес.Поле7;
			Объект.НомерОфиса = ВыборкаЮрАдрес.Поле9;
			Объект.Телефон = ВыборкаТелефон.Представление;
			Объект.Email = ВыборкаЕмайл.Представление;
			
	//	Иначе Возврат
	//	КонецЕсли;
	//	
	//Иначе Возврат
		//КонецЕсли;
		
	КонецПроцедуры
	
&НаКлиенте
Процедура БИНПриИзменении(Элемент)
	
	//ДанныеКонтрагента = Справочники.Контрагенты.НайтиПоРеквизиту("ИдентификационныйКодЛичности", Объект.БИН);
	
	//Если ЗначениеЗаполнено(ДанныеКонтрагента) Тогда
	//		Ответ = Вопрос("Контрагент уже занесен в Информационную систему.Заполнить данные?", РежимДиалогаВопрос.ДаНет);
	//		Если Ответ = КодВозвратаДиалога.Да Тогда 
				БИНПриИзмененииНаСервере();
	//			Модифицированность = истина;

	//		Иначе
	//			Возврат;
	//		КонецЕсли;
	//	КонецЕсли;
КонецПроцедуры
	
&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	Если Не ЗначениеЗаполнено(Объект.БИН) Тогда
		Сообщить("Не заполнен БИН");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.НаименованиеРус) Тогда
		Сообщить("Не заполнено наименование контрагента");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЮЛ_ФЛ) Тогда
		Сообщить("Не указан юридическое/физическое лицо");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтранаРезиденства) Тогда
		Сообщить("Не указана страна резиденства");
		Возврат;
	КонецЕсли;
	
	СоздатьКонтрагентаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКонтрагентаНаСервере()
	Попытка
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	Исключение
		Сообщить("Контрагент не создан");
	КонецПопытки;
	
	НовыйКонтрагент.ИдентификационныйКодЛичности = Объект.БИН;
	НовыйКонтрагент.Наименование   				 = Объект.НаименованиеРус;
	НовыйКонтрагент.НаименованиеПолное 			 = Объект.НаименованиеРус;
	НовыйКонтрагент.ЮрФизЛицо					 = Объект.ЮрФизЛицо;
	НовыйКонтрагент.СтранаРезидентства 			 = Объект.СтранаРезиденства;
	НовыйКонтрагент.КБЕ                          = Объект.КБЕ;
	НовыйКонтрагент.НаименованиеПолноеКЗ         = Объект.НаименованиеКаз;
	НовыйКонтрагент.Пол                          = Объект.Пол;
	
	Попытка
		НовыйКонтрагент.Записать();
	Исключение
		Сообщить("Контрагент не записан")
	КонецПопытки;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	ПриОткрытииНаСервере();
//КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура ПриОткрытииНаСервере()
//	
//	Если НЕ РольДоступна("ПолныеПрава")
//		Тогда
//		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьКонтрагента.Видимость = Ложь;
//		Этот
//	КонецЕсли;
//	
//КонецПроцедуры





