#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура ОбработкаПроведения
// 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	фин_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.фин_РассмотрениеОтклоненийФактическихДанных.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
    	
	фин_УправлениеПроведениемДокументовСервер.СформироватьДвиженияПоРегистрам(ПараметрыПроведения.Реквизиты, ПараметрыПроведения.ТаблицаБюджетныеОперации, Движения, Отказ,"БюджетныеОперации",,,"фин_АнализОтклоненийФактическихДанных");	
	
	фин_УправлениеПроведениемДокументовСервер.СформироватьДвиженияПоРегистрам(ПараметрыПроведения.Реквизиты, ПараметрыПроведения.ТаблицаИсполнители, Движения, Отказ,"Исполнители",,,"фин_КалендарныеПланыБюджетныхКампаний","Реквизиты.ПланироватьИсправительныеПредупредительныеМеры=ИСТИНА");	
		
КонецПроцедуры //ОбработкаПроведения

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	БюджетированиеПоОрганизациям 	= фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("БюджетированиеПоОрганизациям");
	Если НЕ БюджетированиеПоОрганизациям Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	Если НЕ ПланироватьИсправительныеПредупредительныеМеры Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОтветственныйЗаПринятиеМер");
		МассивНепроверяемыхРеквизитов.Добавить("Рекомендации");
		МассивНепроверяемыхРеквизитов.Добавить("Мероприятие");
		МассивНепроверяемыхРеквизитов.Добавить("Исполнители");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаЗавершения");
		МассивНепроверяемыхРеквизитов.Добавить("Исполнители.Исполнитель");
	КонецЕсли;
		
	фин_ЗаполнениеДокументов.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
		
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура") 
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		Возврат;
	ИначеЕсли ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения = Тип("Структура") Тогда
		Попытка
			Документы.фин_РассмотрениеОтклоненийФактическихДанных.ЗаполнитьПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
		Исключение
		КонецПопытки;
		Возврат;
	КонецЕсли;
	фин_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект,фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета"));
КонецПроцедуры

#КонецЕсли
