
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Бюджет,НеВосстанавливатьНастройки,СформироватьПриОткрытии",ПараметрКоманды,Истина,Истина);
	ОткрытьФорму("Отчет.фин_СтруктураВерсийБюджета.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,ПараметрыВыполненияКоманды.Окно), ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
