
&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока).Идентификатор);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("ЭлементыДерева") Тогда
		Сообщить("Форма не предназначена для самостоятельной работы");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ДеревоЗначений = ДанныеФормыВЗначение(Дерево,Тип("ДеревоЗначений"));
	СтрокаДерева = ДеревоЗначений.Строки.Добавить();
	СтрокаДерева.Идентификатор = -1;
	СтрокаДерева.Наименование = "Статьи бюджета";
	Для Каждого ЭлементСтрок Из Параметры.ЭлементыДерева Цикл
		СтрокаРодителя = ДеревоЗначений.Строки.НайтиСтроки(Новый Структура("Идентификатор",ЭлементСтрок.ИдентификаторРодителя),Истина)[0];
		НоваяСтрока = СтрокаРодителя.Строки.Добавить();
		НоваяСтрока.Идентификатор = ЭлементСтрок.Идентификатор;
		НоваяСтрока.Наименование = ЭлементСтрок.Наименование;
	КонецЦикла;
	ЗначениеВДанныеФормы(ДеревоЗначений,Дерево);
КонецПроцедуры
