Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	Результат.ФиксацияСверху = 8;
	Результат.ФиксацияСлева = 3;
	
	Возврат;
	
КонецПроцедуры

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(КонецПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВыборкаДанных = ПолучитьВыборку();
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ВыборкаДанных);
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаИтого");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Год(НачалоПериода)+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредыдущийПлан");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1)))+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредыдущийФакт");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1)))+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредществующий");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Год( НачалоДня(Дата(Год(НачалоПериода)-2,1,1)))+" года";
	КонецЕсли;
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаТриГодаНазад");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1)))+" года";
	КонецЕсли;
	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение3");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Год( НачалоДня(Дата(Год(НачалоПериода),1,1)))+" года к оценке "  +Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1)))+" года";
	КонецЕсли;
	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонения4");
	Если Поле<> Неопределено Тогда
		Поле.Заголовок = "План " + Год( НачалоДня(Дата(Год(НачалоПериода),1,1)))+ " года к факту " + Год(НачалоДня(Дата(Год(НачалоПериода)-2,1,1)))+ " года";
	КонецЕсли;	
	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонения5");
	Если Поле<> Неопределено Тогда
		Поле.Заголовок = "План " + Год( НачалоДня(Дата(Год(НачалоПериода),1,1)))+ " года к факту " + Год(НачалоДня(Дата(Год(НачалоПериода)-3,1,1)))+ " года";
	КонецЕсли;	
	//Предыдущий период
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредыдущегоПериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредыдущегоПериода", КонецДня(Дата(Год(НачалоПериода)-1,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредществующегоПериода", НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериодаТриГодаНазад", НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериодаТриГодаНазад", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));

	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ФормируемыйБюджет", ФормируемыйБюджет);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводПодписиОтчета(Результат)
	
	//Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	//ОбластьПодписи        = Макет.ПолучитьОбласть("ПодписиПроверил");
	//Результат.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	СтандартныеОтчеты.ВыводЗаголовкаСпециализированногоОтчета(ОтчетОбъект, Результат);
			
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
	ЗаголовокОтчета = "Производственная программа" + СтандартныеОтчеты.ПолучитьПредставлениеПериода(ЭтотОбъект);

	Возврат ?(ОрганизацияВНачале, ЗаголовокОтчета, ЗаголовокОтчета + " " + СтандартныеОтчеты.ПолучитьТекстОрганизация(ЭтотОбъект));
		
КонецФункции

Функция ПолучитьВыборку ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	б_РасчетнаяТаблицаРеализацияОбороты.ОРганизация КАК Организация,
	              // |	б_РасчетнаяТаблицаРеализацияОбороты.Бюджет.ИсточникФинансирования КАК ВидРесурса,
	               |	б_РасчетнаяТаблицаРеализацияОбороты.ВидОперации КАК ВидОперации,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 1
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаЯнварь,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 2
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаФевраль,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 3
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаМарт,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 4
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаАпрель,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 5
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаМай,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 6
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаИюнь,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 7
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаИюль,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 8
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаАвгуст,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 9
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаСентябрь,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 10
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаОктябрь,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 11
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаНоябрь,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) = 12
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаДекабрь,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) < 4
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаПервыйКвартал,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) > 3
	               |				И МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) < 7
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаВторойКвартал,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) > 6
	               |				И МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) < 10
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаТретийКвартал,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) > 9
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаЧетвертыйКвартал,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) < 7
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаЗаПолугодие,
	               |	ВЫБОР
	               |		КОГДА МЕСЯЦ(б_РасчетнаяТаблицаРеализацияОбороты.Период) < 10
	               |			ТОГДА ВЫБОР
	               |					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |						ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |								ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |							ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаЗаДевятьМесяцев,
	               |	ВЫБОР
	               |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000000
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0) / 1000
	               |				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОбороты.КоличествоОборот, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СуммаИтого,
	               |	0 КАК СуммаПредыдущийПлан,
	               |	0 КАК СуммаПредыдущийФакт,
	               |	0 КАК СуммаПредществующий,
	               |	0 КАК СуммаТриГодаНазад,
	               |	ВЫБОР
	               |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |			ТОГДА ""млн. тонн""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |					ТОГДА ""тыс. тонн""
	               |				ИНАЧЕ ""тонн""
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ЕдИзм
	               |ИЗ
	               |	РегистрНакопления.б_РасчетнаяТаблицаРеализация.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК б_РасчетнаяТаблицаРеализацияОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	б_РасчетнаяТаблицаРеализацияОборотыПред.ОРганизация,
				   //|	б_РасчетнаяТаблицаРеализацияОборотыПред.Бюджет.ИсточникФинансирования,
	               |	б_РасчетнаяТаблицаРеализацияОборотыПред.ВидОперации,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |			ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОборотыПред.КоличествоОборот, 0) / 1000000
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |					ТОГДА ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОборотыПред.КоличествоОборот, 0) / 1000
	               |				ИНАЧЕ ЕСТЬNULL(б_РасчетнаяТаблицаРеализацияОборотыПред.КоличествоОборот, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	0,
	               |	0,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	               |			ТОГДА ""млн. тонн""
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	               |					ТОГДА ""тыс. тонн""
	               |				ИНАЧЕ ""тонн""
	               |			КОНЕЦ
	               |	КОНЕЦ
	               |ИЗ
	               |	РегистрНакопления.б_РасчетнаяТаблицаРеализация.Обороты(&НачалоПредыдущегопериода, &КонецПредыдущегоПериода, Регистратор, ) КАК б_РасчетнаяТаблицаРеализацияОборотыПред
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
				   |
				   |ВЫБРАТЬ
				   |	ур_РеализацияЗернаОборотыПред.Организация,
				   //|	ур_РеализацияЗернаОборотыПред.ВидРесурса.ТипРесурса.ИсточникФинансирования,
				   |	ур_РеализацияЗернаОборотыПред.ВидОперации,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	ВЫБОР
				   |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
				   |			ТОГДА ЕСТЬNULL(ур_РеализацияЗернаОборотыПред.КоличествоОборот, 0) / 1000000
				   |		ИНАЧЕ ВЫБОР
				   |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
				   |					ТОГДА ЕСТЬNULL(ур_РеализацияЗернаОборотыПред.КоличествоОборот, 0) / 1000
				   |				ИНАЧЕ ЕСТЬNULL(ур_РеализацияЗернаОборотыПред.КоличествоОборот, 0)
				   |			КОНЕЦ
				   |	КОНЕЦ,
				   |	0,
				   |	ВЫБОР
				   |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
				   |			ТОГДА ""млн. тонн""
				   |		ИНАЧЕ ВЫБОР
				   |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
				   |					ТОГДА ""тыс. тонн""
				   |				ИНАЧЕ ""тонн""
				   |			КОНЕЦ
				   |	КОНЕЦ
				   |ИЗ
				   |	РегистрНакопления.ур_РеализацияЗерна.Обороты(&НачалоПредществующегоПериода, &КонецПредществующегоПериода, Регистратор, ) КАК ур_РеализацияЗернаОборотыПред
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
// ВСТАВКА СТАНИСЛАВ
				   |
				   |ВЫБРАТЬ
				   |	ур_РеализацияЗернаОборотыТриГодаНазад.Организация,
				   //|	ур_РеализацияЗернаОборотыТриГодаНазад.ВидРесурса.ТипРесурса.ИсточникФинансирования,
				   |	ур_РеализацияЗернаОборотыТриГодаНазад.ВидОперации,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	ВЫБОР
				   |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
				   |			ТОГДА ЕСТЬNULL(ур_РеализацияЗернаОборотыТриГодаНазад.КоличествоОборот, 0) / 1000000
				   |		ИНАЧЕ ВЫБОР
				   |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
				   |					ТОГДА ЕСТЬNULL(ур_РеализацияЗернаОборотыТриГодаНазад.КоличествоОборот, 0) / 1000
				   |				ИНАЧЕ ЕСТЬNULL(ур_РеализацияЗернаОборотыТриГодаНазад.КоличествоОборот, 0)
				   |			КОНЕЦ
				   |	КОНЕЦ,
				   |	ВЫБОР
				   |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
				   |			ТОГДА ""млн. тонн""
				   |		ИНАЧЕ ВЫБОР
				   |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
				   |					ТОГДА ""тыс. тонн""
				   |				ИНАЧЕ ""тонн""
				   |			КОНЕЦ
				   |	КОНЕЦ
				   |ИЗ
				   |	РегистрНакопления.ур_РеализацияЗерна.Обороты(&НачалоПериодаТриГодаНазад, &КонецПериодаТриГодаНазад, Регистратор, ) КАК ур_РеализацияЗернаОборотыТриГодаНазад
				   |
				   |ОБЪЕДИНИТЬ ВСЕ
// КОНЕЦВСТАВКИ
				   |
				   |ВЫБРАТЬ
				   |	ур_РеализацияЗернаОборотыПредыд.Организация,
				   //|	ур_РеализацияЗернаОборотыПредыд.ВидРесурса.ТипРесурса.ИсточникФинансирования,
				   |	ур_РеализацияЗернаОборотыПредыд.ВидОперации,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	0,
				   |	ВЫБОР
				   |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
				   |			ТОГДА ЕСТЬNULL(ур_РеализацияЗернаОборотыПредыд.КоличествоОборот, 0) / 1000000
				   |		ИНАЧЕ ВЫБОР
				   |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
				   |					ТОГДА ЕСТЬNULL(ур_РеализацияЗернаОборотыПредыд.КоличествоОборот, 0) / 1000
				   |				ИНАЧЕ ЕСТЬNULL(ур_РеализацияЗернаОборотыПредыд.КоличествоОборот, 0)
				   |			КОНЕЦ
				   |	КОНЕЦ,
				   |	0,
				   |	0,
				   |	ВЫБОР
				   |		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
				   |			ТОГДА ""млн. тонн""
				   |		ИНАЧЕ ВЫБОР
				   |				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
				   |					ТОГДА ""тыс. тонн""
				   |				ИНАЧЕ ""тонн""
				   |			КОНЕЦ
				   |	КОНЕЦ
				   |ИЗ
				   |	РегистрНакопления.ур_РеализацияЗерна.Обороты(&НачалоПредыдущегопериода, &КонецПредыдущегоПериода, Регистратор, ) КАК ур_РеализацияЗернаОборотыПредыд";
	//
	
	
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	//Запрос.УстановитьПараметр("ФормируемыйБюджет",ФормируемыйБюджет);
	Запрос.УстановитьПараметр("СтатьяНачальныхОстатков",ФормируемыйБюджет.СтатьяНачальныхОстатков);
	Запрос.УстановитьПараметр("СтатьяКонечныхОстатков",ФормируемыйБюджет.СтатьяКонечныхОстатков);
	Запрос.УстановитьПараметр("Статус",Перечисления.СостоянияОбъектов.Утвержден);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПредыдущегопериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода",КонецДня(Дата(Год(НачалоПериода)-1,12,31)));
	Запрос.УстановитьПараметр("НачалоПредществующегоПериода",НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	Запрос.УстановитьПараметр("КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));
	Запрос.УстановитьПараметр("НачалоПериодаТриГодаНазад",НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	Запрос.УстановитьПараметр("КонецПериодаТриГодаНазад", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));
	Возврат Запрос.Выполнить();


КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;