&НаКлиенте
Процедура ОбновитьКарту(Команда) // Обработчик команды формы 
	ОбновитьКартуСервер();  	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьКартуСервер() // Серверная контекстная процедура получения карты маршрута 
	// Конвертируем объект формы в объект бизнес-процесса
	ОбъектБП = РеквизитФормыВЗначение("Объект"); 
	// Вызываем метод получения карты маршрута текущего бизнес-процесса
	Карта = ОбъектБП.ПолучитьКартуМаршрута();      	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекущееСостояниеБП()
	ОбновитьКартуСервер();
	Если не ЗначениеЗаполнено(ТекущаяТочка) тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.ТочкаМаршрута,
		|	ЗадачаИсполнителя.Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителяПоСогласованиюПлатежей КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.БизнесПроцесс = &Ссылка
		|	И НЕ ЗадачаИсполнителя.Выполнена";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекущаяТочка 	= ВыборкаДетальныеЗаписи.точкамаршрута;
			Задача 			= ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если параметры.Свойство("Задача") тогда
		Задача 			= Параметры.Задача;
		ТекущаяТочка 	= Параметры.Задача.ТочкаМаршрута;	
	КонецЕсли;
	Если Параметры.Ключ.Пустая() тогда
		ПолучитьТекущееСостояниеБП();
		ПодготовитьФорму(ЭтаФорма);
	КонецЕсли;
		
	ТекущийИсполнитель = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


Процедура ОбновитьИсториюИзменений()
	
	ИсторияИсполнения = "";
	Комментарии.Очистить();
	Для Каждого СтрокаТЧ из Объект.КомментарииПроцесса Цикл
		ИсторияИсполнения = ИсторияИсполнения + Символы.ПС +"["+ СтрокаТЧ.Автор +"]"+ " *** " +СтрокаТЧ.Дата + Символы.Таб + СтрокаТЧ.Комментарий+Символы.ПС;	
	КонецЦикла;
	Макет = БизнесПроцессы.СогласованиеРеестров.ПолучитьМакет("Макет");
	Обл = Макет.ПолучитьОбласть("Заголовок");
	Комментарии.Вывести(Обл);
	Обл = Макет.ПолучитьОбласть("Строка");
	
	Для каждого СтрокаТЧ Из объект.КомментарииПроцесса Цикл
		Обл.Параметры.Заполнить(СтрокаТЧ);
		Комментарии.Вывести(Обл);
	КонецЦикла;
	
	
КонецПроцедуры
	

&НаКлиенте
Процедура ПлатежноеПоручениеНажатие(Элемент, СтандартнаяОбработка)
	
	ОткрытьЗначение(ПлатежноеПоручение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПодготовитьФорму(Форма)
	         
	Объект 			= Форма.Объект;
	Элементы 		= Форма.Элементы;	
	ТекущаяТочка 	= Форма.ТекущаяТочка;
	Задача			= Форма.Задача;
	
	Если Объект.стартован 
		и не ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.РаботаСЗаявкойАвтором") тогда
		элементы.левая.толькопросмотр 		= истина;
		Элементы.правая.Толькопросмотр		= Истина;
		
		Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		Элементы.ПлатежиЗаполнить.Видимость = Ложь;

	КонецЕсли;

	Если задача.Выполнена тогда
		Форма.ТолькоПросмотр = Истина;
		Сообщить("Текущий этап выполнен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	Если объект.Завершен тогда
		Форма.ТолькоПросмотр = Истина;
		Форма.Элементы.Группа1.Видимость = ложь;
		
		Сообщить("Бизнес-процесс завершен. Редактирование формы невозможно");
		возврат;
	КонецЕсли;
	
	
	
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.СогласованиеСДиректоромФД")	тогда
		Элементы.ПроверкаДиректоромФДВыполнена.Доступность 		= Истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.СогласованиеСДиректоромКД")	тогда
		Элементы.ПроверкаДиректоромКДВыполнена.Доступность 		= Истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.ПроверкаВР")				тогда
		Элементы.ПодписанПредседателем.Доступность 				= Истина;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.РаботаСЗаявкойАвтором")
		или не ЗначениеЗаполнено(ТекущаяТочка) тогда
		Элементы.вернутьнадоработку.видимость 				= Ложь;
		Элементы.ОтказатьВПоставленнойЗадаче.видимость 		= Ложь;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.СозданиеПП")	тогда
		Элементы.ВыполнитьЭтап.Заголовок = "Ознакомлен";
		Элементы.ВернутьНаДоработку.Видимость = Ложь;
		Элементы.ОтказатьВПоставленнойЗадаче.Видимость = Ложь;

	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьЭтап(Команда)
	ОбработатьБП("ОК");
	ОповеститьОбИзменении(ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ПустаяСсылка"));
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	ОбработатьБП("Возврат");// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьВПоставленнойЗадаче(Команда)
	ОбработатьБП("Отказ");// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьБП(РезультатВозврата)
	
	//-=-=
	Если Не РольДоступна("axm_ОтключитьКонтрольСоотвествияИсполнителейВСогласованиях")
		И глТекущийПользователь <> ЭтотОбъект.Задача.Пользователь Тогда
		Сообщить("На текущем этапе согласовывать должен " + ЭтотОбъект.Задача.Пользователь + "!");
		Возврат;
	КонецЕсли;
	//-=-=
	
	Если не ОбработатьЭтап(РезультатВозврата) тогда
		Возврат;
	КонецЕсли;
	
	Если КомментарийИсполнителя <> "" тогда
		НС = объект.КомментарииПроцесса.Добавить();
		НС.Автор = ТекущийИсполнитель;
		НС.Дата = ТекущаяДата();
		НС.Комментарий = КомментарийИсполнителя ;
		НС.Этап = ТекущаяТочка;
	КонецЕсли;
	
	НоваяЗапись = Объект.Подписи.Добавить();
	НоваяЗапись.Дата				= ТекущаяДата();
	НоваяЗапись.Этап			    = ТекущаяТочка;
	НоваяЗапись.Автор				= Пользователи.ТекущийПользователь();

	Записать();
	
	
	Если не Задача.Пустая() тогда
		ВыполнитьЗадачу(Задача);
	Иначе
		Стартовать();
	КонецЕсли;
	ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.ЗадачаИсполнителяПоСогласованиюПлатежей.ПустаяСсылка"));
	Закрыть();	
	  
КонецПроцедуры

Процедура Стартовать()
	БП = РеквизитФормыВЗначение("Объект");
	БП.Старт();
	ЗначениеВРеквизитФормы(БП,"Объект");
КонецПроцедуры

&НаКлиенте
Функция ОбработатьЭтап(РезультатВозврата)
	
	Если РезультатВозврата = "ОК" Тогда
		ЗначениеВозврата = Истина;
	ИначеЕсли РезультатВозврата = "Возврат" или РезультатВозврата = "Отказ" Тогда
		Если КомментарийИсполнителя = "" Тогда
			Предупреждение("Не указана причина в комментарии текущего исполнителя");
			ЗначениеВозврата = Ложь;
		Иначе
			ЗначениеВозврата = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатВозврата = "ОК" Тогда 
		ЗначениеПоля = "Разрешено";
	ИначеЕсли РезультатВозврата = "Возврат" Тогда
		ЗначениеПоля = "Возвращено";
	Иначе
		ЗначениеПоля = "Отказано";
	КонецЕсли;
		
	Если ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.СогласованиеСДиректоромФД")	Тогда
		Объект.ПроверкаДиректоромФДВыполнена = ЗначениеПоля;
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.СогласованиеСДиректоромКД")	Тогда
		Объект.ПроверкаДиректоромКДВыполнена = ЗначениеПоля;	
	ИначеЕсли ТекущаяТочка = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.ПроверкаВР") Тогда
		Объект.ПодписанПредседателем = ЗначениеПоля;
	КонецЕсли;	
	
	 Возврат ЗначениеВозврата;
	 
КонецФункции


&НаСервереБезКонтекста
Функция ВыполнитьЗадачу(Задача)
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПолучитьТекущееСостояниеБП();
	ПодготовитьФорму(ЭтаФорма);
	ОбновитьИсториюИзменений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь,
	|	ЦС_АдресацияБизнесПроцессов.Подразделение
	|ИЗ
	|	РегистрСведений.ЦС_АдресацияБизнесПроцессов КАК ЦС_АдресацияБизнесПроцессов
	|ГДЕ
	|	ЦС_АдресацияБизнесПроцессов.Пользователь = &глТекущийПользователь";
	
	Запрос.УстановитьПараметр("глТекущийПользователь", параметрысеанса.текущийпользователь);	
	
	ТолькоПросмотр								= истина;
	элементы.Группа1.Доступность				= Ложь;
	элементы.ФормаКоманднаяПанель.Доступность	= Ложь;	
	
	Если (Не ТекущийОбъект.стартован)
		Или параметрысеанса.текущийпользователь = Задача.Пользователь
		Или Запрос.Выполнить().Выгрузить().НайтиСтроки(Новый Структура("Пользователь, Подразделение", параметрысеанса.текущийпользователь, Задача.Подразделение)).Количество() <> 0
		Или РольДоступна("ПолныеПрава") тогда
		
		Если (НЕ ТекущийОбъект.Завершен) Тогда
			
			ТолькоПросмотр = ложь;
			элементы.Группа1.Доступность = Истина;
			элементы.ФормаКоманднаяПанель.Доступность = Истина;
		КонецЕсли;
		
	иначе
		Сообщить("Этап не предусматривает исполнение текущим пользователем. Форма заблокирована");
	КонецЕсли;
	
	//Если Параметры.Задача.Выполнена тогда
	//	ЭтаФорма.ТолькоПросмотр	= Истина;
	//	ЭтаФорма.Элементы.Группа1.Доступность = Ложь;
	//КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора(,ЭлементФормы,);

	//// Владельца менять по умолчанию не даем.
	//ФормаВыбора.ПараметрОтборПоВладельцу = Контрагент;

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	              	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Контрагент;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетКонтрагента =ФормаСчета.ОткрытьМодально();

КонецПроцедуры

&НаСервере
Процедура БанковскийСчетОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаСчета = Справочники.БанковскиеСчета.ПолучитьФормуВыбора(,Элемент);
	
	ФормаСчета.Отбор.Владелец.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Владелец.Значение      = объект.Организация;
	ФормаСчета.Отбор.Владелец.Использование = Истина;
	ФормаСчета.ЭлементыФормы.СправочникСписок.ИерархическийПросмотр = Ложь;
	
	ФормаСчета.Отбор.Источникфинансирования.ВидСравнения  = ВидСравнения.Равно;
	ФормаСчета.Отбор.Источникфинансирования.Использование = Истина;
	ФормаСчета.отбор.Источникфинансирования.Значение = Объект.источникфинансирования;
	
	Если не объект.ВалютаДокумента.Пустая() тогда
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Значение	= объект.ВалютаДокумента;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.Использование = Истина;
		ФормаСчета.Отбор.ВалютаДенежныхСредств.ВидСравнения  = ВидСравнения.Равно;
	КонецЕсли;    	
	
	ФормаСчета.РежимВыбора = Истина;
	объект.БанковскийСчетОрганизации = ФормаСчета.ОткрытьМодально();
	
// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РольДоступна("СкрытыеПапкиСогласованиеРеестров") Тогда
		ЭтаФорма.Элементы.ТипПлатежа.Видимость = Ложь;
		ЭтаФорма.Элементы.КурирующийЧП.Видимость = Ложь;
		ЭтаФорма.Элементы.ПроверкаДиректоромФДВыполнена.Видимость = Ложь;
		ЭтаФорма.Элементы.ПроверкаДиректоромКДВыполнена.Видимость = Ложь;
		ЭтаФорма.Элементы.ПодписанПредседателем.Видимость = Ложь;
		ЭтаФорма.Элементы.ДатаНачала.Видимость = Ложь;
		ЭтаФорма.Элементы.ДатаОкончания.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиВалюта.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиРасчетныйСчет.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКомментарийСогласующего.Видимость = Ложь;
		ЭтаФорма.Элементы.СтраницаКарта.Видимость = Ложь;
		ЭтаФорма.Элементы.Комментарии1.Видимость = Ложь;


	КонецЕсли;

	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
		
	Если Объект.РеестрСогласован = Истина И ТекущаяТочка <> ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.СозданиеПП") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
		Сообщить("Реестр согласован и не может быть изменен");
	КонецЕсли;
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиЦА Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ФинансированиеПредставительств Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиДоговор.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;

		ЭтаФорма.Элементы.ПлатежиКонтрагент.Заголовок = "Представительство";
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Истина;
	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиОбластей Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансированиеПредставительств.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
	    ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Истина;
	
	Иначе
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
	КонецЕсли;



КонецПроцедуры

&НаКлиенте
Процедура СписокФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокФайлов.ТекущаяСтрока;
	
	Если СокрЛП(ТекСтрока.Наименование) = "" Тогда
	 	СтандартнаяОбработка = Истина;
		Сообщить("Введите описание файла");
	Иначе
		СтандартнаяОбработка = Ложь;
		УниверсальныеМеханизмы.ОткрытьФайлы(Элементы.СписокФайлов.ТекущиеДанные, глТекущийПользователь, Элементы.СписокФайлов.ВыделенныеСтроки);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьФайла(ПолноеИмяФайла, Каталог)
	
	НовОбъектХранилища = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
	НовОбъектХранилища.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПолноеИмяФайла), Новый СжатиеДанных);
	НовОбъектХранилища.ИмяФайла = Сред(ПолноеИмяФайла, СтрДлина(Каталог) + 1);
	НовОбъектХранилища.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
	Если Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
	НовОбъектХранилища.Объект = Объект.Ссылка;
	НовОбъектХранилища.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Диалог = УниверсальныеМеханизмы.ПолучитьДиалогВыбораФайлов(Ложь);
		
	Если Не Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;

	Попытка  		
		СоздатьЗаписьФайла(Диалог.ПолноеИмяФайла, Диалог.Каталог); 		
		Элементы.СписокФайлов.Обновить();
	Исключение
		Сообщить("" + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СписокФайлов.Отбор.Элементы.Очистить();
	ЭлементОтбора = СписокФайлов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Платежи.Количество() <> 0 Тогда
		Ответ = Вопрос("Таблица не пуста. Перезаполнить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Платежи.Очистить();
		КонецЕсли;
	КонецЕсли;
    Таблица = Объект.Платежи;
	 
	ЗаполнитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиПредставительств Тогда

	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Контрагент,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.НазначениеПлатежа,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СуммаДокумента,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СчетОрганизации,
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Представительство
			|ИЗ
			|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
			|ГДЕ
			|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СогласованоБП = ИСТИНА
			|	И НЕ ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ПометкаУдаления
			|	И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.УтверженоК = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			Сообщить("На заданный период не обнаружены документы");
			Возврат;
		КонецЕсли;	
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
		   Строка = Объект.Платежи.Добавить();
					
				Строка.Поручение 			= Выборка.Ссылка;
				Строка.Представительство    = Выборка.Представительство;
				Строка.РасчетныйСчет        = Выборка.СчетОрганизации;
				Строка.Договор 			    = Выборка.ДоговорКонтрагента;
				Строка.Контрагент 		    = Выборка.Контрагент;
				Строка.СуммаПлатежа   	    = Выборка.СуммаДокумента;
				Строка.НазначениеПлатежа    = Выборка.НазначениеПлатежа;
				Строка.Валюта      		    = Выборка.ВалютаДокумента;
				Строка.Представительство    = Выборка.Представительство;
			КонецЦикла;
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СуммаПоЗаявке,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Примечание,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.Организация,
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Контрагент
				|ИЗ
				|	Документ.б_ЗаявкаНаФинансирование.РасчетнаяТаблица КАК б_ЗаявкаНаФинансированиеРасчетнаяТаблица
				|ГДЕ
				|	б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
				|	И НЕ б_ЗаявкаНаФинансированиеРасчетнаяТаблица.Ссылка.ПометкаУдаления
				|	И б_ЗаявкаНаФинансированиеРасчетнаяТаблица.СуммаПоЗаявке <> 0";
			
			Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда 
				Сообщить("На заданный период не обнаружены документы");
				Возврат;
			КонецЕсли;	
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Организация.Значение = Выборка.Организация;
				НаборЗаписей.Отбор.Организация.Использование = Истина;
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					КонтрагентОрганизации = НаборЗаписей[0].Контрагент;
				Иначе
					КонтрагентОрганизации = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;

			   Строка = Объект.Платежи.Добавить();
						
				Строка.Контрагент		    = КонтрагентОрганизации;
				Строка.КонтрагентПолучатель = Выборка.Контрагент;
				Строка.СуммаПлатежа   	    = Выборка.СуммаПоЗаявке;
				Строка.НазначениеПлатежа    = Выборка.Примечание;
				Строка.Валюта      		    = Справочники.Валюты.НайтиПоКоду("398");
				Строка.ЗаявкаФилиалы        = Выборка.Ссылка;

			КонецЦикла;
				
		КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦАНаСервере()
	
	Объект.Платежи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации КАК СчетОрганизации,
		|	СогласованиеПлатежейРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейРасчетнаяТаблица.Договор,
		|	СогласованиеПлатежейРасчетнаяТаблица.СуммаПоЗаявке,
		|	СогласованиеПлатежейРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейРасчетнаяТаблица.ВалютаДокумента
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежей.РасчетнаяТаблица КАК СогласованиеПлатежейРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеКурирующимЧП = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("На заданный период не обнаружены документы");
		Возврат;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	   Строка = Объект.Платежи.Добавить();
	   
		    Строка.ЗаявкаНаФинансирование = Выборка.Ссылка;
			Строка.РасчетныйСчет        = Выборка.СчетОрганизации;
			Строка.Договор 			    = Выборка.Договор;
			Строка.Контрагент 		    = Выборка.Контрагент;
			Строка.СуммаПлатежа   	    = Выборка.СуммаПоЗаявке;
			Строка.НазначениеПлатежа    = Выборка.Примечание;
			Строка.Валюта      		    = Выборка.ВалютаДокумента;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦА(Команда)
	ЗаполнитьЦАНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипПлатежаПриИзменении(Элемент)
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиЦА Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Ложь;

	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ФинансированиеПредставительств Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиДоговор.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;

		ЭтаФорма.Элементы.ПлатежиКонтрагент.Заголовок = "Представительство";
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Ложь;
	ИначеЕсли Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиОбластей Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансированиеПредставительств.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиКонтрагентПолучатель.Видимость = Ложь;
	    ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаФилиалы.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьОП.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПлатежиРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.Организация));
		
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлы(Команда)
		
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФ = Новый Структура;
	Заголовок = НСтр("ru = 'Присоединенные файлы'");
	ПараметрыФ.Вставить("ЗаголовокФормы", Заголовок);
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиОбластей Тогда
		ПараметрыФ.Вставить("ВладелецФайла", ТекСтрока.ЗаявкаНаФинансированиеПредставительств);

		ОткрытьФорму(
		"Справочник.Файлы.Форма.ФормаСпискаПрисоединенныхФайлов", 
		ПараметрыФ,
		ТекСтрока.ЗаявкаНаФинансированиеПредставительств, 
		ТекСтрока.ЗаявкаНаФинансированиеПредставительств, 
		);

	Иначе
		ПараметрыФ.Вставить("ВладелецФайла", ТекСтрока.ЗаявкаНаФинансирование);

		ОткрытьФорму(
			"Справочник.Файлы.Форма.ФормаСпискаПрисоединенныхФайлов", 
			ПараметрыФ,
			ТекСтрока.ЗаявкаНаФинансирование, 
			ТекСтрока.ЗаявкаНаФинансирование, 
			);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОПНаСервере()
	
	Объект.Платежи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации КАК СчетОрганизации,
		|	СогласованиеПлатежейРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейРасчетнаяТаблица.Договор,
		|	СогласованиеПлатежейРасчетнаяТаблица.СуммаПоЗаявке,
		|	СогласованиеПлатежейРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейРасчетнаяТаблица.ВалютаДокумента
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежейПредставительств.РасчетнаяТаблица КАК СогласованиеПлатежейРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеКурирующимЧП = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.РасчетнаяДатаПлатежа МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("На заданный период не обнаружены документы");
		Возврат;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	   Строка = Объект.Платежи.Добавить();
	   
		    Строка.ЗаявкаНаФинансированиеПредставительств = Выборка.Ссылка;
			Строка.РасчетныйСчет        = Выборка.СчетОрганизации;
			Строка.Договор 			    = Выборка.Договор;
			Строка.Контрагент 		    = Выборка.Контрагент;
			Строка.СуммаПлатежа   	    = Выборка.СуммаПоЗаявке;
			Строка.НазначениеПлатежа    = Выборка.Примечание;
			Строка.Валюта      		    = Выборка.ВалютаДокумента;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОП(Команда)
	ЗаполнитьОПНаСервере();
КонецПроцедуры








