Функция ДоступенАнализОтклонений(Отчет) Экспорт
	Если Отчет.ДанныеДляАнализа.Количество()<>2 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Отчет.ДанныеДляАнализа[0].НачалоПериода<>Отчет.ДанныеДляАнализа[1].НачалоПериода Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Отчет.ДанныеДляАнализа[0].ОкончаниеПериода<>Отчет.ДанныеДляАнализа[1].ОкончаниеПериода Тогда
		Возврат Ложь;
	КонецЕсли;
	ЕстьПлан = Ложь;
	ЕстьФакт = Ложь;
	Для Каждого СтрокаДанных Из Отчет.ДанныеДляАнализа Цикл
		Если ЗначениеЗаполнено(СтрокаДанных.ДанныеДляСравнения) Тогда
			Если ТипЗнч(СтрокаДанных.ДанныеДляСравнения)=фин_ОбщегоНазначенияВызовСервераПовтИсп.ТипСправочникСценариевПланирования() Тогда
				ЕстьПлан = Истина;
			ИначеЕсли СтрокаДанных.ДанныеДляСравнения = Перечисления.фин_ВидыДанныхОтчета.Фактические Тогда
				ЕстьФакт = Истина;
			КонецЕсли;
		Иначе
			ЕстьФакт = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьФакт = Ложь ИЛИ ЕстьПлан = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции