
#Если Клиент ИЛИ ВнешнееСоединение Тогда

#КонецЕсли


#Если Клиент Тогда
	
Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();	
	//ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	//// выводим шапку
	Организация 	= ТиповыеОтчеты.ПолучитьПараметр(ЭтотОбъект.КомпоновщикНастроек, "Организация");
	
	Если Организация = Неопределено Тогда 
		Предупреждение("Данный отчет предназначен для вызова из регламентированного отчета",,"Отчет не сформирован");
		Возврат;
	КонецЕсли;
			
	НачалоПериода 	= ТиповыеОтчеты.ПолучитьПараметр(ЭтотОбъект.КомпоновщикНастроек, "НачалоПериода");
	КонецПериода	= ТиповыеОтчеты.ПолучитьПараметр(ЭтотОбъект.КомпоновщикНастроек, "КонецПериода"); 
	СведенияОНалогоплательщике = ОбщегоНазначения.СведенияОЮрФизЛице(Организация.Значение, КонецПериода.Значение);
	Макет = ПолучитьОбщийМакет("ЗаголовокРегистраНалоговогоУчета");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок")).Значение;
			
	ОбластьЗаголовок.Параметры.Заполнить(СведенияОНалогоплательщике);
	ОбластьЗаголовок.Параметры.НалоговыйПериод = ОбщегоНазначения.ПолучитьПредставлениеПериода(НачалоДня(НачалоПериода.Значение), КонецДня(КонецПериода.Значение));
	Результат.Вывести(ОбластьЗаголовок);
	
	//// сохраним признак РасширеннойНастройки
	СохраненныйПризнакРасширеннойНастройки = ЭтотОбъект.РасширеннаяНастройка;
	ЭтотОбъект.РасширеннаяНастройка = Ложь; // выставляем в ЛОЖЬ, чтобы зафиксировать шапку таблицы при выводе
	
	ТиповыеОтчеты.ВывестиТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	//// выводим подвал
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОтветЛица = ОбщегоНазначения.ОтветственныеЛицаОрганизаций(Организация.Значение, КонецПериода.Значение, глЗначениеПеременной("глТекущийПользователь").Физлицо);
	ОбластьПодвал.Параметры.ФИОРуководителя = ОтветЛица.Руководитель;
	ОбластьПодвал.Параметры.ФИОглБухгалтера = ОтветЛица.ГлавныйБухгалтер;
	ОбластьПодвал.Параметры.ФИОИсполнителя 	= ОтветЛица.ОтветственныйЗаРегистры;
	ОбластьПодвал.Параметры.ДатаСоставления = Формат(ОбщегоНазначения.ПолучитьРабочуюДату(), "ДФ=""дд ММММ гггг 'г.'""");
	
	Результат.Вывести(ОбластьПодвал);
		
	Возврат;
	
КонецПроцедуры

Процедура Инициализации(ИмяЯчейки, ИмяМакета = Неопределено)Экспорт
	
	Если ИмяМакета = Неопределено Тогда 
		Если (Найти(ИмяЯчейки , "s_100_08_001_") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_002") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_002_") > 0) Тогда	
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_01");
		ИначеЕсли (Найти(ИмяЯчейки , "Ф100_08_03A_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03B_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03D_B__") > 0) Тогда	
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003ABD");
		ИначеЕсли ИмяЯчейки = "s_100_08_003_a" или ИмяЯчейки = "s_100_08_003_b" или ИмяЯчейки = "s_100_08_003_d" Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003ABD");		
		ИначеЕсли (Найти(ИмяЯчейки , "Ф100_08_03C_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03E_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03F_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03I_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03K_B__") > 0)ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03L_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03M_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03N_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03O_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф100_08_03P_B__") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003CEFIKLMNOP");
		ИначеЕсли (Найти(ИмяЯчейки , "s_100_08_003_c") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_e") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_f") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_g") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_i") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_j") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_k") > 0)ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_l") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_m") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_n") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_o") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_p") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003CEFIKLMNOP");
		ИначеЕсли (Найти(ИмяЯчейки , "Ф100_08_03H_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_h") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003_H");	
		ИначеЕсли (Найти(ИмяЯчейки , "Ф100_08_03Q_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_q") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_003_r") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003CEFIKLMNOP");
		ИначеЕсли (Найти(ИмяЯчейки , "Ф100_08_05C_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_005_c") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_005_C");
		ИначеЕсли (Найти(ИмяЯчейки , "s_100_08_001_") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_002_") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");	
		ИначеЕсли (Найти(ИмяЯчейки , "s_100_08_004_") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		ИначеЕсли (Найти(ИмяЯчейки , "s_100_08_005_a") > 0) ИЛИ  (Найти(ИмяЯчейки , "s_100_08_005_b") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_005_c") > 0) ИЛИ (Найти(ИмяЯчейки , "s_100_08_006") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		ИначеЕсли (Найти(ИмяЯчейки , "s_100_08_007") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		ИначеЕсли (Найти(ИмяЯчейки , "s_100_08_009") > 0) ИЛИ  (Найти(ИмяЯчейки , "s_100_08_010") > 0) ИЛИ  (Найти(ИмяЯчейки , "s_100_08_011") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		КонецЕсли;
		
		Если (Найти(ИмяЯчейки , "Ф220_11_03A_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03B_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03D_B__") > 0) Тогда	
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003ABD");
		ИначеЕсли ИмяЯчейки = "s_220_11_003_a" или ИмяЯчейки = "s_220_11_003_b" или ИмяЯчейки = "s_220_11_003_d" Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003ABD");		
		ИначеЕсли (Найти(ИмяЯчейки , "Ф220_11_03C_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03E_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03F_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03I_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03K_B__") > 0)ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03L_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03M_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03N_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03O_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "Ф220_11_03P_B__") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003CEFIKLMNOP");
		ИначеЕсли (Найти(ИмяЯчейки , "s_220_11_003_c") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_e") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_f") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_g") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_i") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_j") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_k") > 0)ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_l") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_m") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_n") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_o") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_p") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003CEFIKLMNOP");
		ИначеЕсли (Найти(ИмяЯчейки , "Ф220_11_03H_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_h") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003_H");	
		ИначеЕсли (Найти(ИмяЯчейки , "Ф220_11_03Q_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_q") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_003_r") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_003CEFIKLMNOP");
		ИначеЕсли (Найти(ИмяЯчейки , "Ф220_11_05C_B__") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_005_c") > 0) Тогда
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08_005_C");
		ИначеЕсли (Найти(ИмяЯчейки , "s_220_11_001_") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_002_") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");	
		ИначеЕсли (Найти(ИмяЯчейки , "s_220_11_004_") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		ИначеЕсли (Найти(ИмяЯчейки , "s_220_11_005_a") > 0) ИЛИ  (Найти(ИмяЯчейки , "s_220_11_005_b") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_005_c") > 0) ИЛИ (Найти(ИмяЯчейки , "s_220_11_006") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		ИначеЕсли (Найти(ИмяЯчейки , "s_220_11_006") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		ИначеЕсли (Найти(ИмяЯчейки , "s_220_11_008") > 0) ИЛИ  (Найти(ИмяЯчейки , "s_220_11_009") > 0) ИЛИ  (Найти(ИмяЯчейки , "s_220_11_010") > 0) Тогда 
			СхемаКомпоновкиДанных = ПолучитьМакет("Расшифровка100_08");
		КонецЕсли;
	Иначе 
		СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	КонецЕсли;
	
	
		
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	Расшифровки = Новый СписокЗначений;
    НастройкаПериода = Новый НастройкаПериода;

КонецПроцедуры


#КонецЕсли