////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	
	// Проверим Заполнение обязательных реквизитов 
	//	"Группа ТМЗ"
	Если НЕ ЗначениеЗаполнено(ГруппаТМЗ) Тогда
		Сообщить("Не указана группа номенклатуры.", СтатусСообщения.Важное);
		
		
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры

