
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ВидОперации(ПараметрКоманды)<>ПредопределенноеЗначение("Перечисление.фин_ВидыОперацийБюджет.Бюджет") Тогда
		ПоказатьПредупреждение(,"Невозможно создать расчет из документа с указанным видом операции!");
		Возврат;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораСценария",ЭтотОбъект,ПараметрКоманды);
	ОткрытьФорму("Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"СценарииПланирования.ФормаВыбора", , , ПараметрыВыполненияКоманды.Уникальность, ?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,ПараметрыВыполненияКоманды.Окно),,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСценария(Сценарий, Бюджет) Экспорт
	Если Сценарий=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Сценарий=Сценарий(Бюджет) Тогда
		ПоказатьПредупреждение(,"Результирующий сценарий не может совпадать с исходным!");
		Возврат;
	КонецЕсли;
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Основание",Новый Структура("РасчетСценария,Сценарий,Бюджет",Истина,Сценарий,Бюджет));
	ОткрытьФорму("Документ.фин_Бюджет.ФормаОбъекта", ПараметрыФормы, , Новый УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры

&НаСервере
Функция Сценарий(Документ)
	Возврат Документ.Сценарий;
КонецФункции

&НаСервере
Функция ВидОперации(Документ)
	Возврат Документ.ВидОперации;
КонецФункции
