Перем мСписокОткрытыхОбъектов Экспорт;

// Процедура добавляет открываемый объект в список
//
Процедура ДобавитьОбъектВСписокОткрытых(ОткрываемыйОбъект) Экспорт
	
	Если мСписокОткрытыхОбъектов.НайтиПоЗначению(ОткрываемыйОбъект) = Неопределено Тогда
		мСписокОткрытыхОбъектов.Добавить(ОткрываемыйОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Процедура закрывает все открытые из формы объекты
//
Процедура ЗакрытьОткрытыеИзОбработкиОбъекты() Экспорт
	
	Для Каждого ЭлементСписка Из мСписокОткрытыхОбъектов Цикл
		
		Попытка
			
			ОткрытыйОбъект = ЭлементСписка.Значение;
			ФормаОткрытогоОбъекта = ОткрытыйОбъект.ПолучитьФорму("ФормаДокумента");
			
			Если ФормаОткрытогоОбъекта.Открыта() Тогда
				ФормаОткрытогоОбъекта.Модифицированность = Ложь;
				ФормаОткрытогоОбъекта.Закрыть();
			КонецЕсли; 
				
		Исключение
				
			Сообщить("Форма объекта: " + СокрЛП(ОткрытыйОбъект) + " не может быть закрыта!");
			Сообщить(ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

мСписокОткрытыхОбъектов = Новый	СписокЗначений();