////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.ФормаДокументдог_РегистрацияДоговоровСоздатьНаОсновании.Заголовок = "Дополнительное соглашение (Регистрация договора)";
	
	фин_ПроцедрыРаботыСОбъектамиПереопределяемый.СписокПриСозданииНаСервере(ЭтаФорма);
	
	фин_ОбщегоНазначенияСервер.УстановитьОтборПоОсновнойОрганизации(ЭтотОбъект);

	фин_ОбщегоНазначенияСервер.УстановитьОтборПоОсновнойОрганизации(ЭтотОбъект);
 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	фин_ПроцедурыРаботыСОбъектамиКлиентПереопределяемый.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура ПроизвестиРасчетПлатежей(Команда)
	Если Элементы.Список.ТекущиеДанные=Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан регистрация/доп. соглашение!'"));
		Возврат;
	КонецЕсли;
	Объект = Элементы.Список.ТекущиеДанные.Ссылка;
	ВходящееОбязательство = Ложь;
	ПараметрыРасчета = ПолучитьПараметрыРасчета(ВходящееОбязательство,Объект);
	ОткрытьФорму("Обработка."+?(ВходящееОбязательство,"ден_ФормированиеПланируемыхПоступленийДенежныхСредств","ден_ФормированиеЗаявокНаРасходованиеСредствПоДоговорам")+".Форма.Форма",ПараметрыРасчета,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиЗадолженности(Команда)
	Если Элементы.Список.ТекущиеДанные=Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан регистрация/доп. соглашение!'"));
		Возврат;
	КонецЕсли;
	Объект = Элементы.Список.ТекущиеДанные.Ссылка;
	ПараметрыРасчета = ПолучитьПараметрыРасчета(Истина,Объект);
	ОткрытьФорму("Отчет.дог_ОстаткиЗадолженностиБУПоДоговору.ФормаОбъекта",ПараметрыРасчета,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура АнализЗадолженности(Команда)
	Если Элементы.Список.ТекущиеДанные=Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан регистрация/доп. соглашение!'"));
		Возврат;
	КонецЕсли;
	Объект = Элементы.Список.ТекущиеДанные.Ссылка;
	ПараметрыРасчета = ПолучитьПараметрыРасчета(Истина,Объект);
	ОткрытьФорму("Отчет.дог_АнализЗадолженностиБУПоДоговору.ФормаОбъекта",ПараметрыРасчета,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура АнализЗадолженностиПоПериодам(Команда)
	Если Элементы.Список.ТекущиеДанные=Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан регистрация/доп. соглашение!'"));
		Возврат;
	КонецЕсли;
	Объект = Элементы.Список.ТекущиеДанные.Ссылка;
	ПараметрыРасчета = ПолучитьПараметрыРасчета(Истина,Объект);
	ОткрытьФорму("Отчет.дог_АнализЗадолженностиБУПоДоговоруВРазрезеПериодов.ФормаОбъекта",ПараметрыРасчета,ЭтаФорма,УникальныйИдентификатор);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
 
	фин_ОбщегоНазначенияСервер.ВосстановитьОтборСписка(Список, Настройки, "Организация");
 
КонецПроцедуры






&НаСервере
Функция ПолучитьПараметрыРасчета(ВходящееОбязательство, Объект)
	Если Объект.ВидОперацииПоДоговору = ПредопределенноеЗначение("Перечисление.дог_ВидыОперацийПоДоговору.ТоварныеОперации") Тогда
		ВходящееОбязательство = (Объект.ВидДоговораПоТоварнымОперациям = ПредопределенноеЗначение("Перечисление.дог_ВидыДоговоровПоТоварнымОперациям.ДоговорРеализации"));
	Иначе	
		ВходящееОбязательство = (Объект.ВидОбязательства = ПредопределенноеЗначение("Перечисление.дог_ВидыОбязательствПоДоговору.Входящее"));
	КонецЕсли;
	Возврат Новый Структура("Организация,Контрагент,Договор,ДоговорКонтрагента,НеВосстанавливатьНастройки",Объект.Организация,Объект.Контрагент,Объект.ДоговорКонтрагента,Объект.ДоговорКонтрагента,Истина);	
КонецФункции



&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущиеДанные=Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан регистрация/доп. соглашение!'"));
		Возврат;
	КонецЕсли;
	ДокументСсылка = Элементы.Список.ТекущиеДанные.Ссылка;
	Объект = СтруктураДанныхДокумента(ДокументСсылка);
	ДоступныТоварныеОперации = Ложь;
	ИсходящееОбязательство = Истина;
	Если Объект.ВидОперацииПоДоговору = ПредопределенноеЗначение("Перечисление.дог_ВидыОперацийПоДоговору.ТоварныеОперации") Тогда
		ДоступныТоварныеОперации = Истина;
		Если Объект.ВидДоговораПоТоварнымОперациям = ПредопределенноеЗначение("Перечисление.дог_ВидыДоговоровПоТоварнымОперациям.ДоговорРеализации") Тогда
			ИсходящееОбязательство = Ложь;
		КонецЕсли;
	ИначеЕсли Объект.ВидОбязательства = ПредопределенноеЗначение("Перечисление.дог_ВидыОбязательствПоДоговору.Входящее") Тогда
		ИсходящееОбязательство = Ложь;
	КонецЕсли;
	МассивСоздаваемыхДокументов = Новый Массив;
	МассивСоздаваемыхДокументов.Добавить("РеализацияУслугПоПереработке");
	МассивСоздаваемыхДокументов.Добавить("ПоступлениеИзПереработки");
	МассивСоздаваемыхДокументов.Добавить("АктОбОказанииПроизводственныхУслуг");
	МассивСоздаваемыхДокументов.Добавить("ПоступлениеТоваровУслуг");
	МассивСоздаваемыхДокументов.Добавить("ПередачаНМА");
	МассивСоздаваемыхДокументов.Добавить("ПередачаОС");
	МассивСоздаваемыхДокументов.Добавить("РеализацияТоваровУслуг");
	МассивСоздаваемыхДокументов.Добавить("СчетНаОплатуПокупателю");
	МассивСоздаваемыхДокументов.Добавить("узп_ЗаказПокупателя");
	МассивСоздаваемыхДокументов.Добавить("ПоступлениеНМА");
	МассивСоздаваемыхДокументов.Добавить("Доверенность");
	МассивСоздаваемыхДокументов.Добавить("узп_ЗаказПоставщику");
	Для Каждого Вводимый Из МассивСоздаваемыхДокументов Цикл
		Если КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Найти("ФормаДокумент"+Вводимый+"СоздатьНаОсновании")<>Неопределено Тогда
			КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы["ФормаДокумент"+Вводимый+"СоздатьНаОсновании"].Доступность 				= Ложь;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ДоступныТоварныеОперации Тогда
		
	ИначеЕсли ИсходящееОбязательство Тогда
		МассивСоздаваемыхДокументов = Новый Массив;
		МассивСоздаваемыхДокументов.Добавить("ПоступлениеИзПереработки");
		МассивСоздаваемыхДокументов.Добавить("ПоступлениеТоваровУслуг");
		МассивСоздаваемыхДокументов.Добавить("ПоступлениеНМА");
		МассивСоздаваемыхДокументов.Добавить("Доверенность");
		МассивСоздаваемыхДокументов.Добавить("узп_ЗаказПоставщику");
		Для Каждого Вводимый Из МассивСоздаваемыхДокументов Цикл
			Если КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Найти("ФормаДокумент"+Вводимый+"СоздатьНаОсновании")<>Неопределено Тогда
				КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы["ФормаДокумент"+Вводимый+"СоздатьНаОсновании"].Доступность 				= Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивСоздаваемыхДокументов = Новый Массив;
		МассивСоздаваемыхДокументов.Добавить("РеализацияУслугПоПереработке");
		МассивСоздаваемыхДокументов.Добавить("АктОбОказанииПроизводственныхУслуг");
		МассивСоздаваемыхДокументов.Добавить("ПередачаНМА");
		МассивСоздаваемыхДокументов.Добавить("ПередачаОС");
		МассивСоздаваемыхДокументов.Добавить("РеализацияТоваровУслуг");
		МассивСоздаваемыхДокументов.Добавить("СчетНаОплатуПокупателю");
		МассивСоздаваемыхДокументов.Добавить("узп_ЗаказПокупателя");
		Для Каждого Вводимый Из МассивСоздаваемыхДокументов Цикл
			Если КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы.Найти("ФормаДокумент"+Вводимый+"СоздатьНаОсновании")<>Неопределено Тогда
				КоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздатьНаОсновании.ПодчиненныеЭлементы["ФормаДокумент"+Вводимый+"СоздатьНаОсновании"].Доступность 				= Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция СтруктураДанныхДокумента(Документ)
	Возврат усд_УправлениеСогласованиемДокументов.СоздатьСтруктуруПоДаннымДокумента(Документ);	
КонецФункции