
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ИсходноеЗначение",ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.фин_НастройкаСоответствийДляИзмеренийБюджетирования.Форма.ФормаНастройкиСоответствийПроектам", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
