////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция формирует запрос по показателям формул
//
// Возвращаемое значение:
//  РезультатЗапроса
//  
Функция СформироватьЗапросПоПоказателям() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	гз_ФормулыРасчетаКазахстанскогоСодержанияТребуемыеПоказатели.Ссылка
	|ИЗ
	|	Справочник.гз_ФормулыРасчетаКазахстанскогоСодержания.ТребуемыеПоказатели КАК гз_ФормулыРасчетаКазахстанскогоСодержанияТребуемыеПоказатели
	|ГДЕ
	|	гз_ФормулыРасчетаКазахстанскогоСодержанияТребуемыеПоказатели.Показатель = &Показатель";
	Запрос.УстановитьПараметр("Показатель",Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоПоказателям()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта
//
Процедура ПередЗаписью(Отказ)
	КодПоказателя = СокрЛП(КодПоказателя);
	Если КодПоказателя <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	гз_ПоказателиФормул.Ссылка
		|ИЗ
		|	Справочник.гз_ПоказателиФормул КАК гз_ПоказателиФормул
		|ГДЕ
		|	гз_ПоказателиФормул.Ссылка <> &Ссылка
		|	И гз_ПоказателиФормул.КодПоказателя = &КодПоказателя";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("КодПоказателя",КодПоказателя);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			Сообщить("Не удалось записать показатель """+Ссылка+""", так как условное обозначение показателя совпадает с другими показателями!",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры //ПередЗаписью()
