
Процедура бит_ур_УчетДвиженийЗернаПоРеализацииТМЗОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Добавлено Бит Макеев (
	
	Движения = Источник.Движения;
	Движения.ур_ДвиженияЗерна.Записывать = Истина;
	//+ Стрелюк 18/04/2022 Движения ЗерноНаСкладах Для реализации
	Движения.ур_ЗерноНаСкладах.Записывать = Истина;
	//- Стрелюк 18/04/2022 Движения ЗерноНаСкладах Для реализации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ур_ПеремещениеЗернаТовары.Номенклатура
	               |ПОМЕСТИТЬ НоменклатураЗерна
	               |ИЗ
	               |	Документ.ур_ПеремещениеЗерна.Товары КАК ур_ПеремещениеЗернаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ур_ПеремещениеЗернаТовары.Номенклатура
	               |;
	               |
	               |///////////////////////////+ Стрелюк 25/04/2022 Движения ЗерноНаСкладах Для реализации
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Дата КАК Период,
	               |	РеализацияТоваровУслуг.Организация,
	               |	РеализацияТоваровУслуг.Склад,
	               |	РеализацияТоваровУслуг.ТипОперации,
	               |	РеализацияТоваровУслуг.Контрагент,
	               |	РеализацияТоваровУслуг.ДоговорКонтрагента,
	               |	ЗНАЧЕНИЕ(Перечисление.ур_РегламентныеОперацииДвиженияЗерна.Расход) КАК РегламентныйВидОперации,
	               |	РеализацияТоваровУслугТовары.Количество КАК ЗачтенныйВес,
	               |	ВложенныйЗапрос.ВидРесурса,
	               |	РеализацияТоваровУслугТовары.Сумма КАК Стоимость,
	               |	РеализацияТоваровУслугТовары.СчетУчетаБУ КАК Счет,
	               |	СпрНоменклатура.Класс,
	               |	СпрНоменклатура.ГодУрожая,
	               |	СпрНоменклатура.ВидКультуры КАК Культура,
	               |	ЕСТЬNULL(НоменклатураЗерна.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура1
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ур_СоответствиеСчетовУчетаРесурсов.СчетУчета КАК СчетУчета,
	               |				ур_СоответствиеСчетовУчетаРесурсов.ВидРесурса КАК ВидРесурса
	               |			ИЗ
	               |				РегистрСведений.ур_СоответствиеСчетовУчетаРесурсов КАК ур_СоответствиеСчетовУчетаРесурсов
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ур_СоответствиеСчетовУчетаРесурсов.СчетУчета,
	               |				ур_СоответствиеСчетовУчетаРесурсов.ВидРесурса) КАК ВложенныйЗапрос
	               |			ПО РеализацияТоваровУслугТовары.СчетУчетаБУ = ВложенныйЗапрос.СчетУчета
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |			ПО РеализацияТоваровУслугТовары.Номенклатура = СпрНоменклатура.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЗерна КАК НоменклатураЗерна
	               |			ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураЗерна.Номенклатура
	               |		ПО (РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка)
	               |ГДЕ
	               |	РеализацияТоваровУслуг.Ссылка = &Ссылка
	               |	И РеализацияТоваровУслугТовары.Номенклатура.Зерно";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ур_ДвиженияЗерна.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//+ Стрелюк 25/04/2022 Движения ЗерноНаСкладах Для реализации
		//Если ЗначениеЗаполнено(Выборка.Номенклатура1) И НЕ Выборка.Номенклатура1 = NULL Тогда
			Движение = Движения.ур_ЗерноНаСкладах.ДобавитьРасход();
			Движение.ВидДвиженияЗерна 	= Справочники.ур_ВидыДвиженияЗерна.НайтиПоНаименованию("Внутриреспубликанское перемещение");
			Движение.ТипОперации 		= Справочники.ТипыОпераций.ЗерноВПути;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//КонецЕсли;
		//- Стрелюк 18/04/2022 Движения ЗерноНаСкладах Для реализации	
	КонецЦикла;
	
	
	
	// )
КонецПроцедуры

Процедура бит_ур_УчетДвиженийЗернаПоступлениеТМЗОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Добавлено Бит Макеев (
	
	Движения = Источник.Движения;
	Движения.ур_ДвиженияЗерна.Записывать = Истина;
	//+ Стрелюк 20/02/22 Движение ЗерноНаСкладах для док ПоступлениеТоваровУслуг 
	Движения.ур_ЗерноНаСкладах.Записывать = Истина;
	//- Стрелюк 20/02/22 Движение ЗерноНаСкладах для док ПоступлениеТоваровУслуг 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ур_ПеремещениеЗернаТовары.Номенклатура
	               |ПОМЕСТИТЬ НоменклатураЗерна
	               |ИЗ
	               |	Документ.ур_ПеремещениеЗерна.Товары КАК ур_ПеремещениеЗернаТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ур_ПеремещениеЗернаТовары.Номенклатура
	               |;
	               |
	               |//////////////////////////////+ Стрелюк 25/02/22 Движение ЗерноНаСкладах для док ПоступлениеТоваровУслуг
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Дата КАК Период,
	               |	ПоступлениеТоваровУслуг.Организация,
	               |	ПоступлениеТоваровУслуг.Склад,
	               |	ПоступлениеТоваровУслуг.ТипОперации,
	               |	ПоступлениеТоваровУслуг.Контрагент,
	               |	ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |	ЗНАЧЕНИЕ(Перечисление.ур_РегламентныеОперацииДвиженияЗерна.Приход) КАК РегламентныйВидОперации,
	               |	ПоступлениеТоваровУслугТовары.Количество КАК ЗачтенныйВес,
	               |	ВложенныйЗапрос.ВидРесурса,
	               |	ПоступлениеТоваровУслугТовары.Сумма КАК Стоимость,
	               |	ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК Счет,
	               |	СпрНоменклатура.Класс,
	               |	СпрНоменклатура.ГодУрожая,
	               |	СпрНоменклатура.ВидКультуры КАК Культура,
	               |	ЕСТЬNULL(НоменклатураЗерна.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура1
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ур_СоответствиеСчетовУчетаРесурсов.СчетУчета КАК СчетУчета,
	               |				ур_СоответствиеСчетовУчетаРесурсов.ВидРесурса КАК ВидРесурса
	               |			ИЗ
	               |				РегистрСведений.ур_СоответствиеСчетовУчетаРесурсов КАК ур_СоответствиеСчетовУчетаРесурсов
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ур_СоответствиеСчетовУчетаРесурсов.СчетУчета,
	               |				ур_СоответствиеСчетовУчетаРесурсов.ВидРесурса) КАК ВложенныйЗапрос
	               |			ПО ПоступлениеТоваровУслугТовары.СчетУчетаБУ = ВложенныйЗапрос.СчетУчета
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |			ПО ПоступлениеТоваровУслугТовары.Номенклатура = СпрНоменклатура.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураЗерна КАК НоменклатураЗерна
	               |			ПО ПоступлениеТоваровУслугТовары.Номенклатура = НоменклатураЗерна.Номенклатура
	               |		ПО (ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслуг.Ссылка)
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Ссылка = &Ссылка
	               |	И ПоступлениеТоваровУслугТовары.Номенклатура.Зерно";
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ур_ДвиженияЗерна.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		//+ Стрелюк 25/02/22 Движение ЗерноНаСкладах для док ПоступлениеТоваровУслуг
		//Если ЗначениеЗаполнено(Выборка.Номенклатура1) И НЕ Выборка.Номенклатура1 = Null Тогда
			Движение = Движения.ур_ЗерноНаСкладах.ДобавитьПриход();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.ВидДвиженияЗерна = Справочники.ур_ВидыДвиженияЗерна.НайтиПоНаименованию("Госзакуп");
		//КонецЕсли;
		//- Стрелюк 20/02/22 Движение ЗерноНаСкладах для док ПоступлениеТоваровУслуг
	КонецЦикла;
	
	// )
КонецПроцедуры
