#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура ОбработкаПроведения
// 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	фин_ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	ПараметрыПроведения = Документы.фин_ВнутреннееПеремещениеСредствПриБюджетировании.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	фин_ПроцедурыУчетаПоУправленческомуПлануСчетовСервер.ДвиженияПоВнутреннемуПеремещениюСредств(ПараметрыПроведения.Реквизиты[0],Движения, ПараметрыПроведения.ТаблицаПроводкиПоДаннымДокумента,ПараметрыПроведения.ТаблицаПараметрыИсточника,ПараметрыПроведения.ТаблицаПараметрыПриемника, Отказ);
	
КонецПроцедуры //ОбработкаПроведения

// Процедура ПередЗаписью
// 
Процедура ПередЗаписью(Отказ,РежимЗаписи,РежимПроведения)
    
    Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (НоменклатураИсточник=Неопределено) И НоменклатураИсточник.Пустая() Тогда
		НоменклатураИсточник=Неопределено;
	КонецЕсли;
	
	Если НЕ (НоменклатураПриемник=Неопределено) И НоменклатураПриемник.Пустая() Тогда
		НоменклатураПриемник=Неопределено;
	КонецЕсли;	
	 
КонецПроцедуры //ПередЗаписью

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Документы.фин_ВнутреннееПеремещениеСредствПриБюджетировании.ПроверкаЗапретаИзменений(ЭтотОбъект,Отказ);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	фин_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект,фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета"));
КонецПроцедуры

#КонецЕсли