
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя="Объект" Тогда
			Продолжить;
		КонецЕсли;
		ЭтотОбъект[Реквизит.Имя] = ?(Параметры.Свойство("Значения") И ТипЗнч(Параметры.Значения)=Тип("ФиксированнаяСтруктура") И Параметры.Значения.Свойство(Реквизит.Имя),Параметры.Значения[Реквизит.Имя],Истина);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(ПолучитьРезультат());
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат()
	Структура = Новый Структура;
	Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя="Объект" Тогда
			Продолжить;
		КонецЕсли;
		Структура.Вставить(Реквизит.Имя,ЭтотОбъект[Реквизит.Имя]);	
	КонецЦикла;
	Возврат Структура;
КонецФункции
