
&НаКлиенте
Процедура История(Команда)
	ОткрытьФорму("РегистрСведений.узп_СоответствиеПлановойИРегламентированнойНоменклатуры.Форма.ФормаИстории",,ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") Тогда
		РегламентированнаяНоменклатура = Параметры.Номенклатура;
		НастроитьОтбор();
	КонецЕсли;
	Если Параметры.Свойство("ПлановаяНоменклатура") Тогда
		ПлановаяНоменклатура = Параметры.ПлановаяНоменклатура;
		НастроитьОтбор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегламентированнаяНоменклатураОтборПриИзменении(Элемент)
	НастроитьОтбор();
КонецПроцедуры

&НаСервере
Процедура НастроитьОтбор()
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РегламентированнаяНоменклатура") Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлановаяНоменклатура") Тогда
			Список.Отбор.Элементы.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(РегламентированнаяНоменклатура) Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РегламентированнаяНоменклатура");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = РегламентированнаяНоменклатура;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПлановаяНоменклатура) Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПлановаяНоменклатура");
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение = ПлановаяНоменклатура;
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяНоменклатураОтборПриИзменении(Элемент)
	НастроитьОтбор();
КонецПроцедуры
