&НаКлиенте
Перем мРезультатДиалога;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ
// 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события ПриОткрытии формы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Устанавливаем заголовок формы
   	ЭтаФорма.Заголовок = ЗаголовокФормы;
	//Выполняем разбор места рождения из строки, используем нижний регистр для представления и верхний регистр для документов.
	Если Тип (ЭтаФорма.ВладелецФормы) = Тип ("УправляемаяФорма") Или Тип (ЭтаФорма.ВладелецФормы) = Тип ("ПолеФормы") Тогда
		СтруктураМестоРождения = куфиб_РаботаСДиалогами.РазложитьМестоРождения(МестоРожденияСтрокой, Ложь);
	Иначе	
		СтруктураМестоРождения = куфиб_РаботаСДиалогами.РазложитьМестоРождения(МестоРожденияСтрокой,);
	КонецЕсли;
	Город = СтруктураМестоРождения.НаселенныйПункт;
	Район = СтруктураМестоРождения.Район;
	Область = СтруктураМестоРождения.Область;
	Страна = СтруктураМестоРождения.Страна;
	Если НЕ ЗначениеЗаполнено(МестоРожденияСтрокой) Тогда
		Страна = ПредопределенноеЗначение("Справочник.КлассификаторСтранМира.Казахстан");
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПередЗакрытием формы
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если мРезультатДиалога <> "Отмена" тогда
		МестоРожденияСтрокойПослеРедактировния = СокрЛП(Город)+","+СокрЛП(Район)+","+СокрЛП(Область)+","+СокрЛП(Страна);
		Если СокрЛП(МестоРожденияСтрокой) <> СокрЛП(МестоРожденияСтрокойПослеРедактировния) тогда
			Если мРезультатДиалога <> "ОК" тогда
				РезультатВопроса = Вопрос("Данные о месте рождения изменены. Сохранить?",РежимДиалогаВопрос.ДаНетОтмена);
				Если РезультатВопроса=КодВозвратаДиалога.Нет тогда
					Возврат;
				ИначеЕсли РезультатВопроса=КодВозвратаДиалога.Отмена тогда
					Отказ = Истина;
					Возврат;
				Иначе
					мРезультатДиалога = "ОК";
				КонецЕсли;	 					
			КонецЕсли;	 
			МестоРожденияСтрокой = МестоРожденияСтрокойПослеРедактировния;
		КонецЕсли;	 
	КонецЕсли;	 
КонецПроцедуры

// Обработчик события ПриЗакрытии формы
&НаКлиенте
Процедура ПриЗакрытии()
	Если мРезультатДиалога = "ОК" тогда
		ОповеститьОВыборе(МестоРожденияСтрокой);
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ДЕЙСТВИЙ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

//Обработчик события нажатия кнопки "ОК"
&НаКлиенте
Процедура НижняяКоманднаяПанельОК(Кнопка)
	мРезультатДиалога = "ОК";
	Закрыть();
КонецПроцедуры

//Обработчик события нажатия кнопки "Отмена"
&НаКлиенте
Процедура НижняяКоманднаяПанельОтмена(Кнопка)
	мРезультатДиалога = "Отмена";
	Закрыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события НачалоВыбора поля ввода Страна
//
&НаКлиенте
Процедура СтранаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// откроем справочник КлассификаторСтранМира
	
	ОткрытьФорму("Справочник.КлассификаторСтранМира.ФормаВыбора",ПараметрыФормыВыбораСтраны(Элемент.ТекстРедактирования),Элемент);
	//ФормаВыбора = Справочники.КлассификаторСтранМира.ПолучитьФормуВыбора(, Элемент);
	//ФормаВыбора.НачальноеЗначениеВыбора = Справочники.КлассификаторСтранМира.НайтиПоНаименованию(Элемент.Значение);
	//ФормаВыбора.Открыть();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыВыбораСтраны(Элемент)
	ПараметрыФормы = Новый Структура;
	параметрыФормы.Вставить("НачальноеЗначениеВыбора",Справочники.КлассификаторСтранМира.НайтиПоНаименованию(Элемент));

	Возврат ПараметрыФормы;
КонецФункции

// Обработчик события ОбработкаВыбора поля ввода Страна
//
&НаКлиенте
Процедура СтранаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Страна = ВыбранноеЗначение
	//Элемент = ВыбранноеЗначение;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если параметры.Свойство("МестоРожденияСтрокой") Тогда
		МестоРожденияСтрокой = Параметры.МестоРожденияСтрокой;
	КонецЕсли;
	Если параметры.Свойство("ЗаголовокФормы") Тогда
		ЗаголовокФормы = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
КонецПроцедуры

//Инициализация переменных формы
мРезультатДиалога = "";