
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолеHTMLДокумента = Обработки.общ_ПроверкаВерсийПлатформыИНастроек.ПолучитьМакет("УсловияИспользованияЗащищенныхФункций").ПолучитьТекст();

	Элементы.Продолжить.Доступность=ПодтверждениеВыбора;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеВыбораПриИзменении(Элемент)
	Элементы.Продолжить.Доступность=ПодтверждениеВыбора;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьКоманда(Команда)
	Если ПодтверждениеВыбора Тогда
		Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры
