#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

Функция ПолучитьОбъектМетаданныхРегистраПоСсылке(ВидРегистраСсылка) Экспорт
	Если ВидРегистраСсылка.ВидРегистра.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ВидРегистраСсылка.ПрограммныйИдентификатор="" Тогда
		Возврат Неопределено;
	КонецЕсли;
	СоответствиеРегистров= Новый Соответствие;
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыСведений,		"РегистрыСведений");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыБухгалтерии,	"РегистрыБухгалтерии");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыНакопления,	"РегистрыНакопления");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыРасчета,		"РегистрыРасчета");
	Возврат Метаданные[СоответствиеРегистров.Получить(ВидРегистраСсылка.ВидРегистра)].Найти(ВидРегистраСсылка.ПрограммныйИдентификатор);
КонецФункции
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецЕсли