
//Процедура-обработчик события ПередЗаписью объекта
//
Процедура ПередЗаписью(Отказ)
	Текст = "";
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Если СокрЛП(ПрограммныйИдентификатор) = "" Тогда
		 Текст=Символы.ПС+Символы.Таб+"- не указан программный идентификатор документа;";
		 Отказ=Истина;
	Иначе
		 Запрос = Новый Запрос;
		 Запрос.Текст="ВЫБРАТЬ
		              |	ВидыДокументов.Ссылка
		              |ИЗ
		              |	Справочник.фин_ВидыДокументов КАК ВидыДокументов
		              |ГДЕ
		              |	ВидыДокументов.ПрограммныйИдентификатор = &ПрограммныйИдентификатор
		              |	И ВидыДокументов.Ссылка <> &Ссылка";
		 Запрос.УстановитьПараметр("ПрограммныйИдентификатор",	ПрограммныйИдентификатор);
		 Запрос.УстановитьПараметр("Ссылка",					Ссылка);
		 Если Не Запрос.Выполнить().Пустой() Тогда
			 Текст=Символы.ПС+Символы.Таб+"- уже имеется элемент справочника для указанного вида документов;";
			 Отказ=Истина;
		 КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		Сообщить("Элемент справочника Классификатор регистров системы """+Наименование+""" не может быть записан:"+Текст);
	КонецЕсли;
КонецПроцедуры //ПередЗаписью

Функция ПолноеИмя() Экспорт
	Если (НЕ ВидРегистра.Пустая()) И ПрограммныйИдентификатор<>"" Тогда
		СоответствиеРегистров= Новый Соответствие;
		СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыСведений,		"РегистрыСведений");
		СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыБухгалтерии,	"РегистрыБухгалтерии");
		СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыНакопления,	"РегистрыНакопления");
		СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыРасчета,		"РегистрыРасчета");
		Возврат ""+СоответствиеРегистров.Получить(ВидРегистра)+"."+ПрограммныйИдентификатор;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОбъектМетаданныхРегистра() Экспорт
	Если ВидРегистра.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ПрограммныйИдентификатор="" Тогда
		Возврат Неопределено;
	КонецЕсли;
	СоответствиеРегистров= Новый Соответствие;
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыСведений,		"РегистрыСведений");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыБухгалтерии,	"РегистрыБухгалтерии");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыНакопления,	"РегистрыНакопления");
	СоответствиеРегистров.Вставить(Перечисления.фин_ВидыРегистровСистемы.РегистрыРасчета,		"РегистрыРасчета");
	Возврат Метаданные[СоответствиеРегистров.Получить(ВидРегистра)].Найти(ПрограммныйИдентификатор);
КонецФункции
