////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
//

Перем мЭтоНовый;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ПередЗаписью" Объекта
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	мЭтоНовый = ЭтоНовый();
	
	Если НЕ УчетПоМестнымБюджетам И ЗначениеЗаполнено(МестныйБюджет) Тогда
		МестныйБюджет = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;


КонецПроцедуры // ПередЗаписью()

// Обработчик события "ПриЗаписи" Объекта
//
Процедура ПриЗаписи(Отказ)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мЭтоНовый Тогда
		глЗначениеПеременнойУстановить("глИсчислениеНалоговСтруктурныхЕдиниц", Неопределено, ИСТИНА);		
	КонецЕсли;

КонецПроцедуры // ПриЗаписи()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

мЭтоНовый = Ложь;