//// Хранит дерево макетов печатных форм
//Перем мДеревоМакетов;

//// Хранит элемент управления подменю печати
//Перем мПодменюПечати;

//// Хранит элемент управления кнопку печать по умолчанию
//Перем мПечатьПоУмолчанию;

////хранит текущее значение организации до ее изменения
//Перем мИсходнаяОрганизация;

//// Процедура устанавливает подменю "Печать" и кнопку "Печать по умолчанию" при необходимости
////
//Процедура УстановитьКнопкиПечати()
//	
//	мДеревоМакетов = УниверсальныеМеханизмы.ПолучитьДеревоМакетовПечати(Ссылка, ПолучитьСтруктуруПечатныхФорм(), Новый Действие("ОсновныеДействияФормыПечать"), Новый Действие("ОсновныеДействияФормыУстановитьПечатьПоУмолчанию"));

//	УниверсальныеМеханизмы.УстановитьПодменюПечати    (мПодменюПечати, ЭлементыФормы.ОсновныеДействияФормы, мДеревоМакетов.Строки.Количество() > 0);
//	УниверсальныеМеханизмы.УстановитьПечатьПоУмолчанию(мПечатьПоУмолчанию, ЭлементыФормы.ОсновныеДействияФормы, мДеревоМакетов, Метаданные().Имя,Новый Действие("ОсновныеДействияФормыПечатьПоУмолчанию"));

//	Если Не мПодменюПечати = Неопределено Тогда
//		УниверсальныеМеханизмы.СформироватьПодменю(мДеревоМакетов, мПодменюПечати,Истина,Истина);
//	КонецЕсли;
//	
//КонецПроцедуры

//// Процедура - обработчик нажатия на кнопку "Печать по умолчанию"
////
//Процедура ОсновныеДействияФормыПечатьПоУмолчанию(Кнопка)
//	
//	УниверсальныеМеханизмы.ПечатьПоДополнительнойКнопке(мДеревоМакетов, ЭтотОбъект, ЭтаФорма, Кнопка.Текст);
//	
//КонецПроцедуры

//// Процедура - обработчик нажатия на кнопку "Печать"
////
//Процедура ОсновныеДействияФормыПечать(Кнопка)
//	
//	УниверсальныеМеханизмы.ПечатьПоДополнительнойКнопке(мДеревоМакетов, ЭтотОбъект, ЭтаФорма, Кнопка.Текст);
//	
//КонецПроцедуры

//Процедура ОсновныеДействияФормыУстановитьПечатьПоУмолчанию(Кнопка)
//	
//	Если УниверсальныеМеханизмы.НазначитьКнопкуПечатиПоУмолчанию(мДеревоМакетов, Метаданные().Имя) Тогда
//		
//		УстановитьКнопкиПечати();
//		
//	КонецЕсли; 
//	
//	
//КонецПроцедуры