Функция КодСтрокиОтчета(ДвижениеДенежныхСредств) Экспорт
	Если ТипЗнч(ДвижениеДенежныхСредств) = Тип("ПеречислениеСсылка.фин_КлассификаторСтатейБюджетов") Тогда
		Если ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ДоходОтРеализацииТоваровИУслуг Тогда
			Возврат "010";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_СебестоимостьРеализации Тогда 
			Возврат "011";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_РасходыПоРеализации Тогда 
			Возврат "013";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_АдминистративныеРасходы Тогда 
			Возврат "014";				
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПрочиеРасходы Тогда 
			Возврат "015";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПрочиеДоходы Тогда
			Возврат "016"; 
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ДоходыПоФинансированию Тогда
			Возврат "021";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_РасходыПоФинансированию Тогда
			Возврат "022";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ДоляОрганизацииВПрибылиУбыткеАссоциированныхОрганизаций Тогда
			Возврат "023";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПрочиеНеоперационныеДоходы Тогда
			Возврат "024";					
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПрочиеНеоперационныеРасходы Тогда
			Возврат "025";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_РасходыПоКПН Тогда
			Возврат "101";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПрибыльУбытокПослеНалогообложенияОтПрекращеннойДеятельности Тогда 
			Возврат "201";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПереоценкаОсновныхСредств Тогда 
			Возврат "410";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПереоценкаФинансовыхАктивовИмеющихсяВНаличииДляПродажи Тогда 
			Возврат "411";	
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ДоляВПрочейСовокупнойПрибылиАссоцированныхОрганизаций Тогда 
			Возврат "412";		
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_АктуарныеПрибылиУбыткиПоПенсионнымОбязательствам Тогда 
			Возврат "413";								
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ЭффектОтИзмененияВСтавкеПодоходногоНалогаНаОтсроченныйНалогДочернихОрганизаций Тогда 
			Возврат "414";	
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ХэджированиеДенежныхПотоков Тогда 
			Возврат "415";	
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_КурсоваяРазницаПоИнвестициямВЗарубежныеОперации Тогда 
			Возврат "416";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ХэджированиеЧистыхИнвестицийВЗарубежныеОперации Тогда 
			Возврат "417";									
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_ПрочиеКомпонентыПрочейСовокупнойПрибыли Тогда 
			Возврат "418";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_КорректировкаПриРеклассификацииВСоставеПрибыли Тогда
			Возврат "419";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.БДР_НалоговыйЭффектКомпонентовПрочейСовокупнойПрибыли Тогда 
			Возврат "420";				
		КонецЕсли;	
	КонецЕсли;
	Возврат "";
КонецФункции

// Выполняет расчет вычисляемых показателей отчета
// (ячеек, выделенных зеленым цветом).
//
Процедура Расчет(мДоходыИРасходы) Экспорт
	
	// Строка 012 - Валовая прибыль
	мДоходыИРасходы.Области.Б012_3.Значение =   мДоходыИРасходы.Области.Б010_3.Значение
	                                  - мДоходыИРасходы.Области.Б011_3.Значение;
	                                
	мДоходыИРасходы.Области.Б012_4.Значение =   мДоходыИРасходы.Области.Б010_4.Значение
	                                  - мДоходыИРасходы.Области.Б011_4.Значение;

	//020 Итого операционная прибыль (убыток) (+/- строки с 012 по 016)
	мДоходыИРасходы.Области.Б020_3.Значение = мДоходыИРасходы.Области.Б012_3.Значение
	                                  - мДоходыИРасходы.Области.Б013_3.Значение
	                                  - мДоходыИРасходы.Области.Б014_3.Значение
	                                  - мДоходыИРасходы.Области.Б015_3.Значение
	                                  + мДоходыИРасходы.Области.Б016_3.Значение;
									  
	мДоходыИРасходы.Области.Б020_4.Значение = мДоходыИРасходы.Области.Б012_4.Значение
	                                  - мДоходыИРасходы.Области.Б013_4.Значение
	                                  - мДоходыИРасходы.Области.Б014_4.Значение
	                                  - мДоходыИРасходы.Области.Б015_4.Значение
	                                  + мДоходыИРасходы.Области.Б016_4.Значение;
									  	

    //100 - Прибыль (убыток) до налогообложения (+/- строки с 020 по 025)
	мДоходыИРасходы.Области.Б100_3.Значение =  мДоходыИРасходы.Области.Б020_3.Значение
	                                  + мДоходыИРасходы.Области.Б021_3.Значение
									  - мДоходыИРасходы.Области.Б022_3.Значение
									  + мДоходыИРасходы.Области.Б023_3.Значение
									  + мДоходыИРасходы.Области.Б024_3.Значение
									  - мДоходыИРасходы.Области.Б025_3.Значение;
									  
	мДоходыИРасходы.Области.Б100_4.Значение =  мДоходыИРасходы.Области.Б020_4.Значение
	                                  + мДоходыИРасходы.Области.Б021_4.Значение
									  - мДоходыИРасходы.Области.Б022_4.Значение
									  + мДоходыИРасходы.Области.Б023_4.Значение
									  + мДоходыИРасходы.Области.Б024_4.Значение
									  - мДоходыИРасходы.Области.Б025_4.Значение;
									  
   	// 200 - Прибыль (убыток) после налогообложения от продолжающейся деятельности (строка 100 – строка 101)
   	мДоходыИРасходы.Области.Б200_3.Значение =  мДоходыИРасходы.Области.Б100_3.Значение
	                                  - мДоходыИРасходы.Области.Б101_3.Значение;
									  
 	мДоходыИРасходы.Области.Б200_4.Значение =  мДоходыИРасходы.Области.Б100_4.Значение
	                                  - мДоходыИРасходы.Области.Б101_4.Значение;									  
									  
	// 300 - Прибыль за год (строка 200 + строка 201)
	мДоходыИРасходы.Области.Б300_3.Значение =  мДоходыИРасходы.Области.Б200_3.Значение
	                                  + мДоходыИРасходы.Области.Б201_3.Значение;
									  
	мДоходыИРасходы.Области.Б300_4.Значение =  мДоходыИРасходы.Области.Б200_4.Значение
	                                  + мДоходыИРасходы.Области.Б201_4.Значение;	
									  
	// 400 - Прочая совокупная прибыль, всего (сумма строк с 410 по 420)
	мДоходыИРасходы.Области.Б400_3.Значение =  мДоходыИРасходы.Области.Б410_3.Значение
	 								  + мДоходыИРасходы.Области.Б411_3.Значение
									  + мДоходыИРасходы.Области.Б412_3.Значение
									  + мДоходыИРасходы.Области.Б413_3.Значение
									  + мДоходыИРасходы.Области.Б414_3.Значение
									  + мДоходыИРасходы.Области.Б415_3.Значение
									  + мДоходыИРасходы.Области.Б416_3.Значение
									  + мДоходыИРасходы.Области.Б417_3.Значение
	                                  + мДоходыИРасходы.Области.Б418_3.Значение
									  + мДоходыИРасходы.Области.Б419_3.Значение
									  + мДоходыИРасходы.Области.Б420_3.Значение;
									  
	мДоходыИРасходы.Области.Б400_4.Значение =  мДоходыИРасходы.Области.Б410_4.Значение
	 								  + мДоходыИРасходы.Области.Б411_4.Значение
									  + мДоходыИРасходы.Области.Б412_4.Значение
									  + мДоходыИРасходы.Области.Б413_4.Значение
									  + мДоходыИРасходы.Области.Б414_4.Значение
									  + мДоходыИРасходы.Области.Б415_4.Значение
									  + мДоходыИРасходы.Области.Б416_4.Значение
									  + мДоходыИРасходы.Области.Б417_4.Значение
	                                  + мДоходыИРасходы.Области.Б418_4.Значение
									  + мДоходыИРасходы.Области.Б419_4.Значение
									  + мДоходыИРасходы.Области.Б420_4.Значение;    
									  
	// 500 - Общая совокупная прибыль (строка 300 + строка 400)
	мДоходыИРасходы.Области.Б500_3.Значение =  мДоходыИРасходы.Области.Б300_3.Значение
	                                  - мДоходыИРасходы.Области.Б400_3.Значение;
									  
	мДоходыИРасходы.Области.Б500_4.Значение =  мДоходыИРасходы.Области.Б300_4.Значение
	                                  - мДоходыИРасходы.Области.Б400_4.Значение;									  

КонецПроцедуры // Расчет()

