
&НаКлиенте
Процедура ОткрытьСправочник(Элемент)
	ИмяФормыОбъекта = "Справочник."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Элемент)
	ИмяФормыОбъекта = "Документ."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрСведений(Элемент)
	ИмяФормыОбъекта = "РегистрСведений."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработку(Элемент)
	ИмяФормыОбъекта = "Обработка."+ОтсечьЦифры(СтрЗаменить(Элемент.Имя,"Декорация_",""))+".Форма";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция ОтсечьЦифры(ИсходнаяСтрока)

	ФинальнаяСтрока = ИсходнаяСтрока;
	
	КодСимвола = КодСимвола(Прав(ИсходнаяСтрока, 1));
	
	Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		ФинальнаяСтрока = Лев(ИсходнаяСтрока, СтрДлина(ИсходнаяСтрока) - 1);
	КонецЕсли; 
	
	КодСимвола = КодСимвола(Прав(ФинальнаяСтрока, 1));
	
	Если (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		ФинальнаяСтрока = Лев(ФинальнаяСтрока, СтрДлина(ФинальнаяСтрока) - 1);
	КонецЕсли; 
	
	Возврат ФинальнаяСтрока;
		
КонецФункции // ОтсечьЦифры()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Декорация_ГруппаАнализОтклонений.Видимость=ПолучитьФункциональнуюОпцию("фин_ИспользоватьАнализОтклоненийФактическихДанных");
	Элементы.ГруппаАнализОтклонений.Видимость=ПолучитьФункциональнуюОпцию("фин_ИспользоватьАнализОтклоненийФактическихДанных");
	Элементы.ГруппаКалендарноеПланирование.Видимость=ПолучитьФункциональнуюОпцию("фин_ВестиКалендарноеПланированиеБюджетногоПроцесса");
	//Элементы.Декорация_фин_ОтчетОбИсполненииЗадачиБюджетногоПроцесса.Видимость=ПолучитьФункциональнуюОпцию("фин_ВестиКалендарноеПланированиеБюджетногоПроцесса") ИЛИ ПолучитьФункциональнуюОпцию("фин_ИспользоватьАнализОтклоненийФактическихДанных");
	Элементы.Декорация_фин_ЭтапыБюджетногоПроцесса.Видимость=ПолучитьФункциональнуюОпцию("фин_СтруктурироватьБюджетныйПроцессПоЭтапам");
КонецПроцедуры

&НаКлиенте
Процедура Декорация_Группа(Элемент)
	ИмяСтраницы = СтрЗаменить(Элемент.Имя,"Декорация_","");
	Элементы.Страницы.ТекущаяСтраница=Элементы.Страницы.ПодчиненныеЭлементы[ИмяСтраницы];
КонецПроцедуры


&НаКлиенте
Процедура Декорация_фин_ЗадачиБюджетногоПроцессаНажатие(Элемент)
	Попытка	
		ОткрытьФорму("Задача.фин_ЗадачиБюджетногоПроцесса.ФормаСписка",,,Новый УникальныйИдентификатор);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры


&НаСервере
Функция ИмяВидаОбъектовМетаданных(ИмяЭлемента)
	Возврат СтрЗаменить(Элементы.Найти(ИмяЭлемента).ПолучитьДействие("Нажатие"),"Открыть","");	
КонецФункции

&НаКлиенте
Процедура ОткрытьВОтдельномОкне(Команда)
	ИмяЭлемента = ТекущийЭлемент.Имя;
	ИмяВидаОбъектов = ИмяВидаОбъектовМетаданных(ИмяЭлемента);
	ИмяФормыОбъекта = ИмяВидаОбъектов+"."+ОтсечьЦифры(СтрЗаменить(ТекущийЭлемент.Имя,"Декорация_",""))+".ФормаСписка";
	Попытка	
		ОткрытьФорму(ИмяФормыОбъекта,,,Новый УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно);
	Исключение
		ПоказатьПредупреждение(,ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры
