
&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		//Элемент.ТекущиеДанные.Значение = ?(ЗначениеЗаполнено(ЭлементПВХ),ЭлементПВХ.ТипЗначения,Новый ОписаниеТипов("Неопределено")).ПривестиЗначение(Неопределено);
		Элемент.ТекущиеДанные.Значение = ПустоеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОповеститьОВыборе(Список);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Разрез") Тогда
		Возврат;
	КонецЕсли;
	ЭлементПВХ = Параметры.Разрез;
	Для Каждого ЭлементСписка Из Параметры.СписокЗначенийДляПоказа Цикл
		НоваяСтрока = Список.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	ПустоеЗначение = ?(ЗначениеЗаполнено(ЭлементПВХ),ЭлементПВХ.ТипЗначения,Новый ОписаниеТипов("Неопределено")).ПривестиЗначение(Неопределено);
	Элементы.СписокЗначение.ОграничениеТипа = ЭлементПВХ.ТипЗначения;
	Список.ТипЗначения = ЭлементПВХ.ТипЗначения;
КонецПроцедуры
