
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фин_ПроцедурыМеханизмовБюджетирования.ЗаполнитьСписокРеквизитовБюджетирования(СписокВыбораРазрезов,Истина);
	Если Запись.ИсходныйКлючЗаписи.Пустой() И Параметры.ЗначениеКопирования.Период = '00010101' Тогда
		Если Параметры.Свойство("Период") Тогда
			Запись.Период = Параметры.Период;
		КонецЕсли;
		Если Параметры.Свойство("ИсходноеЗначение") Тогда
			Запись.ИсходноеЗначение = Параметры.ИсходноеЗначение;
		КонецЕсли;
		Если Параметры.Свойство("Разрез") Тогда
			Запись.Разрез = Параметры.Разрез;
		КонецЕсли;
		Если Параметры.Свойство("Соответствие") Тогда
			Запись.Соответствие = Параметры.Соответствие;
		КонецЕсли;
		Если Параметры.Свойство("ТипЗначения") Тогда
			Элементы.ИсходноеЗначение.ОграничениеТипа = Параметры.ТипЗначения;	
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.Разрез) Тогда
		РазрезПредставление = СписокВыбораРазрезов.НайтиПоЗначению(фин_РаботаСДополнительнымиРазрезамиБюджетирования.ИмяРазреза(Запись.Разрез)).Представление;
		Элементы.Соответствие.ОграничениеТипа = фин_ПроцедурыМеханизмовБюджетирования.ПолучитьОписаниеТиповДляРазрезаБюджетирования(Запись.Разрез);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазрезНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокВыбораРазрезов;
КонецПроцедуры

&НаКлиенте
Процедура РазрезОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запись.Разрез = ПредопределенноеЗначение("Перечисление.фин_ФактическиеПоказателиБюджетирования."+ВыбранноеЗначение);
	РазрезПредставление = СписокВыбораРазрезов.НайтиПоЗначению(ВыбранноеЗначение).Представление;
	РазрезОбработкаВыбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура РазрезОбработкаВыбораНаСервере()
	Элементы.Соответствие.ОграничениеТипа = фин_ПроцедурыМеханизмовБюджетирования.ПолучитьОписаниеТиповДляРазрезаБюджетирования(Запись.Разрез);
	Запись.Соответствие = Элементы.Соответствие.ОграничениеТипа.ПривестиЗначение(Запись.Соответствие);
КонецПроцедуры
