#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеРазмераМесячногоРасчетногоПоказателя(ДатаАктуальности = Неопределено) Экспорт
	
	СрезПоследних = РегистрыСведений.РегламентированныеРасчетныеПоказатели.СрезПоследних(ДатаАктуальности);
	Если СрезПоследних.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Сведения о размере месячного расчетного показателя не заполнены'");
	КонецЕсли;
	
	ДанныеМРОТ = Новый Структура("Период, Размер", СрезПоследних[0].Период, СрезПоследних[0].РазмерМРП);
		
	Возврат ДанныеМРОТ;
	
КонецФункции

#КонецОбласти

#КонецЕсли