#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// анализ промежуточного исполнения
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ЗаказПокупателя";
	//КомандаПечати.Представление = НСтр("ru = 'Заказ покупателя'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	//КомандаПечати.Порядок = 1;
	
	Возврат;	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаказПокупателя") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм,
	//		"ЗаказПокупателя",
	//		НСтр("ru = 'Заказ покупателя'"),
	//		ПечатьЗаказПокупателя(МассивОбъектов, ОбъектыПечати),
	//		,
	//		"Документ.узп_ЗаказПокупателя.ПФ_MXL_ЗаказПокупателя");
	//КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Подготовка табличных печатных документов.

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ДополнительныеПараметрыЗапросов = Новый Структура();
		
	ДополнительныеЗапросы = Новый Массив;
		
	ПараметрыПроведения = фин_УправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка,Отказ,Истина,Истина,,,,,ДополнительныеПараметрыЗапросов,ДополнительныеЗапросы);
	
	Возврат ПараметрыПроведения;

КонецФункции 

Процедура РаспределитьПриоритетыКакВПрошлом(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("СтруктурноеПодразделение",Объект.СтруктурноеПодразделение);
	Запрос.УстановитьПараметр("Дата", Объект.Дата-1);
	Запрос.УстановитьПараметр("СхемаРасчета",Объект.СхемаРасчета);
	Запрос.Текст = "ВЫБРАТЬ
	               |	узп_НастройкиСхемРасчетаОценокСрезПоследних.СхемаРасчета,
	               |	узп_НастройкиСхемРасчетаОценокСрезПоследних.Критерий,
	               |	узп_НастройкиСхемРасчетаОценокСрезПоследних.Приоритет
	               |ИЗ
	               |	РегистрСведений.узп_НастройкиСхемРасчетаОценок.СрезПоследних(
	               |			&Дата,
	               |			Организация = &Организация
	               |				И СтруктурноеПодразделение = &СтруктурноеПодразделение
	               |				И СхемаРасчета = &СхемаРасчета) КАК узп_НастройкиСхемРасчетаОценокСрезПоследних";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Объект.Приоритеты.Очистить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Приоритеты.Добавить();
			НоваяСтрока.Критерий = Выборка.Критерий;
			НоваяСтрока.Приоритет = Выборка.Приоритет;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли