#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр узп_НастройкиСхемРасчетаОценок
	Движения.узп_НастройкиСхемРасчетаОценок.Записывать = Истина;
	Движения.узп_НастройкиСхемРасчетаОценок.Очистить();
	Для Каждого ТекСтрокаПриоритеты Из Приоритеты Цикл
		Движение = Движения.узп_НастройкиСхемРасчетаОценок.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтруктурноеПодразделение = СтруктурноеПодразделение;
		Движение.СхемаРасчета = СхемаРасчета;
		Движение.Критерий = ТекСтрокаПриоритеты.Критерий;
		Движение.Приоритет = ТекСтрокаПриоритеты.Приоритет;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	фин_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета"));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Итого = Приоритеты.Итог("Приоритет");
	Если Итого>100 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Итоговая сумма приоритетов не должна превышать 100%");
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли

