////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеревоФормы = ДанныеФормыВЗначение(ДеревоРеквизитов,Тип("ДеревоЗначений"));
	Если Параметры.Свойство("ВидДанных") Тогда
		Если ТипЗнч(Параметры.ВидДокументов)=Тип("СправочникСсылка.фин_ВидыДокументов") Тогда
			фин_ПроцедурыМеханизмовБюджетирования.ЗаполнитьДеревоРеквизитовДокумента(ДеревоФормы,Метаданные.Документы.Найти(Параметры.ВидДокументов.ПрограммныйИдентификатор),Параметры.ВидДанных,Параметры.ИмяИсточника,?(Параметры.Свойство("ТребуетсяАвтовыборПоСубконто"),Параметры.ТребуетсяАвтовыборПоСубконто,Истина),?(Параметры.Свойство("ТребуемыйТип"),Параметры.ТребуемыйТип,Неопределено),?(Параметры.Свойство("БезРеквизитовШапки"),Параметры.БезРеквизитовШапки,Ложь),?(Параметры.Свойство("ВсеПоля"),Параметры.ВсеПоля,Ложь));
		Иначе
			фин_ПроцедурыМеханизмовБюджетирования.ЗаполнитьДеревоРеквизитовДокумента(ДеревоФормы,Параметры.ВидДокументов.ПолучитьОбъект().ПолучитьОбъектМетаданныхРегистра(),Параметры.ВидДанных,Параметры.ИмяИсточника,?(Параметры.Свойство("ТребуетсяАвтовыборПоСубконто"),Параметры.ТребуетсяАвтовыборПоСубконто,Истина),?(Параметры.Свойство("ТребуемыйТип"),Параметры.ТребуемыйТип,Неопределено),?(Параметры.Свойство("БезРеквизитовШапки"),Параметры.БезРеквизитовШапки,Истина),?(Параметры.Свойство("ВсеПоля"),Параметры.ВсеПоля,Ложь));
		КонецЕсли;
	Иначе
		фин_ПроцедурыМеханизмовБюджетирования.ЗаполнитьДеревоРеквизитовДокумента(ДеревоФормы,Метаданные.Документы.Найти(Параметры.ВидДокументов.ПрограммныйИдентификатор));
	КонецЕсли;
	ЗначениеВДанныеФормы(ДеревоФормы,ДеревоРеквизитов);
	ТолькоДочерние 	= Параметры.ТолькоДочерние;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ДеревоРеквизитов>

&НаКлиенте
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Путь 		= "";
	Заголовок 	= "";
	СтрокаВыбора = ДеревоРеквизитов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаВыбора.ПолучитьЭлементы().Количество()<>0 И ТолькоДочерние И НЕ СтрокаВыбора.ЕдиныйТип Тогда
		Возврат;
	КонецЕсли;
	Если СтрокаВыбора.ПолучитьРодителя() = Неопределено Тогда
		Если СтрокаВыбора.ПодчиненныйОбъект Тогда
			Возврат;
		КонецЕсли;
		Путь		= СтрокаВыбора.Имя;
		Заголовок 	= СтрокаВыбора.Представление;
	Иначе
		Если СтрокаВыбора.ПолучитьРодителя().ПодчиненныйОбъект Тогда
			Путь		= СтрокаВыбора.ПолучитьРодителя().Имя+":"+СтрокаВыбора.Имя;
			Заголовок 	= СтрокаВыбора.ПолучитьРодителя().Представление+":"+СтрокаВыбора.Представление;
		ИначеЕсли СтрокаВыбора.ПолучитьРодителя().ПолучитьРодителя()=Неопределено Тогда 
			Путь		= СтрокаВыбора.ПолучитьРодителя().Имя+"."+СтрокаВыбора.Имя;
			Заголовок 	= СтрокаВыбора.ПолучитьРодителя().Представление+"."+СтрокаВыбора.Представление;
		Иначе
			Если СтрокаВыбора.ПолучитьРодителя().ПолучитьРодителя().ПодчиненныйОбъект Тогда
				Путь		= СтрокаВыбора.ПолучитьРодителя().ПолучитьРодителя().Имя+":"+СтрокаВыбора.ПолучитьРодителя().Имя+"."+СтрокаВыбора.Имя;
				Заголовок 	= СтрокаВыбора.ПолучитьРодителя().ПолучитьРодителя().Представление+":"+СтрокаВыбора.ПолучитьРодителя().Представление+"."+СтрокаВыбора.Представление;
			Иначе 
				Путь		= СтрокаВыбора.ПолучитьРодителя().ПолучитьРодителя().Имя+"."+СтрокаВыбора.ПолучитьРодителя().Имя+"."+СтрокаВыбора.Имя;
				Заголовок 	= СтрокаВыбора.ПолучитьРодителя().ПолучитьРодителя().Представление+"."+СтрокаВыбора.ПолучитьРодителя().Представление+"."+СтрокаВыбора.Представление;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ОповеститьОВыборе(Новый Структура("Путь,Заголовок",Путь,Заголовок));
	
КонецПроцедуры
