#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Заполнение


////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ДополнительныеДанные = Новый Массив;
	ДополнительныеДанные.Добавить("ДанныеОстатков");
	
	ДополнительныеПараметрыЗапросов = Новый Структура;
	ДополнительныеПараметрыЗапросов.Вставить("БюджетированиеПоОрганизациям",фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("БюджетированиеПоОрганизациям"));
	ДополнительныеПараметрыЗапросов.Вставить("Организация",   ДокументСсылка.Организация);
	ДополнительныеПараметрыЗапросов.Вставить("Сценарий", 		ДокументСсылка.Сценарий);
	ДополнительныеПараметрыЗапросов.Вставить("ДатаПереоценки", ДокументСсылка.ДатаПереоценки);
	ДополнительныеПараметрыЗапросов.Вставить("ВалютаУпрУчета", фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаУправленческогоУчета"));
	ДополнительныеПараметрыЗапросов.Вставить("ВалютаСценария", ДокументСсылка.Сценарий.Валюта);
	
	ПараметрыПроведения = фин_УправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ,,,,,,,ДополнительныеПараметрыЗапросов,ДополнительныеДанные);
	
	Возврат ПараметрыПроведения;

КонецФункции 

Функция ТекстЗапросаДанныеОстатков(НомераТаблиц,ПараметрыПроведения, Реквизиты)  Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	 |	БюджетированиеОстатки.Счет,
	 |	БюджетированиеОстатки.Субконто1,
	 |	БюджетированиеОстатки.Субконто2,
	 |	БюджетированиеОстатки.Субконто3,
	 |	ДанныеСчет.НаименованиеСубконто1,
	 |	ДанныеСчет.НаименованиеСубконто2,
	 |	ДанныеСчет.НаименованиеСубконто3,
	 |	БюджетированиеОстатки.Валюта,
	 |	БюджетированиеОстатки.СуммаУпрОстатокДт,
	 |	БюджетированиеОстатки.СуммаУпрОстатокКт,
	 |	БюджетированиеОстатки.ВалютнаяСуммаОстатокДт,
	 |	БюджетированиеОстатки.ВалютнаяСуммаОстатокКт,
	 |	БюджетированиеОстатки.СуммаСценарияОстатокДт,
	 |	БюджетированиеОстатки.СуммаСценарияОстатокКт,
	 |	БюджетированиеОстатки.Счет.Вид КАК ВидСчета,
	 |	БюджетированиеОстатки.Счет.Валютный КАК Валютный,
	 |	КурсыВалютыОстатка.Курс КАК КурсОстатка,
	 |	КурсыВалютыОстатка.Кратность КАК КратностьОстатка,
	 |	КурсыВалютыСценария.Курс КАК КурсСценария,
	 |	КурсыВалютыСценария.Кратность КАК КратностьСценария,
	 |	КурсыВалютыУпрУчета.Курс КАК КурсУпрУчета,
	 |	КурсыВалютыУпрУчета.Кратность КАК КратностьУпрУчета
	 |ИЗ
	 |	РегистрБухгалтерии.фин_Бюджетирование.Остатки(&ДатаПереоценки, Счет.Валютный = ИСТИНА, ,ВЫБОР КОГДА &БюджетированиеПоОрганизациям ТОГДА Организация = &Организация ИНАЧЕ ИСТИНА КОНЕЦ И  Сценарий = &Сценарий) КАК БюджетированиеОстатки
	 |ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 |			Бюджетирование.Ссылка КАК Счет,
	 |			Бюджетирование.Валютный КАК Валютный,
	 |			Бюджетирование.Количественный КАК Количественный,
	 |			БюджетированиеВидыСубконто1.ВидСубконто.Наименование КАК НаименованиеСубконто1,
	 |			БюджетированиеВидыСубконто2.ВидСубконто.Наименование КАК НаименованиеСубконто2,
	 |			БюджетированиеВидыСубконто3.ВидСубконто.Наименование КАК НаименованиеСубконто3
	 |		ИЗ
	 |			ПланСчетов.фин_Бюджетирование КАК Бюджетирование
	 |				ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.фин_Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто1
	 |				ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто1.Ссылка И (БюджетированиеВидыСубконто1.НомерСтроки = 1)
	 |				ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.фин_Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто2
	 |				ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто2.Ссылка И (БюджетированиеВидыСубконто2.НомерСтроки = 2)
	 |				ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.фин_Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто3
	 |				ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто3.Ссылка И (БюджетированиеВидыСубконто3.НомерСтроки = 3)) КАК ДанныеСчет
	 |		ПО БюджетированиеОстатки.Счет = ДанныеСчет.Счет";
	Если НЕ Реквизиты.Сценарий.ИспользоватьКурсыСценария Тогда
		 ТекстЗапроса=ТекстЗапроса+"
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПереоценки, ) КАК КурсыВалютыОстатка
		 |		ПО БюджетированиеОстатки.Валюта = КурсыВалютыОстатка.Валюта
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПереоценки, Валюта = &ВалютаУпрУчета) КАК КурсыВалютыУпрУчета
		 |		ПО (ИСТИНА)
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаПереоценки, Валюта = &ВалютаСценария) КАК КурсыВалютыСценария
		 |		ПО (ИСТИНА)";
	Иначе
		 ТекстЗапроса=ТекстЗапроса+"
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"КурсыВалютПоСценариям.СрезПоследних(&ДатаПереоценки,Сценарий=&Сценарий ) КАК КурсыВалютыОстатка
		 |		ПО БюджетированиеОстатки.Валюта = КурсыВалютыОстатка.Валюта
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"КурсыВалютПоСценариям.СрезПоследних(&ДатаПереоценки, Валюта = &ВалютаУпрУчета И Сценарий=&Сценарий) КАК КурсыВалютыУпрУчета
		 |		ПО (ИСТИНА)
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"КурсыВалютПоСценариям.СрезПоследних(&ДатаПереоценки, Валюта = &ВалютаСценария И Сценарий=&Сценарий) КАК КурсыВалютыСценария
		 |		ПО (ИСТИНА)";
	КонецЕсли;

	ТекстЗапроса = ТекстЗапроса + фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();
	НомераТаблиц.Вставить("ТаблицаДанныеОстатков",  НомераТаблиц.Количество());
	
	Возврат ТекстЗапроса;	
КонецФункции 


////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочие служебные процедуры и функции


#КонецЕсли