#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	Наименование = СформироватьНаименование();
КонецПроцедуры

Функция СформироватьНаименование()
	мРезультат = "";
	Символов = 150;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаДополнительныхРазрезовБюджетирования.Измерение,
		|	НастройкаДополнительныхРазрезовБюджетирования.Разрез
		|ИЗ
		|	РегистрСведений.фин_НастройкаДополнительныхРазрезовБюджетирования КАК НастройкаДополнительныхРазрезовБюджетирования";

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество()=0 Тогда
		Возврат "";
	КонецЕсли;
	Символов = Цел(150/Выборка.Количество())-1;
	

	ОбработанныеРазрезы=Новый Массив;
	Пока Выборка.Следующий() Цикл
		Разрез = ЭтотОбъект[фин_ПроцедурыМеханизмовБюджетирования.ИмяРазреза(Выборка.Измерение)];
		Если Разрез = Неопределено Тогда
			ТекстРазрез ="";
		Иначе
			ТекстРазрез =Строка(Разрез);
		КонецЕсли;
		Если СтрДлина(ТекстРазрез)>Символов Тогда
			ТекстРазрез = Лев(ТекстРазрез,Символов);
		КонецЕсли;
		мРезультат=мРезультат+?(мРезультат="","","/")+ТекстРазрез;
	КонецЦикла;
	Возврат мРезультат;	
КонецФункции

#КонецЕсли