Перем ДанныеРасшифровки Экспорт;
Перем СохраненнаяНастройка Экспорт;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Реквизит.Имя,?(Реквизит.Имя="КонецПериода",КонецДня(КонецПериода),ЭтотОбъект[Реквизит.Имя]));
	КонецЦикла;
	Отчеты.дог_АнализЗадолженностиБУПоДоговору.ДоработатьКомпоновщикПередВыводом(КомпоновщикНастроек,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ДоговорКонтрагента);
	СтандартнаяОбработка = Ложь;
	////Вывод
	КомпоновщикМакетаСКД = Новый КомпоновщикМакетаКомпоновкиДанных();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетСКД = КомпоновщикМакетаСКД.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	
	ПроцессорСКД = Новый ПроцессорКомпоновкиДанных();
	ПроцессорСКД.Инициализировать(МакетСКД,,ДанныеРасшифровки,Истина);
	
	ПроцессорВыводаСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ДокументРезультат.Очистить();
	ПроцессорВыводаСКД.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаСКД.Вывести(ПроцессорСКД);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура Скомпоновать(ДокументРезультат) Экспорт
	СкомпоноватьРезультат(ДокументРезультат,ДанныеРасшифровки);	
КонецПроцедуры