
&НаСервере
Процедура ЗаполнитьНаСервере()
	   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Контрагент,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.ДоговорКонтрагента,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.НазначениеПлатежа,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СуммаДокумента,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СчетОрганизации,
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Представительство
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеИсходящееРасшифровкаПлатежа
		|ГДЕ
		|	ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.СогласованоБП = ИСТИНА
		|	И НЕ ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.ПометкаУдаления
		|	И ПлатежноеПоручениеИсходящееРасшифровкаПлатежа.Ссылка.УтверженоК = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("На заданный период не обнаружены документы");
		Возврат;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	   Строка = Объект.Платежи.Добавить();
				
			Строка.Поручение 			= Выборка.Ссылка;
			Строка.Представительство    = Выборка.Представительство;
			Строка.РасчетныйСчет        = Выборка.СчетОрганизации;
			Строка.Договор 			    = Выборка.ДоговорКонтрагента;
			Строка.Контрагент 		    = Выборка.Контрагент;
			Строка.СуммаПлатежа   	    = Выборка.СуммаДокумента;
			Строка.НазначениеПлатежа    = Выборка.НазначениеПлатежа;
			Строка.Валюта      		    = Выборка.ВалютаДокумента;
			Строка.Представительство    = Выборка.Представительство;
		КонецЦикла;
	     
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Платежи.Количество() <> 0 Тогда
		Ответ = Вопрос("Таблица не пуста. Перезаполнить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Платежи.Очистить();
		КонецЕсли;
	КонецЕсли;
    Таблица = Объект.Платежи;
	 
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСогласованиеНаСервере()
	
	Если Объект.БПСогласование = БизнесПроцессы.СогласованиеРеестров.ПустаяСсылка() Тогда
		НовБП = БизнесПроцессы.СогласованиеРеестров.СоздатьБизнесПроцесс();
		НовБП.Автор = ПараметрыСеанса.ТекущийПользователь;
		НовБП.Дата = ТекущаяДата();
		НовБП.Организация = Объект.Организация;
		НовБП.РеестрПлатежей = Объект.Ссылка;
		НовБП.Записать();
		НовБП.Старт(ПредопределенноеЗначение("БизнесПроцесс.СогласованиеРеестров.ТочкаМаршрута.Старт"));
		
		Объект.БПСогласование = НовБП.Ссылка;
		ЭтотОбъект.Записать();
	Иначе 
		Сообщить("Реестр уже отправлен на согласование");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаСогласование(Команда)
	ОтправитьНаСогласованиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Объект.РеестрСогласован = Истина Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
		ЭтаФорма.Элементы.ФормаОтправитьНаСогласование.Доступность = Ложь;
		Сообщить("Реестр согласован и не может быть изменен");
	КонецЕсли;
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиЦА Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦАНаСервере()
	
	Объект.Платежи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка,
		|	СогласованиеПлатежейРасчетнаяТаблица.Ссылка.БанковскийСчетОрганизации КАК СчетОрганизации,
		|	СогласованиеПлатежейРасчетнаяТаблица.Контрагент,
		|	СогласованиеПлатежейРасчетнаяТаблица.Договор,
		|	СогласованиеПлатежейРасчетнаяТаблица.СуммаПоЗаявке,
		|	СогласованиеПлатежейРасчетнаяТаблица.Примечание,
		|	СогласованиеПлатежейРасчетнаяТаблица.ВалютаДокумента
		|ИЗ
		|	БизнесПроцесс.СогласованиеПлатежей.РасчетнаяТаблица КАК СогласованиеПлатежейРасчетнаяТаблица
		|ГДЕ
		|	НЕ СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ПометкаУдаления
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеРук = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.ЗаявкаПрошлаСогласованиеКурирующимЧП = ""Разрешено""
		|	И СогласованиеПлатежейРасчетнаяТаблица.Ссылка.Завершен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДатаНачала",Объект.ДатаНачала );
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("На заданный период не обнаружены документы");
		Возврат;
	КонецЕсли;	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	   Строка = Объект.Платежи.Добавить();
	   
		    Строка.ЗаявкаНаФинансирование = Выборка.Ссылка;
			Строка.РасчетныйСчет        = Выборка.СчетОрганизации;
			Строка.Договор 			    = Выборка.Договор;
			Строка.Контрагент 		    = Выборка.Контрагент;
			Строка.СуммаПлатежа   	    = Выборка.СуммаПоЗаявке;
			Строка.НазначениеПлатежа    = Выборка.Примечание;
			Строка.Валюта      		    = Выборка.ВалютаДокумента;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦА(Команда)
	ЗаполнитьЦАНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипПлатежаПриИзменении(Элемент)
	
	Если Объект.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиЦА Тогда
		ЭтаФорма.Элементы.ПлатежиЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПоручение.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Истина;
	Иначе
		ЭтаФорма.Элементы.ПлатежиЗаполнитьЦА.Видимость = Ложь;
		ЭтаФорма.Элементы.ПлатежиПредставительство.Видимость = Истина;
		ЭтаФорма.Элементы.ПлатежиЗаявкаНаФинансирование.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПлатежиРасчетныйСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", Объект.Организация));
		
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры


