
&НаКлиенте
Процедура КодПриИзменении(Элемент)
	Объект.Код = УдалитьНедопустимыеСимволыНомера(Объект.Код);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Объект.Код="" Тогда
		Объект.Код = УдалитьНедопустимыеСимволыНомера(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция УдалитьНедопустимыеСимволыНомера(Текст)
	Возврат фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.УдалитьНедопустимыеСимволыНомера(Текст,,15);
КонецФункции

&НаКлиенте
Процедура НастройкаШкалы(Команда)
	ОткрытьФорму("РегистрСведений.фин_ШкалыОценкиДляФинансовыхРасчетов.ФормаСписка",Новый Структура("Шкала",Объект.Ссылка),ЭтотОбъект);
КонецПроцедуры
