//Процедура ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда
		ТочкиПланирования.Свернуть("ПериодПланирования",);
		ТочкиПланирования.Сортировать("ПериодПланирования");
	КонецЕсли;
	Если фин_ОбщегоНазначенияВызовСервераПовтИсп.РежимИнтеграции()=Перечисления.фин_РежимыИнтеграцииСУчетнойСистемой.УправлениеТорговлейДляКазахстана_3 Тогда
		ДетализацияПланирования = Перечисления[фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"ДетализацияПланирования"].Номенклатура;
	КонецЕсли;
КонецПроцедуры //ПередЗаписью
