
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.АктОсмотраМестХранения.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктОсмотраМестХранения.Организация,
	|	АктОсмотраМестХранения.ОсмотромУстановлено.(
	|		НомерСтроки,
	|		ХПП,
	|		ДатаОсмотра,
	|		ПредставительКорпорации,
	|		ПредставительМИО,
	|		Прочие,
	|		НедостачаЗерна,
	|		УхудшениеКачестваЗерна,
	|		ЗараженностьЗерна,
	|		НарушениеПравилХраненияЗерна,
	|		ХПП.Область КАК Область
	|	),
	|	ГОД(АктОсмотраМестХранения.Дата) КАК Год,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо КАК ФИОДиректора,
	|	АктОсмотраМестХранения.ПериодС,
	|	АктОсмотраМестХранения.ПериодПо,
	|	ВЫБОР
	|		КОГДА АктОсмотраМестХранения.ВнеГрафика = ИСТИНА
	|			ТОГДА ""Да""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВнеГрафика,
	|	ВЫБОР
	|		КОГДА КВАРТАЛ(АктОсмотраМестХранения.Дата) = 1
	|			ТОГДА ""1 Квартал""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КВАРТАЛ(АктОсмотраМестХранения.Дата) = 2
	|					ТОГДА ""2 Квартал""
	|				ИНАЧЕ ВЫБОР
	|						КОГДА КВАРТАЛ(АктОсмотраМестХранения.Дата) = 3
	|							ТОГДА ""3 Квартал""
	|						ИНАЧЕ ""4 Квартал""
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК Квартал,
	|	ВЫБОР
	|		КОГДА АктОсмотраМестХранения.ВнеГрафика = ЛОЖЬ
	|			ТОГДА ""Да""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоГрафику
	|ИЗ
	|	Документ.АктОсмотраМестХранения КАК АктОсмотраМестХранения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|		ПО АктОсмотраМестХранения.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	|ГДЕ
	|	АктОсмотраМестХранения.Ссылка В(&Ссылка)
	|	И ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	//Шапка = Макет.ПолучитьОбласть("Шапка");
	//ОбластьОсмотромУстановленоШапка = Макет.ПолучитьОбласть("ОсмотромУстановленоШапка");
	ОбластьОсмотромУстановлено = Макет.ПолучитьОбласть("ОсмотромУстановлено");
	ОбластьПоГрафику = Макет.ПолучитьОбласть("ПоГрафику");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		//ТабДок.Вывести(ОбластьЗаголовок);

		ОбластьШапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьШапка, Выборка.Уровень());

		//ТабДок.Вывести(ОбластьОсмотромУстановленоШапка);
		ВыборкаОсмотромУстановлено = Выборка.ОсмотромУстановлено.Выбрать();
		Пока ВыборкаОсмотромУстановлено.Следующий() Цикл
			ОбластьОсмотромУстановлено.Параметры.Заполнить(ВыборкаОсмотромУстановлено);
			//Если Выборка.ВнеГрафика = Истина Тогда ОбластьОсмотромУстановлено.Параметры.ХПП.Цвет 
			ТабДок.Вывести(ОбластьОсмотромУстановлено, ВыборкаОсмотромУстановлено.Уровень());
		КонецЦикла;
		//Если Выборка.ВнеГрафика = Истина Тогда ОбластьПоГрафику.Параметры.ВнеГрафика = "Да" 
		//	Иначе ОбластьПоГрафику.Параметры.ПоГрафику = "Да";
		//КонецЕсли;
		ОбластьПоГрафику.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьПоГрафику, Выборка.Уровень());
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
