
///////////////////////////////////////////////////////////////////////////////
// ИНФОРМАЦИОННЫЕ БАЗЫ ДЛЯ ОБМЕНА
//////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуВозможныхОбменов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации = "УТ"; // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена = "ОбменУправлениеТорговлейБухгалтерия"; // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации = "Управление торговлей для Казахстана, редакция 2.2";
	СтрокаТаблицы.ПредставлениеКонфигурации = "1С:Управление торговлей 8 (начиная с версии 2.2)"; // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию = "УТ"; // Префикс по умолчанию
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьИнформациюОТекущейИнформационнойБазе() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "БК");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменУправлениеТорговлейБухгалтерия");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", "1С:Бухгалтерия 8 для Казахстана (начиная с версии 1.5)");
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "БК");
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ОткрытьФормуВыполненияОбменаСУправлениеТорговлей() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.ФормаВыполненияОбменаДанными, "Просмотр") Тогда
		ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
		ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерия.ПустаяСсылка();
			
		ФормаВыполненияОбмена.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаРИБ() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.ФормаВыполненияОбменаДанными, "Просмотр") Тогда
		ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
		ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.Полный.ПустаяСсылка();
			
		ФормаВыполненияОбмена.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаРИБПоОрганизации() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.ФормаВыполненияОбменаДанными, "Просмотр") Тогда
		ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
		ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ПоОрганизации.ПустаяСсылка();
			
		ФормаВыполненияОбмена.Открыть();
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОткрытьМониторОбменовДляОбменаСТорговлей() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.МониторНастроекОбменаДанными, "Просмотр") Тогда
		ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
		ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерия.ПустаяСсылка();
		ФормаМонитора.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаРИБ() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.МониторНастроекОбменаДанными, "Просмотр") Тогда
		ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
		ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.Полный.ПустаяСсылка();
		ФормаМонитора.Открыть();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаРИБПоОрганизации() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.МониторНастроекОбменаДанными, "Просмотр") Тогда
		ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
		ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ПоОрганизации.ПустаяСсылка();
		ФормаМонитора.Открыть();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаВсе() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.МониторНастроекОбменаДанными, "Просмотр") Тогда
		ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
		ФормаМонитора.Открыть();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуНастроекОбменаРИБ() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.ФормаСпискаНастроекОбмена, "Просмотр") Тогда
		ФормаCписка = ПолучитьОбщуюФорму("ФормаСпискаНастроекОбмена",, "НастройкиОбменаРИБ");
		ФормаCписка.ТипОбменаПоУмолчанию = ПланыОбмена.Полный.ПустаяСсылка();
		ФормаCписка.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуНастроекОбменаРИБПоОрганизации() Экспорт
	
	Если ОбщегоНазначения.ПроверитьПравоДоступа(Метаданные.ОбщиеФормы.ФормаСпискаНастроекОбмена, "Просмотр") Тогда
		ФормаCписка = ПолучитьОбщуюФорму("ФормаСпискаНастроекОбмена",, "НастройкиОбменаРИБ");
		ФормаCписка.ТипОбменаПоУмолчанию = ПланыОбмена.ПоОрганизации.ПустаяСсылка();
		ФормаCписка.Открыть();
	КонецЕсли;
		
КонецПроцедуры



/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДДЕРЖКИ ОБМЕНА С РОЗНИЦЕЙ

// Процедура открывает форму выполнения обмена с "1С:Розница"
//
Процедура ОткрытьФормуВыполненияОбменаСРозницей() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменРозницаБухгалтерия.ПустаяСсылка();
	
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

// Процедура открывает форму монитора обменов обмена с "1С:Розница"
//
Процедура ОткрытьМониторОбменовДляОбменаСРозницей() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменРозницаБухгалтерия.ПустаяСсылка();
	ФормаМонитора.Открыть();
	
КонецПроцедуры

// Функция получает таблицу возможных обменов с "1С:Розница"
//
Функция ПолучитьТаблицуВозможныхОбменовСРозницей() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации           = "РТ";                                      // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена            = "ОбменРозницаБухгалтерия";                 // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации  = "Розница для Казахстана, редакция 1.0";
	СтрокаТаблицы.ПредставлениеКонфигурации = "1С:Розница для Казахстана (начиная с версии 1.0)"; // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию        = "РТ";                                      // Префикс по умолчанию
	
	Возврат Таблица;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДДЕРЖКИ ОБМЕНА БСП

Процедура ОткрытьФормуУправленияОбменамиДанных() Экспорт
	
	#Если Клиент Тогда
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменДанными") <> Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупрежденияИспользованияОбменаДанными82());
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.УправлениеОбменамиДанных");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОткрытьФормуСценариевОбменовДанными() Экспорт
	
	#Если Клиент Тогда
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменДанными") <> Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупрежденияИспользованияОбменаДанными82());
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СценарииОбменовДанными.Форма.НастройкаРасписанияОбменовДанными");
	#КонецЕсли
	
КонецПроцедуры

Функция ТекстПредупрежденияИспользованияОбменаДанными82()
	
	Возврат НСтр("ru = 'Данная возможность недоступна. Обратитесь к системному администратору.'");
	
КонецФункции

