////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция выбирает все позиции из текущих заявок
//
Функция ПолучитьСписокНоменклатуры() Экспорт
	
	СписокЗаявок =  Новый СписокЗначений;
	СписокЗаявок.ЗагрузитьЗначения(КонкурснаяЗаявка.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"));
	
	Возврат гз_ПроцедурыОперативногоУчетаЗакупок.ПолучитьСписокНоменклатурыДляФормированияОбъявления(СписокЗаявок);
	
КонецФункции //ПолучитьСписокНоменклатуры()
