// Функия возвращает модуль числа
//
Функция ПолучитьМодульЧисла(Число)
	Возврат ?(Число < 0, -Число, Число);	
КонецФункции

// Процедура заполняет данные из дополнительного счета-фактуры, введенного на основании первичного документа
// 
Процедура ЗаполнитьДанныеИзДополнительногоСчетаФактуры(СчетФактура, Запись, Выборка, ДанныеКурсаВалюты, ВалютаРегламентированногоУчета, УчитыватьАкциз = Ложь)
	
	Номенклатура = Выборка.Номенклатура;
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	СсылкаНадокумент = Выборка.СсылкаНаДокумент;
	ВалютаДокумента = СсылкаНадокумент.ВалютаДокумента;
	КурсВзаиморасчетов = СсылкаНадокумент.КурсВзаиморасчетов;
	КратностьВзаиморасчетов = СсылкаНадокумент.КратностьВзаиморасчетов;
	Если СчетФактура.ВалютаДокумента <> ВалютаДокумента Тогда
		Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Значение реквизита ""Валюта документа"" равное """
		+ СчетФактура.ВалютаДокумента + """ в счете-фактуре, отличается от значения в документе """ + СсылкаНадокумент + """ равное """ + ВалютаДокумента + """", СтатусСообщения.Внимание);		
		Возврат;		
	КонецЕсли;
	Если СчетФактура.КурсВзаиморасчетов <> КурсВзаиморасчетов Тогда
		Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Значение реквизита ""Курс взаиморасчетов"" равное """
		+ СчетФактура.КурсВзаиморасчетов + """ в счете-фактуре, отличается от значения в документе """ + СсылкаНадокумент + """ равное """ + КурсВзаиморасчетов + """", СтатусСообщения.Внимание);		
		Возврат;		
	КонецЕсли;
	Если СчетФактура.КратностьВзаиморасчетов <> КратностьВзаиморасчетов Тогда
		Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Значение реквизита ""Кратность взаиморасчетов"" равное """
		+ СчетФактура.КратностьВзаиморасчетов + """ в счете-фактуре, отличается от значения в документе """ + СсылкаНадокумент + """ равное """ + КратностьВзаиморасчетов + """", СтатусСообщения.Внимание);		
		Возврат;		
	КонецЕсли;
	
	СуммаВключаетНДС = СчетФактура.СуммаВключаетНДС;
	Если УчитыватьАкциз Тогда
	СуммаВключаетАкциз = СчетФактура.СуммаВключаетАкциз;
	КонецЕсли;
	Количество = 0;
	СуммаАкциза = 0;
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Таблица = СчетФактура.Товары;
		НайденныеСтрокиТовары = Таблица.НайтиСтроки(Новый Структура("Номенклатура, СтавкаНДС", Номенклатура, Выборка.СтавкаНДС));
		
		Таблица = СчетФактура.Услуги;
		НайденныеСтрокиУслуги = Таблица.НайтиСтроки(Новый Структура("Номенклатура, СтавкаНДС", Номенклатура, Выборка.СтавкаНДС));
		
		Если НайденныеСтрокиТовары.Количество() = 0 и НайденныеСтрокиУслуги.Количество() = 0 Тогда
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Не найден товар\услуга """
			+ Номенклатура + """:" + Символы.ПС + "Ставка НДС = "
			+ Выборка.СтавкаНДС + "; Единица измерения = " + Выборка.ЕдиницаИзмерения + ";", СтатусСообщения.Внимание);		
			Возврат;
		КонецЕсли;
		Если НайденныеСтрокиТовары.Количество() > 0 и НайденныеСтрокиУслуги.Количество() > 0 Тогда
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
			+ Символы.ПС + "В документе введено несколько товаров\услуг """
			+ Номенклатура + """ с одинаковыми характеристиками:" + Символы.ПС + "Ставка НДС = "
			+ Выборка.СтавкаНДС + "; Единица измерения = " + Выборка.ЕдиницаИзмерения + ";", СтатусСообщения.Внимание);
			Возврат;			
		КонецЕсли;
		
		ЕдиницаИзмеренияИзКлассификатора = СчетФактура.Метаданные().ТабличныеЧасти.Товары.Реквизиты.ЕдиницаИзмерения.Тип = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");			
		Количество = Неопределено;
		Сумма = Неопределено;
		СуммаНДС = Неопределено;
		СуммаАкциза = Неопределено;
		Для каждого Строка из НайденныеСтрокиТовары Цикл
			Если Строка.Цена <> Окр(Выборка.Цена, 2) Тогда
				Продолжить;
			КонецЕсли;
			Если ЕдиницаИзмеренияИзКлассификатора Тогда
				Если Строка.ЕдиницаИзмерения <> Выборка.ЕдиницаИзмерения Тогда
					Продолжить;
				КонецЕсли;
			Иначе
				Если Строка.ЕдиницаИзмерения.ЕдиницаПоКлассификатору <> Выборка.ЕдиницаИзмерения Тогда
					Продолжить;
				КонецЕсли;			
			КонецЕсли;
			Если Количество <> Неопределено и Строка.Количество = Количество Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""ТМЗ"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Номенклатура = " + Номенклатура + "; Количество = " + Строка(Строка.Количество) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + "; Единица измерения = " + Строка.ЕдиницаИзмерения + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(Строка.Количество) = ПолучитьМодульЧисла(Выборка.Количество) Тогда
				Количество = Строка.Количество;				
			КонецЕсли;
			Если СуммаВключаетНДС Тогда
				СуммаБезНалогов = Строка.Сумма - Строка.СуммаНДС;
			Иначе
				СуммаБезНалогов = Строка.Сумма;
			КонецЕсли;
			Если УчитыватьАкциз Тогда
				Если СуммаВключаетАкциз Тогда 
					СуммаБезНалогов = СуммаБезНалогов - Строка.СуммаАкциза;
				КонецЕсли;
			КонецЕсли;
			
			Если Сумма <> Неопределено и СуммаБезНалогов = Сумма Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""ТМЗ"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Номенклатура = " + Номенклатура + "; Сумма = " + Строка(Строка.Сумма) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + "; Единица измерения = " + Строка.ЕдиницаИзмерения + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(СуммаБезНалогов) = ПолучитьМодульЧисла(Выборка.Сумма) Тогда
				Сумма = СуммаБезНалогов;				
			КонецЕсли;	
			Если СуммаНДС <> Неопределено и Строка.СуммаНДС = СуммаНДС Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""ТМЗ"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Номенклатура = " + Номенклатура + "; Сумма НДС = " + Строка(Строка.СуммаНДС) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + "; Единица измерения = " + Строка.ЕдиницаИзмерения + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(Строка.СуммаНДС) = ПолучитьМодульЧисла(Выборка.СуммаНДС) Тогда
				СуммаНДС = Строка.СуммаНДС;				
			КонецЕсли;
			Если УчитыватьАкциз Тогда
				Если СуммаАкциза <> Неопределено и Строка.СуммаАкциза = СуммаАкциза Тогда
					Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
					+ Символы.ПС + "В табличной части ""ТМЗ"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
					+ "Номенклатура = " + Номенклатура + "; Сумма НДС = " + Строка(Строка.СуммаНДС) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
					+ Строка.СтавкаНДС + "; Единица измерения = " + Строка.ЕдиницаИзмерения + ";", СтатусСообщения.Внимание);
					Возврат;
				ИначеЕсли ПолучитьМодульЧисла(Строка.СуммаАкциза) = ПолучитьМодульЧисла(Выборка.СуммаАкциза) Тогда
					СуммаАкциза = Строка.СуммаАкциза;				
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
		Если Количество = Неопределено или Сумма = Неопределено или СуммаНДС = Неопределено или (УчитыватьАкциз и СуммаАкциза = Неопределено) Тогда
			
		Количество = Неопределено;
		Сумма = Неопределено;
		СуммаНДС = Неопределено;
		Для каждого Строка из НайденныеСтрокиУслуги Цикл
			Если Строка.Цена <> Окр(Выборка.Цена, 2) Тогда
				Продолжить;
			КонецЕсли;						
			Если Количество <> Неопределено и Строка.Количество = Количество Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""ТМЗ"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Номенклатура = " + Номенклатура + "; Количество = " + Строка(Строка.Количество) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(Строка.Количество) = ПолучитьМодульЧисла(Выборка.Количество) Тогда
				Количество = Строка.Количество;								
			КонецЕсли;
			Если СуммаВключаетНДС Тогда
				СуммаБезНалогов = Строка.Сумма - Строка.СуммаНДС;
			Иначе
				СуммаБезНалогов = Строка.Сумма;
			КонецЕсли;	
			Если Сумма <> Неопределено и СуммаБезНалогов = Сумма Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""Услуги"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Номенклатура = " + Номенклатура + "; Сумма = " + Строка(Строка.Сумма) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(СуммаБезНалогов) = ПолучитьМодульЧисла(Выборка.Сумма) Тогда
				Сумма = СуммаБезНалогов;								
			КонецЕсли;	
			Если СуммаНДС <> Неопределено и Строка.СуммаНДС = СуммаНДС Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""Услуги"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Номенклатура = " + Номенклатура + "; Сумма НДС = " + Строка(Строка.СуммаНДС) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(Строка.СуммаНДС) = ПолучитьМодульЧисла(Выборка.СуммаНДС) Тогда
				СуммаНДС = Строка.СуммаНДС;				
			КонецЕсли;	
		КонецЦикла;	
		
		Если Количество = Неопределено или Сумма = Неопределено или СуммаНДС = Неопределено Тогда
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Не найдена операция с товаром\услугой """
			+ Номенклатура + """:" + Символы.ПС + "Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
			+ Выборка.СтавкаНДС + "; Единица измерения = " + Выборка.ЕдиницаИзмерения + ";", СтатусСообщения.Внимание);		
			Возврат;			
		КонецЕсли;
	КонецЕсли;
	
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		
		Таблица = СчетФактура.ОС;
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("ОсновноеСредство, СтавкаНДС",
		Номенклатура,
		Выборка.СтавкаНДС));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Не найдено основное средство """
			+ Номенклатура + """:" + Символы.ПС + "Ставка НДС = "
			+ Выборка.СтавкаНДС + ";", СтатусСообщения.Внимание);			
			Возврат;
		КонецЕсли;
		
		Сумма = Неопределено;
		СуммаНДС = Неопределено;
		СуммаАкциза = Неопределено;
		Количество = 1;
		Для каждого Строка из НайденныеСтроки Цикл
			Если СуммаВключаетНДС Тогда
				СуммаБезНалогов = Строка.Сумма - Строка.СуммаНДС;
			Иначе
				СуммаБезНалогов = Строка.Сумма;
			КонецЕсли;	
			Если Сумма <> Неопределено и СуммаБезНалогов = Сумма Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""ОС"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Основное средство = " + Номенклатура + "; Сумма = " + Строка(Строка.Сумма) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(СуммаБезНалогов) = ПолучитьМодульЧисла(Выборка.Сумма) Тогда
				Сумма = СуммаБезНалогов;								
			КонецЕсли;	
			Если СуммаНДС <> Неопределено и Строка.СуммаНДС = СуммаНДС Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""ОС"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Основное средство = " + Номенклатура + "; Сумма НДС = " + Строка(Строка.СуммаНДС) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(Строка.СуммаНДС) = ПолучитьМодульЧисла(Выборка.СуммаНДС) Тогда
				СуммаНДС = Строка.СуммаНДС;				
			КонецЕсли;	
		КонецЦикла;
		
		Если Сумма = Неопределено или СуммаНДС = Неопределено Тогда
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Не найдена операция с основным средством """
			+ Номенклатура + """:" + Символы.ПС + "Ставка НДС = "
			+ Выборка.СтавкаНДС + ";", СтатусСообщения.Внимание);			
			Возврат;
		КонецЕсли;
		
	Количество = ?(Сумма < 0, -1, 1);		
		
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.НематериальныеАктивы") Тогда
		Таблица = СчетФактура.НМА;
		НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура("НематериальныйАктив, СтавкаНДС",
		Номенклатура,
		Выборка.СтавкаНДС));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Не найден нематериальный актив """
			+ Номенклатура + """:" + Символы.ПС + "Ставка НДС = "
			+ Выборка.СтавкаНДС + ";", СтатусСообщения.Внимание);			
			Возврат;
		КонецЕсли;
		
		Сумма = Неопределено;
		Для каждого Строка из НайденныеСтроки Цикл
			Если СуммаВключаетНДС Тогда
				СуммаБезНалогов = Строка.Сумма - Строка.СуммаНДС;
			Иначе
				СуммаБезНалогов = Строка.Сумма;
			КонецЕсли;	
			Если Сумма <> Неопределено и СуммаБезНалогов = Сумма Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""НМА"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Нематериальный актив = " + Номенклатура + "; Сумма = " + Строка(Строка.Сумма) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(СуммаБезНалогов) = ПолучитьМодульЧисла(Выборка.Сумма) Тогда
				Сумма = СуммаБезНалогов;								
			КонецЕсли;	
			Если СуммаНДС <> Неопределено и Строка.СуммаНДС = СуммаНДС Тогда
				Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:"
				+ Символы.ПС + "В табличной части ""НМА"" введено несколько операций с одинаковыми характеристиками:""" + Символы.ПС
				+ "Нематериальный актив = " + Номенклатура + "; Сумма НДС = " + Строка(Строка.СуммаНДС) + "; Цена = " + Строка(Выборка.Цена) + "; Ставка НДС = "
				+ Строка.СтавкаНДС + ";", СтатусСообщения.Внимание);
				Возврат;
			ИначеЕсли ПолучитьМодульЧисла(Строка.СуммаНДС) = ПолучитьМодульЧисла(Выборка.СуммаНДС) Тогда
				СуммаНДС = Строка.СуммаНДС;				
			КонецЕсли;
		КонецЦикла;	
		
		Если Сумма = Неопределено или СуммаНДС = Неопределено Тогда
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """:" + Символы.ПС + "Не найдена операция с нематериальным активом """
			+ Номенклатура + """:" + Символы.ПС + "Ставка НДС = "
			+ Выборка.СтавкаНДС + ";", СтатусСообщения.Внимание);			
			Возврат;
		КонецЕсли;		
			Количество = ?(Сумма < 0, -1, 1);		
	Иначе
			Сообщить("Не удалось заполнить данные из дополнительного счета-фактуры """ + СчетФактура + """");
		Возврат;
	КонецЕсли;
		
	Запись.Количество 		= Количество;
	
	Запись.СуммаБезНалогов 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Сумма, 
	ВалютаДокумента, ВалютаРегламентированногоУчета,
	КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
	КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);
	
	Запись.СуммаНДС 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СуммаНДС, 
	ВалютаДокумента, ВалютаРегламентированногоУчета,
	КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
	КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);					
	
	Если УчитыватьАкциз Тогда
		Запись.Акциз 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(СуммаАкциза, 
		ВалютаДокумента, ВалютаРегламентированногоУчета,
		КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);					
	КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выполняет движения по мониторингу реализации
//
Процедура ВыполнитьДвиженияПоМониторингуРеализации(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт 
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	//Делаем проверку на правильность обращения к перечислению
	//в конфигурации "Бухгалтерии для Казахстана" релиз 1.5.5.4 и ниже, 
	//использовалось перечисление "ВидыОперацийРеализацииТоваровУслуг"
	//начиная с версии 1.5.6.11 используется перечисление "ВидыОперацийРеализацияТоваров"
	Если Метаданные.Перечисления.Найти("ВидыОперацийРеализацияТоваров") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацияТоваров"].ПередачаСтруктурномуПодразделению);
	ИначеЕсли  Метаданные.Перечисления.Найти("ВидыОперацийРеализацииТоваровУслуг") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацииТоваровУслуг"].ПередачаСтруктурномуПодразделению);	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеОС", Перечисления.ВидыОперацийПередачиОС.ПередачаСтруктурномуПодразделению);		
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.СчетДоходовБУ,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.СтавкаНДС,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.ОснованиеВозврата,
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.СуммаАкциза,
	               |	моп_ОбъектыМониторинга.ПинКод,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА (НЕ ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL )
	               |				И ВложенныйЗапрос.Контрагент.Ссылка <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				И (ВложенныйЗапрос.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |					И (НЕ ВложенныйЗапрос.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус))
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL 
	               |				ИЛИ ВложенныйЗапрос.Контрагент.Ссылка = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК КонтрагентЯвляетсяЧастнымЛицом
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВозвратТоваровОтПокупателяТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |		ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент КАК Контрагент,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВозвратТоваровОтПокупателяТовары.Цена КАК Цена,
	               |		ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |					И ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС - ВозвратТоваровОтПокупателяТовары.СуммаАкциза
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаАкциза
	               |			ИНАЧЕ ВозвратТоваровОтПокупателяТовары.Сумма
	               |		КОНЕЦ КАК Сумма,
	               |		ВозвратТоваровОтПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	               |		ВозвратТоваровОтПокупателяТовары.СуммаНДС КАК СуммаНДС,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Дата КАК Дата,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка КАК СсылкаНаДокумент,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.ДокументОснование КАК ОснованиеВозврата,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Организация КАК Организация,
	               |		ВозвратТоваровОтПокупателяТовары.СуммаАкциза КАК СуммаАкциза,
	               |		ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	               |	ГДЕ
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен = ИСТИНА
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровОтПокупателяУслуги.СчетДоходовБУ,
	               |		ВозвратТоваровОтПокупателяУслуги.Номенклатура,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Контрагент,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.ДоговорКонтрагента,
	               |		ВозвратТоваровОтПокупателяУслуги.Цена,
	               |		ВозвратТоваровОтПокупателяУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровОтПокупателяУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровОтПокупателяУслуги.Сумма - ВозвратТоваровОтПокупателяУслуги.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровОтПокупателяУслуги.Сумма
	               |		КОНЕЦ,
	               |		ВозвратТоваровОтПокупателяУслуги.СтавкаНДС,
	               |		ВозвратТоваровОтПокупателяУслуги.СуммаНДС,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Дата,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.ДокументОснование,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Организация,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.ВозвратТоваровОтПокупателя.Услуги КАК ВозвратТоваровОтПокупателяУслуги
	               |	ГДЕ
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.Проведен = ИСТИНА
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.СчетДоходовБУ,
	               |		РеализацияТоваровУслугТовары.Номенклатура,
	               |		РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугТовары.Цена,
	               |		РеализацияТоваровУслугТовары.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |					И РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС - РеализацияТоваровУслугТовары.СуммаАкциза
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаАкциза
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугТовары.СтавкаНДС,
	               |		РеализацияТоваровУслугТовары.СуммаНДС,
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата,
	               |		РеализацияТоваровУслугТовары.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияТоваровУслугТовары.Ссылка.Организация,
	               |		РеализацияТоваровУслугТовары.СуммаАкциза,
	               |		РеализацияТоваровУслугТовары.ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Номенклатура,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Контрагент,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Цена,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	               |		АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка,
	               |		0,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация,
	               |		0,
	               |		АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	               |	ГДЕ
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация = &Организация
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаНМА.СчетДоходовБУ,
	               |		ПередачаНМА.НематериальныйАктив,
	               |		ПередачаНМА.Контрагент,
	               |		ПередачаНМА.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		ПередачаНМА.СтавкаНДС,
	               |		ПередачаНМА.СуммаНДС,
	               |		ПередачаНМА.Дата,
	               |		ПередачаНМА.Ссылка,
	               |		0,
	               |		ПередачаНМА.Организация,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаНМА КАК ПередачаНМА
	               |	ГДЕ
	               |		ПередачаНМА.Дата >= &НачДата
	               |		И ПередачаНМА.Дата <= &КонДата
	               |		И ПередачаНМА.Организация = &Организация
	               |		И ПередачаНМА.Проведен = ИСТИНА
	               |		И ПередачаНМА.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаОСОС.СчетДоходовБУ,
	               |		ПередачаОСОС.ОсновноеСредство,
	               |		ПередачаОСОС.Ссылка.Контрагент,
	               |		ПередачаОСОС.Ссылка.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		ПередачаОСОС.СтавкаНДС,
	               |		ПередачаОСОС.СуммаНДС,
	               |		ПередачаОСОС.Ссылка.Дата,
	               |		ПередачаОСОС.Ссылка.Ссылка,
	               |		0,
	               |		ПередачаОСОС.Ссылка.Организация,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаОС.ОС КАК ПередачаОСОС
	               |	ГДЕ
	               |		ПередачаОСОС.Ссылка.Дата >= &НачДата
	               |		И ПередачаОСОС.Ссылка.Дата <= &КонДата
	               |		И ПередачаОСОС.Ссылка.Организация = &Организация
	               |		И ПередачаОСОС.Ссылка.Проведен = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И ПередачаОСОС.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеОС
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугУслуги.СчетДоходовБУ,
	               |		РеализацияТоваровУслугУслуги.Номенклатура,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугУслуги.Цена,
	               |		РеализацияТоваровУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.СтавкаНДС,
	               |		РеализацияТоваровУслугУслуги.СуммаНДС,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Организация,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеУслуги.Номенклатура,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеУслуги.Цена,
	               |		РеализацияУслугПоПереработкеУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.СтавкаНДС,
	               |		РеализацияУслугПоПереработкеУслуги.СуммаНДС,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Организация,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП";					   			
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингРеализации.СоздатьНаборЗаписей();	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	ДоступенРеквизитОсновнойСчетФактура = ?(Метаданные.Документы.СчетФактураВыданный.Реквизиты.Найти("ОсновнойСчетФактура") = Неопределено, Ложь, Истина);
	
	ИспользоватьДанныеИзДополнительныхСчетовФактур = моп_Общий.ИспользоватьДанныеИзДополнительныхСчетовФактур(ДанныеДокумента.Дата);
	Если ИспользоватьДанныеИзДополнительныхСчетовФактур = Неопределено Тогда
		ИспользоватьДанныеИзДополнительныхСчетовФактур = Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.СсылкаНаДокумент;
				
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;
		Движение.Счет 				= Выборка.СчетДоходовБУ;
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ПинКод             = Выборка.ПинКод;
		Движение.КодТНВЭД           = Выборка.КодТНВЭД;
		
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Движение.Контрагент 		= Выборка.Контрагент;	
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.СчетФактура 		= ОбщегоНазначения.НайтиПодчиненныйДокумент(Док, "СчетФактураВыданный");
		
		Если ЗначениеЗаполнено(Движение.СчетФактура) Тогда								
			Движение.СчетФактураЯвляетсяДополнительным = Движение.СчетФактура.Дополнительная;
			Если ДоступенРеквизитОсновнойСчетФактура Тогда
				Движение.СчетФактураКорректируемый = Движение.СчетФактура.ОсновнойСчетФактура;				
			КонецЕсли;
		КонецЕсли;	
		
		ДанныеКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Выборка.Дата);		
		
		Если ИспользоватьДанныеИзДополнительныхСчетовФактур и ЗначениеЗаполнено(Движение.СчетФактура) и Движение.СчетФактураЯвляетсяДополнительным Тогда
			ЗаполнитьДанныеИзДополнительногоСчетаФактуры(Движение.СчетФактура, Движение, Выборка, ДанныеКурсаВалюты, ВалютаРегламентированногоУчета, Истина);
		Иначе
		
		Движение.Количество 		= Выборка.Количество;
		
		Движение.СуммаБезНалогов 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
		Док.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Док.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Док.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);		
				
		Движение.Акциз 				= ?(Выборка.СуммаАкциза = NULL, 0 , Выборка.СуммаАкциза);
		
		Движение.СуммаНДС 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, 
		Док.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Док.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Док.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
	    КонецЕсли;
		
		Движение.СтавкаНДС 			= Выборка.СтавкаНДС;		
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);
		
		Если Не ЗначениеЗаполнено(Движение.СчетФактураКорректируемый) Тогда
			Если ЗначениеЗаполнено(Выборка.ОснованиеВозврата) Тогда
				Движение.СчетФактураКорректируемый = ОбщегоНазначения.НайтиПодчиненныйДокумент(Выборка.ОснованиеВозврата, "СчетФактураВыданный");
			КонецЕсли;			
		КонецЕсли; 
		
		Движение.СсылкаНаДокумент 	= Док;
		Движение.Организация 		= Выборка.Организация;
		Движение.КонтрагентЯвляетсяЧастнымЛицом = Выборка.КонтрагентЯвляетсяЧастнымЛицом;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
		
КонецПроцедуры

// Выполняет движения по мониторингу покупок
//
Процедура ВыполнитьДвиженияПоМониторингуПокупок(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВидОперацииИмпорт", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);
	Запрос.УстановитьПараметр("ВидСубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоТиповые.ОсновныеСредства);
	Запрос.УстановитьПараметр("ВидСубконтоНоменклатура", ПланыВидовХарактеристик.ВидыСубконтоТиповые.Номенклатура);
	Запрос.УстановитьПараметр("ВидСубконтоНМА", ПланыВидовХарактеристик.ВидыСубконтоТиповые.НематериальныеАктивы);	
	Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтСтруктурногоПодразделения);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	               |	МАКСИМУМ(ВложенныйЗапрос.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ВложенныйЗапрос.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ВложенныйЗапрос.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ВложенныйЗапрос.Организация) КАК Организация
	               |ПОМЕСТИТЬ ВТ_ПоступлениеНМА
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеНМА.Ссылка КАК Ссылка,
	               |		ПоступлениеНМА.Дата КАК Дата,
	               |		ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПоступлениеНМА.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПоступлениеНМА.Контрагент КАК Контрагент,
	               |		ПоступлениеНМА.Организация КАК Организация
	               |	ИЗ
	               |		Документ.ПоступлениеНМА КАК ПоступлениеНМА
	               |	ГДЕ
	               |		ПоступлениеНМА.Дата >= &НачДата
	               |		И ПоступлениеНМА.Дата <= &КонДата
	               |		И ПоступлениеНМА.Организация = &Организация
	               |		И ПоступлениеНМА.Проведен) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО ВложенныйЗапрос.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Дата) КАК Дата,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Организация) КАК Организация,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.ДоговорКонтрагента) КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслуг
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |		ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |		ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |		ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |		ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |	ГДЕ
	               |		ПоступлениеТоваровУслуг.Дата >= &НачДата
	               |		И ПоступлениеТоваровУслуг.Дата <= &КонДата
	               |		И ПоступлениеТоваровУслуг.ВидОперации <> &ВидОперацииИмпорт
	               |		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	               |		И ПоступлениеТоваровУслуг.Организация = &Организация
	               |		И ПоступлениеТоваровУслуг.ВидОперации <> &ВидОперацииСтруктурные) КАК ПоступлениеТоваровУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ПоступлениеТоваровУслуг.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ПоступлениеТоваровУслуг)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НДСЗаНерезидентаОбороты.ДокументПоступления КАК ДокументПоступления,
	               |	НДСЗаНерезидентаОбороты.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_НДСЗаНерезидента
	               |ИЗ
	               |	РегистрНакопления.НДСЗаНерезидента.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Налогоплательщик = &Организация
	               |				И ДокументПоступления В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеТоваровУслуг
	               |			
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |					ВЫБРАТЬ
	               |						ВТ_ПоступлениеНМА.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеНМА)) КАК НДСЗаНерезидентаОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументПоступления,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	               |	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК СчетУчетаБУ,
	               |	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугТовары
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
	               |	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
	               |	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугУслуги.СчетЗатратБУ
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугУслуги
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг)
	               |	И (НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |				(ВЫБРАТЬ
	               |					ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |					ВТ_НДСЗаНерезидента.Номенклатура
	               |				ИЗ
	               |					ВТ_НДСЗаНерезидента))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугОС.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслугОС.ОсновноеСредство КАК ОсновноеСредство,
	               |	ПоступлениеТоваровУслугОС.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугОС.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугОС.СчетУчетаБУ КАК Счет,
	               |	ПоступлениеТоваровУслугОС.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугОС.СчетУчетаБУ
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугОС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |ГДЕ
	               |	ПоступлениеТоваровУслугОС.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	СУММА(ВложенныйЗапрос.СуммаПоступленияВсего) КАК СуммаПоступленияВсего
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугСуммаПоступлений
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |		СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК СуммаПоступленияВсего
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПоступлениеТоваровУслугТовары.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугУслуги.Ссылка,
	               |		СУММА(ПоступлениеТоваровУслугУслуги.Сумма)
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугУслуги КАК ПоступлениеТоваровУслугУслуги
	               |	ГДЕ
	               |		(НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |					(ВЫБРАТЬ
	               |						ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |						ВТ_НДСЗаНерезидента.Номенклатура
	               |					ИЗ
	               |						ВТ_НДСЗаНерезидента))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПоступлениеТоваровУслугУслуги.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугОС.Ссылка,
	               |		СУММА(ПоступлениеТоваровУслугОС.Сумма)
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугОС КАК ПоступлениеТоваровУслугОС
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПоступлениеТоваровУслугОС.Ссылка) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	               |	МАКСИМУМ(ВложенныйЗапрос.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ВложенныйЗапрос.Организация) КАК Организация,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДокументОснование) КАК ДокументОснование,
	               |	МАКСИМУМ(ВложенныйЗапрос.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ВложенныйЗапрос.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.ВалютаДокумента) КАК ВалютаДокумента
	               |ПОМЕСТИТЬ ВТ_ВозвратТоваровПоставщику
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
	               |		ВозвратТоваровПоставщику.Дата КАК Дата,
	               |		ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
	               |		ВозвратТоваровПоставщику.Организация КАК Организация,
	               |		ВозвратТоваровПоставщику.ДокументОснование КАК ДокументОснование,
	               |		ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ВозвратТоваровПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВозвратТоваровПоставщику.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ВозвратТоваровПоставщику.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	               |	ГДЕ
	               |		ВозвратТоваровПоставщику.Дата >= &НачДата
	               |		И ВозвратТоваровПоставщику.Дата <= &КонДата
	               |		И ВозвратТоваровПоставщику.Организация = &Организация
	               |		И ВозвратТоваровПоставщику.Проведен) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО ВложенныйЗапрос.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ВложенныйЗапрос.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ВложенныйЗапрос.Организация) КАК Организация,
	               |	МАКСИМУМ(ВложенныйЗапрос.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ВложенныйЗапрос.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ВложенныйЗапрос.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ВложенныйЗапрос.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.СчетЗатратБУ) КАК СчетЗатратБУ
	               |ПОМЕСТИТЬ ВТ_ПоступлениеИзПереработки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеИзПереработки.Ссылка КАК Ссылка,
	               |		ПоступлениеИзПереработки.Контрагент КАК Контрагент,
	               |		ПоступлениеИзПереработки.Организация КАК Организация,
	               |		ПоступлениеИзПереработки.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПоступлениеИзПереработки.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеИзПереработки.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеИзПереработки.Дата КАК Дата,
	               |		ПоступлениеИзПереработки.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеИзПереработки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПоступлениеИзПереработки.СчетЗатратБУ КАК СчетЗатратБУ
	               |	ИЗ
	               |		Документ.ПоступлениеИзПереработки КАК ПоступлениеИзПереработки
	               |	ГДЕ
	               |		ПоступлениеИзПереработки.Дата >= &НачДата
	               |		И ПоступлениеИзПереработки.Дата <= &КонДата
	               |		И ПоступлениеИзПереработки.Организация = &Организация
	               |		И ПоступлениеИзПереработки.Проведен) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО ВложенныйЗапрос.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АвансовыйОтчет.Ссылка КАК Ссылка,
	               |	АвансовыйОтчет.ВалютаДокумента,
	               |	АвансовыйОтчет.КратностьДокумента,
	               |	АвансовыйОтчет.КурсДокумента,
	               |	АвансовыйОтчет.Дата,
	               |	АвансовыйОтчет.СуммаВключаетНДС,
	               |	АвансовыйОтчет.Организация
	               |ПОМЕСТИТЬ ВТ_АвансовыйОтчет
	               |ИЗ
	               |	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	               |ГДЕ
	               |	АвансовыйОтчет.Дата >= &НачДата
	               |	И АвансовыйОтчет.Дата <= &КонДата
	               |	И АвансовыйОтчет.Организация = &Организация
	               |	И АвансовыйОтчет.Проведен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.СтавкаНДС,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.Счет,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.ОснованиеВозврата,
	               |	ВложенныйЗапрос.Сумма,
	               |	моп_ОбъектыМониторинга.ПинКод,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.ВалютаДокумента,
	               |	ВложенныйЗапрос.СчетФактура,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КурсВзаиморасчетов, 0) КАК КурсВзаиморасчетов,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КратностьВзаиморасчетов, 0) КАК КратностьВзаиморасчетов,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаИПН, 0) КАК СуммаИПН,
	               |	ВЫБОР
	               |		КОГДА (НЕ ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL )
	               |				И ВложенныйЗапрос.Контрагент.Ссылка <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				И (ВложенныйЗапрос.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |					И (НЕ ВложенныйЗапрос.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус))
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL 
	               |				ИЛИ ВложенныйЗапрос.Контрагент.Ссылка = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК КонтрагентЯвляетсяЧастнымЛицом
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслуг.Ссылка КАК СсылкаНаДокумент,
	               |		ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |		ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |		ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	               |		ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |		ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |		ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК Счет,
	               |		ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |		0 КАК ОснованиеВозврата,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |		КОНЕЦ КАК Сумма,
	               |		Налоги.СуммаИПНВсего * ПоступлениеТоваровУслугТовары.Сумма / Поступления.СуммаПоступленияВсего КАК СуммаИПН,
	               |		ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.СчетФактура КАК СчетФактура
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
	               |			ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК СуммаИПНВсего
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг)
	               |				И РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.Проведен
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО (ПоступлениеТоваровУслугТовары.Ссылка = Налоги.ДокументОснованиеСсылка)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугСуммаПоступлений КАК Поступления
	               |			ПО (ПоступлениеТоваровУслугТовары.Ссылка = Поступления.Ссылка)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслуг.Ссылка,
	               |		ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |		ПоступлениеТоваровУслуг.Контрагент,
	               |		ПоступлениеТоваровУслуг.Организация,
	               |		ПоступлениеТоваровУслугУслуги.Номенклатура,
	               |		ПоступлениеТоваровУслугУслуги.Цена,
	               |		ПоступлениеТоваровУслугУслуги.Количество,
	               |		ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	               |		ПоступлениеТоваровУслугУслуги.СуммаНДС,
	               |		ПоступлениеТоваровУслугУслуги.СчетЗатратБУ,
	               |		ПоступлениеТоваровУслуг.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеТоваровУслугУслуги.Сумма / Поступления.СуммаПоступленияВсего,
	               |		NULL,
	               |		ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |		ПоступлениеТоваровУслуг.КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.КурсВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.СчетФактура
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугУслуги КАК ПоступлениеТоваровУслугУслуги
	               |			ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугСуммаПоступлений КАК Поступления
	               |			ПО (ПоступлениеТоваровУслугУслуги.Ссылка = Поступления.Ссылка)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг)
	               |				И РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.Проведен
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО (ПоступлениеТоваровУслугУслуги.Ссылка = Налоги.ДокументОснованиеСсылка)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугОС.Ссылка,
	               |		ПоступлениеТоваровУслугОС.ДоговорКонтрагента,
	               |		ПоступлениеТоваровУслугОС.Контрагент,
	               |		ПоступлениеТоваровУслугОС.Организация,
	               |		ПоступлениеТоваровУслугОС.ОсновноеСредство,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугОС.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ПоступлениеТоваровУслугОС.СтавкаНДС,
	               |		ПоступлениеТоваровУслугОС.СуммаНДС,
	               |		ПоступлениеТоваровУслугОС.СчетУчетаБУ,
	               |		ПоступлениеТоваровУслугОС.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугОС.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеТоваровУслугОС.Сумма / Поступления.Сумма,
	               |		NULL,
	               |		ПоступлениеТоваровУслугОС.ВалютаДокумента,
	               |		ПоступлениеТоваровУслугОС.КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровУслугОС.КурсВзаиморасчетов,
	               |		ПоступлениеТоваровУслугОС.СчетФактура
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ПоступлениеТоваровУслугОС.Ссылка КАК Ссылка,
	               |			ПоступлениеТоваровУслугОС.ОсновноеСредство КАК ОсновноеСредство,
	               |			ПоступлениеТоваровУслугОС.Сумма КАК Сумма,
	               |			ПоступлениеТоваровУслугОС.СтавкаНДС КАК СтавкаНДС,
	               |			ПоступлениеТоваровУслугОС.СуммаНДС КАК СуммаНДС,
	               |			ПоступлениеТоваровУслугОС.СчетУчетаБУ КАК СчетУчетаБУ,
	               |			ПоступлениеТоваровУслуг.СчетФактура КАК СчетФактура,
	               |			ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |			ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |			ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |			ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |			ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |			ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |			ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			ПоступлениеТоваровУслуг.Организация КАК Организация
	               |		ИЗ
	               |			ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |				ПО ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугОС.Ссылка) КАК ПоступлениеТоваровУслугОС
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |				СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК Сумма
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугТовары.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугТовары.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугУслуги.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугУслуги.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугУслуги.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугУслуги.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугОС.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугОС.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугОС.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугОС.Ссылка) КАК ВложенныйЗапрос
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВложенныйЗапрос.Ссылка) КАК Поступления
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг)
	               |				И РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.Проведен
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = Налоги.ДокументОснованиеСсылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеДопРасходов.Ссылка,
	               |		ПоступлениеДопРасходов.ДоговорКонтрагента,
	               |		ПоступлениеДопРасходов.Контрагент,
	               |		ПоступлениеДопРасходов.Организация,
	               |		ТиповойДвиженияССубконто.СубконтоДт1,
	               |		ТиповойДвиженияССубконто.Сумма,
	               |		0,
	               |		НДСКВозмещению.СтавкаНДС,
	               |		ЕСТЬNULL(НДСКВозмещению.УплаченныйНДС, 0),
	               |		ТиповойДвиженияССубконто.СчетДт,
	               |		ПоступлениеДопРасходов.Дата,
	               |		0,
	               |		ТиповойДвиженияССубконто.Сумма,
	               |		NULL,
	               |		NULL,
	               |		ПоступлениеДопРасходов.ВалютаДокумента,
	               |		ПоступлениеДопРасходов.КратностьВзаиморасчетов,
	               |		ПоступлениеДопРасходов.КурсВзаиморасчетов,
	               |		ПоступлениеДопРасходов.СчетФактура
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ПоступлениеДопРасходов.Ссылка КАК Ссылка,
	               |			&ВалютаРегУчета КАК ВалютаДокумента,
	               |			1 КАК КратностьВзаиморасчетов,
	               |			1 КАК КурсВзаиморасчетов,
	               |			МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |			МАКСИМУМ(ПоступлениеДопРасходов.Дата) КАК Дата,
	               |			МАКСИМУМ(ПоступлениеДопРасходов.Контрагент) КАК Контрагент,
	               |			МАКСИМУМ(ПоступлениеДопРасходов.Организация) КАК Организация,
	               |			МАКСИМУМ(ПоступлениеДопРасходов.ДоговорКонтрагента) КАК ДоговорКонтрагента
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ПоступлениеДопРасходов.Ссылка КАК Ссылка,
	               |				ПоступлениеДопРасходов.Дата КАК Дата,
	               |				ПоступлениеДопРасходов.Контрагент КАК Контрагент,
	               |				ПоступлениеДопРасходов.Организация КАК Организация,
	               |				ПоступлениеДопРасходов.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |			ИЗ
	               |				Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	               |			ГДЕ
	               |				ПоступлениеДопРасходов.Дата >= &НачДата
	               |				И ПоступлениеДопРасходов.Дата <= &КонДата
	               |				И ПоступлениеДопРасходов.Организация = &Организация
	               |				И ПоступлениеДопРасходов.Проведен) КАК ПоступлениеДопРасходов
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |				ПО ПоступлениеДопРасходов.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ПоступлениеДопРасходов.Ссылка) КАК ПоступлениеДопРасходов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ТиповойДвиженияССубконто.Регистратор КАК Регистратор,
	               |				ТиповойДвиженияССубконто.СчетДт КАК СчетДт,
	               |				ТиповойДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |				ТиповойДвиженияССубконто.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	               |				СУММА(ТиповойДвиженияССубконто.Сумма) КАК Сумма
	               |			ИЗ
	               |				РегистрБухгалтерии.Типовой.ДвиженияССубконто(
	               |						,
	               |						,
	               |						(ВидСубконтоДт1 = &ВидСубконтоОС
	               |							ИЛИ ВидСубконтоДт1 = &ВидСубконтоНоменклатура
	               |							ИЛИ ВидСубконтоДт1 = &ВидСубконтоНМА)
	               |							И Регистратор.Дата >= &НачДата
	               |							И Регистратор.Дата <= &КонДата
	               |							И Регистратор.Организация = &Организация) КАК ТиповойДвиженияССубконто
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ТиповойДвиженияССубконто.ВидСубконтоДт1,
	               |				ТиповойДвиженияССубконто.Регистратор,
	               |				ТиповойДвиженияССубконто.СубконтоДт1,
	               |				ТиповойДвиженияССубконто.СчетДт) КАК ТиповойДвиженияССубконто
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					НДСКВозмещению.Регистратор КАК Регистратор,
	               |					НДСКВозмещению.СтавкаНДС КАК СтавкаНДС,
	               |					СУММА(НДСКВозмещению.УплаченныйНДС) КАК УплаченныйНДС,
	               |					НДСКВозмещению.ТМЗ КАК ТМЗ
	               |				ИЗ
	               |					РегистрНакопления.НДСКВозмещению КАК НДСКВозмещению
	               |				ГДЕ
	               |					НДСКВозмещению.Организация = &Организация
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					НДСКВозмещению.Регистратор,
	               |					НДСКВозмещению.ТМЗ,
	               |					НДСКВозмещению.СтавкаНДС) КАК НДСКВозмещению
	               |				ПО ТиповойДвиженияССубконто.Регистратор = НДСКВозмещению.Регистратор
	               |					И ТиповойДвиженияССубконто.СубконтоДт1 = НДСКВозмещению.ТМЗ
	               |			ПО ПоступлениеДопРасходов.Ссылка = ТиповойДвиженияССубконто.Регистратор
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуТовары.Ссылка,
	               |		ВТ_ВозвратТоваровПоставщику.ДоговорКонтрагента,
	               |		ВТ_ВозвратТоваровПоставщику.Контрагент,
	               |		ВТ_ВозвратТоваровПоставщику.Организация,
	               |		ВозвратТоваровПоставщикуТовары.Номенклатура,
	               |		ВозвратТоваровПоставщикуТовары.Цена,
	               |		ВозвратТоваровПоставщикуТовары.Количество,
	               |		ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуТовары.СуммаНДС,
	               |		ВозвратТоваровПоставщикуТовары.СчетУчетаБУ,
	               |		ВТ_ВозвратТоваровПоставщику.Дата,
	               |		ВТ_ВозвратТоваровПоставщику.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуТовары.Сумма - ВозвратТоваровПоставщикуТовары.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуТовары.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения,
	               |		ВТ_ВозвратТоваровПоставщику.ВалютаДокумента,
	               |		ВТ_ВозвратТоваровПоставщику.КратностьВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.КурсВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.СчетФактура
	               |	ИЗ
	               |		ВТ_ВозвратТоваровПоставщику КАК ВТ_ВозвратТоваровПоставщику
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |			ПО ВТ_ВозвратТоваровПоставщику.Ссылка = ВозвратТоваровПоставщикуТовары.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеНМАНМА.Ссылка,
	               |		ПоступлениеНМАНМА.ДоговорКонтрагента,
	               |		ПоступлениеНМАНМА.Контрагент,
	               |		ПоступлениеНМАНМА.Организация,
	               |		ПоступлениеНМАНМА.НематериальныйАктив,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеНМАНМА.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ПоступлениеНМАНМА.СтавкаНДС,
	               |		ПоступлениеНМАНМА.СуммаНДС,
	               |		ПоступлениеНМАНМА.СчетУчетаБУ,
	               |		ПоступлениеНМАНМА.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеНМАНМА.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеНМАНМА.Сумма / Поступления.Сумма,
	               |		NULL,
	               |		ПоступлениеНМАНМА.ВалютаДокумента,
	               |		ПоступлениеНМАНМА.КратностьВзаиморасчетов,
	               |		ПоступлениеНМАНМА.КурсВзаиморасчетов,
	               |		ПоступлениеНМАНМА.СчетФактура
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ПоступлениеНМАНМА.Ссылка КАК Ссылка,
	               |			ПоступлениеНМАНМА.НематериальныйАктив КАК НематериальныйАктив,
	               |			ПоступлениеНМАНМА.Сумма КАК Сумма,
	               |			ПоступлениеНМАНМА.СтавкаНДС КАК СтавкаНДС,
	               |			ПоступлениеНМАНМА.СуммаНДС КАК СуммаНДС,
	               |			ПоступлениеНМАНМА.СчетУчетаБУ КАК СчетУчетаБУ,
	               |			ВТ_ПоступлениеНМА.Дата КАК Дата,
	               |			ВТ_ПоступлениеНМА.СчетФактура КАК СчетФактура,
	               |			ВТ_ПоступлениеНМА.Дата КАК Дата1,
	               |			ВТ_ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
	               |			ВТ_ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			ВТ_ПоступлениеНМА.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |			ВТ_ПоступлениеНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |			ВТ_ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |			ВТ_ПоступлениеНМА.Контрагент КАК Контрагент,
	               |			ВТ_ПоступлениеНМА.Организация КАК Организация
	               |		ИЗ
	               |			ВТ_ПоступлениеНМА КАК ВТ_ПоступлениеНМА
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
	               |				ПО ВТ_ПоступлениеНМА.Ссылка = ПоступлениеНМАНМА.Ссылка
	               |		ГДЕ
	               |			(НЕ (ПоступлениеНМАНМА.Ссылка, ПоступлениеНМАНМА.НематериальныйАктив) В
	               |						(ВЫБРАТЬ
	               |							ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |							ВТ_НДСЗаНерезидента.Номенклатура
	               |						ИЗ
	               |							ВТ_НДСЗаНерезидента))) КАК ПоступлениеНМАНМА
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ПоступлениеНМАНМА.Ссылка КАК Ссылка,
	               |				СУММА(ПоступлениеНМАНМА.Сумма) КАК Сумма
	               |			ИЗ
	               |				Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
	               |			ГДЕ
	               |				ПоступлениеНМАНМА.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеНМА.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеНМА)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ПоступлениеНМАНМА.Ссылка) КАК Поступления
	               |			ПО ПоступлениеНМАНМА.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеНМА.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеНМА)
	               |				И РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.Проведен
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеНМАНМА.Ссылка = Налоги.ДокументОснованиеСсылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуОС.Ссылка,
	               |		ВТ_ВозвратТоваровПоставщику.ДоговорКонтрагента,
	               |		ВТ_ВозвратТоваровПоставщику.Контрагент,
	               |		ВТ_ВозвратТоваровПоставщику.Организация,
	               |		ВозвратТоваровПоставщикуОС.ОсновноеСредство,
	               |		ВЫБОР
	               |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуОС.Сумма - ВозвратТоваровПоставщикуОС.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВозвратТоваровПоставщикуОС.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуОС.СуммаНДС,
	               |		ВозвратТоваровПоставщикуОС.СчетУчетаБУ,
	               |		ВТ_ВозвратТоваровПоставщику.Дата,
	               |		ВТ_ВозвратТоваровПоставщику.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуОС.Сумма - ВозвратТоваровПоставщикуОС.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуОС.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		ВТ_ВозвратТоваровПоставщику.ВалютаДокумента,
	               |		ВТ_ВозвратТоваровПоставщику.КратностьВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.КурсВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.СчетФактура
	               |	ИЗ
	               |		ВТ_ВозвратТоваровПоставщику КАК ВТ_ВозвратТоваровПоставщику
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.ОС КАК ВозвратТоваровПоставщикуОС
	               |			ПО ВТ_ВозвратТоваровПоставщику.Ссылка = ВозвратТоваровПоставщикуОС.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АвансовыйОтчетТовары.Ссылка,
	               |		АвансовыйОтчетТовары.СчетФактура.ДоговорКонтрагента,
	               |		АвансовыйОтчетТовары.Поставщик,
	               |		ВТ_АвансовыйОтчет.Организация,
	               |		АвансовыйОтчетТовары.Номенклатура,
	               |		АвансовыйОтчетТовары.Цена,
	               |		АвансовыйОтчетТовары.Количество,
	               |		АвансовыйОтчетТовары.СтавкаНДС,
	               |		АвансовыйОтчетТовары.СуммаНДС,
	               |		АвансовыйОтчетТовары.СчетУчетаБУ,
	               |		ВТ_АвансовыйОтчет.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_АвансовыйОтчет.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетТовары.Сумма - АвансовыйОтчетТовары.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетТовары.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		АвансовыйОтчетТовары.ЕдиницаИзмерения,
	               |		ВТ_АвансовыйОтчет.ВалютаДокумента,
	               |		ВТ_АвансовыйОтчет.КратностьДокумента,
	               |		ВТ_АвансовыйОтчет.КурсДокумента,
	               |		АвансовыйОтчетТовары.СчетФактура
	               |	ИЗ
	               |		Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АвансовыйОтчет КАК ВТ_АвансовыйОтчет
	               |			ПО АвансовыйОтчетТовары.Ссылка = ВТ_АвансовыйОтчет.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка,
	               |		ВТ_ВозвратТоваровПоставщику.ДоговорКонтрагента,
	               |		ВТ_ВозвратТоваровПоставщику.Контрагент,
	               |		ВТ_ВозвратТоваровПоставщику.Организация,
	               |		ВозвратТоваровПоставщикуУслуги.Номенклатура,
	               |		ВозвратТоваровПоставщикуУслуги.Цена,
	               |		ВозвратТоваровПоставщикуУслуги.Количество,
	               |		ВозвратТоваровПоставщикуУслуги.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуУслуги.СуммаНДС,
	               |		ВозвратТоваровПоставщикуУслуги.СчетЗатратБУ,
	               |		ВТ_ВозвратТоваровПоставщику.Дата,
	               |		ВТ_ВозвратТоваровПоставщику.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуУслуги.Сумма - ВозвратТоваровПоставщикуУслуги.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуУслуги.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		ВТ_ВозвратТоваровПоставщику.ВалютаДокумента,
	               |		ВТ_ВозвратТоваровПоставщику.КратностьВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.КурсВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.СчетФактура
	               |	ИЗ
	               |		ВТ_ВозвратТоваровПоставщику КАК ВТ_ВозвратТоваровПоставщику
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Услуги КАК ВозвратТоваровПоставщикуУслуги
	               |			ПО ВТ_ВозвратТоваровПоставщику.Ссылка = ВозвратТоваровПоставщикуУслуги.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АвансовыйОтчетПрочее.Ссылка,
	               |		АвансовыйОтчетПрочее.СчетФактура.ДоговорКонтрагента,
	               |		АвансовыйОтчетПрочее.Поставщик,
	               |		ВТ_АвансовыйОтчет.Организация,
	               |		АвансовыйОтчетПрочее.Номенклатура,
	               |		ВЫБОР
	               |			КОГДА ВТ_АвансовыйОтчет.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетПрочее.Сумма - АвансовыйОтчетПрочее.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетПрочее.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		АвансовыйОтчетПрочее.СтавкаНДС,
	               |		АвансовыйОтчетПрочее.СуммаНДС,
	               |		АвансовыйОтчетПрочее.СчетЗатратБУ,
	               |		ВТ_АвансовыйОтчет.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_АвансовыйОтчет.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетПрочее.Сумма - АвансовыйОтчетПрочее.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетПрочее.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		ВТ_АвансовыйОтчет.ВалютаДокумента,
	               |		ВТ_АвансовыйОтчет.КратностьДокумента,
	               |		ВТ_АвансовыйОтчет.КурсДокумента,
	               |		АвансовыйОтчетПрочее.СчетФактура
	               |	ИЗ
	               |		Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АвансовыйОтчет КАК ВТ_АвансовыйОтчет
	               |			ПО АвансовыйОтчетПрочее.Ссылка = ВТ_АвансовыйОтчет.Ссылка
	               |	ГДЕ
	               |		АвансовыйОтчетПрочее.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |		И АвансовыйОтчетПрочее.Номенклатура.Услуга = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеИзПереработкиУслуги.Ссылка,
	               |		ВТ_ПоступлениеИзПереработки.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеИзПереработки.Контрагент,
	               |		ВТ_ПоступлениеИзПереработки.Организация,
	               |		ПоступлениеИзПереработкиУслуги.Номенклатура,
	               |		ПоступлениеИзПереработкиУслуги.Цена,
	               |		ПоступлениеИзПереработкиУслуги.Количество,
	               |		ПоступлениеИзПереработкиУслуги.СтавкаНДС,
	               |		ПоступлениеИзПереработкиУслуги.СуммаНДС,
	               |		ВТ_ПоступлениеИзПереработки.СчетЗатратБУ,
	               |		ВТ_ПоступлениеИзПереработки.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеИзПереработки.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеИзПереработкиУслуги.Сумма - ПоступлениеИзПереработкиУслуги.СуммаНДС
	               |			ИНАЧЕ ПоступлениеИзПереработкиУслуги.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		ВТ_ПоступлениеИзПереработки.ВалютаДокумента,
	               |		ВТ_ПоступлениеИзПереработки.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеИзПереработки.КурсВзаиморасчетов,
	               |		ВТ_ПоступлениеИзПереработки.СчетФактура
	               |	ИЗ
	               |		ВТ_ПоступлениеИзПереработки КАК ВТ_ПоступлениеИзПереработки
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеИзПереработки.Услуги КАК ПоступлениеИзПереработкиУслуги
	               |			ПО ВТ_ПоступлениеИзПереработки.Ссылка = ПоступлениеИзПереработкиУслуги.Ссылка) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП";					   			
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингПокупок.СоздатьНаборЗаписей();
	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	ДоступенРеквизитОсновнойСчетФактура = ?(Метаданные.Документы.СчетФактураПолученный.Реквизиты.Найти("ОсновнойСчетФактура") = Неопределено, Ложь, Истина);
		
	ИспользоватьДанныеИзДополнительныхСчетовФактур = моп_Общий.ИспользоватьДанныеИзДополнительныхСчетовФактур(ДанныеДокумента.Дата);
	Если ИспользоватьДанныеИзДополнительныхСчетовФактур = Неопределено Тогда
		ИспользоватьДанныеИзДополнительныхСчетовФактур = Ложь;
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
		Док = Выборка.СсылкаНаДокумент;
				
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;
		Движение.Счет 				= Выборка.Счет;
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ПинКод     		= Выборка.ПинКод;
		Движение.КодТНВЭД     		= Выборка.КодТНВЭД;
		Движение.Контрагент 		= Выборка.Контрагент;	
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;		
		Движение.СчетФактура 		= Выборка.СчетФактура;		
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Если ЗначениеЗаполнено(Движение.СчетФактура) Тогда				
			Движение.СчетФактураЯвляетсяДополнительным = Движение.СчетФактура.Дополнительная;
			Если ДоступенРеквизитОсновнойСчетФактура Тогда				
				Движение.СчетФактураКорректируемый = Движение.СчетФактура.ОсновнойСчетФактура;				
			КонецЕсли;						
		КонецЕсли;			
		
    	ДанныеКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Выборка.Дата);		
		
		Если ИспользоватьДанныеИзДополнительныхСчетовФактур и ЗначениеЗаполнено(Движение.СчетФактура) и Движение.СчетФактураЯвляетсяДополнительным Тогда
			ЗаполнитьДанныеИзДополнительногоСчетаФактуры(Движение.СчетФактура, Движение, Выборка, ДанныеКурсаВалюты, ВалютаРегламентированногоУчета);
		Иначе
				
		Движение.Количество 		= Выборка.Количество;
		
		Движение.СуммаБезНалогов 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);			
				
		Движение.Акциз 				= 0;
		
		Движение.СуммаНДС 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
			
	КонецЕсли;
	
		Движение.СтавкаНДС 			= Выборка.СтавкаНДС;	
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);
	
		Если Не ЗначениеЗаполнено(Движение.СчетФактураКорректируемый) и ЗначениеЗаполнено(Выборка.ОснованиеВозврата) Тогда
				Движение.СчетФактураКорректируемый = ОбщегоНазначения.НайтиПодчиненныйДокумент(Выборка.ОснованиеВозврата, "СчетФактураПолученный");
		КонецЕсли; 
		
		Движение.СсылкаНаДокумент 	= Док;
		Движение.Организация 		= Выборка.Организация;
		
		Движение.СуммаИПН 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаИПН, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);
		
		Движение.КонтрагентЯвляетсяЧастнымЛицом = Выборка.КонтрагентЯвляетсяЧастнымЛицом;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу импорта
//
Процедура ВыполнитьДвиженияПоМониторингуИмпорта(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("Импорт", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ПоступлениеТоваровУслуг.ВидОперации
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслуг
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслуг.Дата >= &НачДата
	               |	И ПоступлениеТоваровУслуг.Дата <= &КонДата
	               |	И ПоступлениеТоваровУслуг.Организация = &Организация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеНМА.Ссылка КАК Ссылка,
	               |	ПоступлениеНМА.Дата КАК Дата,
	               |	ПоступлениеНМА.Контрагент КАК Контрагент,
	               |	ПоступлениеНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ПоступлениеНМА.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
	               |	ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ПоступлениеНМА.Организация КАК Организация,
	               |	ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ_ПоступлениеНМА
	               |ИЗ
	               |	Документ.ПоступлениеНМА КАК ПоступлениеНМА
	               |ГДЕ
	               |	ПоступлениеНМА.Проведен = ИСТИНА
	               |	И ПоступлениеНМА.Дата >= &НачДата
	               |	И ПоступлениеНМА.Дата <= &КонДата
	               |	И ПоступлениеНМА.Организация = &Организация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НДСЗаНерезидентаОбороты.ДокументПоступления КАК ДокументПоступления,
	               |	НДСЗаНерезидентаОбороты.Номенклатура КАК Номенклатура,
	               |	НДСЗаНерезидентаОбороты.СуммаНДСПриход
	               |ПОМЕСТИТЬ ВТ_НДСЗаНерезидента
	               |ИЗ
	               |	РегистрНакопления.НДСЗаНерезидента.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Налогоплательщик = &Организация
	               |				И ДокументПоступления В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеТоваровУслуг
	               |			
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |					ВЫБРАТЬ
	               |						ВТ_ПоступлениеНМА.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеНМА)) КАК НДСЗаНерезидентаОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументПоступления,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.ДокументОснование КАК ДокументОснование,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Номенклатура,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.СуммаНДС КАК СуммаНДС,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Номер,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Дата,
	               |	NULL КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ НДСКУплатеТС
	               |ИЗ
	               |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Товары КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары
	               |ГДЕ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.ДокументОснование В
	               |			(ВЫБРАТЬ
	               |				ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг)
	               |	И ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ДокументОснование,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ОсновноеСредство,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.СуммаНДС,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Номер,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Дата,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ЕдиницаИзмерения
	               |ИЗ
	               |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ОС КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС
	               |ГДЕ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ДокументОснование В
	               |			(ВЫБРАТЬ
	               |				ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг)
	               |	И ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.СуммаПошлины,
	               |	ВложенныйЗапрос.СуммаСбора,
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.НомерГТД,
	               |	ВложенныйЗапрос.ДатаГТД,
	               |	ВложенныйЗапрос.Валюта,
	               |	ВложенныйЗапрос.КурсВалюты,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	моп_ОбъектыМониторинга.ПинКод,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.Счет
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(ЗапросОбъединенный.Дата) КАК Дата,
	               |		ЗапросОбъединенный.Номенклатура КАК Номенклатура,
	               |		СУММА(ЗапросОбъединенный.Сумма) КАК Сумма,
	               |		СУММА(ЗапросОбъединенный.СуммаНДС) КАК СуммаНДС,
	               |		СУММА(ЗапросОбъединенный.СуммаПошлины) КАК СуммаПошлины,
	               |		СУММА(ЗапросОбъединенный.СуммаСборов) КАК СуммаСбора,
	               |		ЗапросОбъединенный.Ссылка КАК Ссылка,
	               |		МАКСИМУМ(ЗапросОбъединенный.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |		МАКСИМУМ(ЗапросОбъединенный.Контрагент) КАК Контрагент,
	               |		МАКСИМУМ(ЗапросОбъединенный.Организация) КАК Организация,
	               |		МАКСИМУМ(ЗапросОбъединенный.Цена) КАК Цена,
	               |		СУММА(ЗапросОбъединенный.Количество) КАК Количество,
	               |		МАКСИМУМ(ЗапросОбъединенный.НомерГТД) КАК НомерГТД,
	               |		МАКСИМУМ(ЗапросОбъединенный.ДатаГТД) КАК ДатаГТД,
	               |		МАКСИМУМ(ЗапросОбъединенный.ВалютаДокумента) КАК Валюта,
	               |		МАКСИМУМ(ЗапросОбъединенный.Курс) КАК КурсВалюты,
	               |		МАКСИМУМ(ЗапросОбъединенный.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	               |		МАКСИМУМ(ЗапросОбъединенный.Счет) КАК Счет
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			Поступления.Ссылка КАК Ссылка,
	               |			Поступления.Номенклатура КАК Номенклатура,
	               |			Поступления.Сумма КАК Сумма,
	               |			Поступления.СуммаНДС КАК СуммаНДС,
	               |			Поступления.СуммаПошлины КАК СуммаПошлины,
	               |			Поступления.СуммаСборов КАК СуммаСборов,
	               |			NULL КАК ДатаГТД,
	               |			NULL КАК НомерГТД,
	               |			Поступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			Поступления.Контрагент КАК Контрагент,
	               |			Поступления.Организация КАК Организация,
	               |			Поступления.Дата КАК Дата,
	               |			Поступления.Цена КАК Цена,
	               |			Поступления.Количество КАК Количество,
	               |			Поступления.ВалютаДокумента КАК ВалютаДокумента,
	               |			Поступления.Курс КАК Курс,
	               |			Поступления.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |			Поступления.Счет КАК Счет
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |				КОНЕЦ КАК Сумма,
	               |				0 КАК СуммаНДС,
	               |				0 КАК СуммаСборов,
	               |				0 КАК ДатаГТД,
	               |				0 КАК НомерГТД,
	               |				ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |				ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |				ВТ_ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |				ВТ_ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |				ВТ_ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |				ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |				ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	               |				ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |				ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1) КАК Курс,
	               |				0 КАК СуммаПошлины,
	               |				ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |				ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК Счет
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |					ПО ВТ_ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |						И (ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт)
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ПоступлениеТоваровУслугУслуги.Номенклатура,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	               |				КОНЕЦ,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				ПоступлениеТоваровУслугУслуги.Ссылка,
	               |				ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |				ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |				ВТ_ПоступлениеТоваровУслуг.Организация,
	               |				ВТ_ПоступлениеТоваровУслуг.Дата,
	               |				ПоступлениеТоваровУслугУслуги.Цена,
	               |				ПоступлениеТоваровУслугУслуги.Количество,
	               |				ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |				ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1),
	               |				0,
	               |				NULL,
	               |				ПоступлениеТоваровУслугУслуги.СчетЗатратБУ
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |					ПО ВТ_ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |			ГДЕ
	               |				(ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт
	               |						ИЛИ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |							(ВЫБРАТЬ
	               |								ВТ_НДСЗаНерезидента.ДокументПоступления,
	               |								ВТ_НДСЗаНерезидента.Номенклатура
	               |							ИЗ
	               |								ВТ_НДСЗаНерезидента))
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ПоступлениеТоваровУслугОС.ОсновноеСредство,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |				КОНЕЦ,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				ПоступлениеТоваровУслугОС.Ссылка,
	               |				ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |				ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |				ВТ_ПоступлениеТоваровУслуг.Организация,
	               |				ВТ_ПоступлениеТоваровУслуг.Дата,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |				КОНЕЦ,
	               |				1,
	               |				ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |				ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1),
	               |				0,
	               |				NULL,
	               |				ПоступлениеТоваровУслугОС.СчетУчетаБУ
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |					ПО ВТ_ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугОС.Ссылка
	               |						И (ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт)
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ПоступлениеНМАНМА.НематериальныйАктив,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |					ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |				КОНЕЦ,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				ПоступлениеНМАНМА.Ссылка,
	               |				ВТ_ПоступлениеНМА.ДоговорКонтрагента,
	               |				ВТ_ПоступлениеНМА.Контрагент,
	               |				ВТ_ПоступлениеНМА.Организация,
	               |				ВТ_ПоступлениеНМА.Дата,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |					ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |				КОНЕЦ,
	               |				1,
	               |				ВТ_ПоступлениеНМА.ВалютаДокумента,
	               |				ВТ_ПоступлениеНМА.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеНМА.КратностьВзаиморасчетов, 1),
	               |				0,
	               |				NULL,
	               |				ПоступлениеНМАНМА.СчетУчетаБУ
	               |			ИЗ
	               |				ВТ_ПоступлениеНМА КАК ВТ_ПоступлениеНМА
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
	               |					ПО ВТ_ПоступлениеНМА.Ссылка = ПоступлениеНМАНМА.Ссылка
	               |			ГДЕ
	               |				(ПоступлениеНМАНМА.Ссылка, ПоступлениеНМАНМА.НематериальныйАктив) В
	               |						(ВЫБРАТЬ
	               |							ВТ_НДСЗаНерезидента.ДокументПоступления,
	               |							ВТ_НДСЗаНерезидента.Номенклатура
	               |						ИЗ
	               |							ВТ_НДСЗаНерезидента)) КАК Поступления
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ГТД.ДокументПартии,
	               |			ГТД.Номенклатура,
	               |			0,
	               |			ГТД.СуммаНДСРегл,
	               |			ГТД.СуммаПошлиныРегл,
	               |			ГТД.СуммаВсехСборов,
	               |			ГТД.ДатаГТД,
	               |			ГТД.НомерГТД,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			0,
	               |			0,
	               |			NULL,
	               |			0,
	               |			NULL,
	               |			NULL
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ГТДОбщий.СуммаПошлиныРегл КАК СуммаПошлиныРегл,
	               |				ГТДОбщий.СуммаСбора КАК СуммаСбора,
	               |				ГТДОбщий.СуммаВалютногоСбораРегл КАК СуммаВалютногоСбораРегл,
	               |				ГТДОбщий.СуммаНДСРегл КАК СуммаНДСРегл,
	               |				ГТДОбщий.Номенклатура КАК Номенклатура,
	               |				ГТДОбщий.НомерСтроки КАК НомерСтроки,
	               |				ГТДОбщий.НомерРаздела КАК НомерРаздела,
	               |				ГТДОбщий.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
	               |				ГТДОбщий.СуммаПошлиныВВалюте КАК СуммаПошлиныВВалюте,
	               |				ГТДОбщий.СуммаСбораВВалюте КАК СуммаСбораВВалюте,
	               |				ГТДОбщий.ВалютаСбора КАК ВалютаСбора,
	               |				ГТДОбщий.Количество КАК Количество,
	               |				ГТДОбщий.ВалютаДокументаПоступления КАК ВалютаДокументаПоступления,
	               |				ГТДОбщий.СтавкаПошлины КАК СтавкаПошлины,
	               |				ГТДОбщий.ВалютаПошлины КАК ВалютаПошлины,
	               |				ГТДОбщий.СуммаНДСВВалюте КАК СуммаНДСВВалюте,
	               |				ГТДОбщий.ВалютаНДС КАК ВалютаНДС,
	               |				ГТДОбщий.СуммаПоступленияРегл КАК СуммаПоступленияРегл,
	               |				ГТДОбщий.СуммаПоступленияРегл + ГТДОбщий.СуммаПошлиныРегл + ГТДОбщий.СуммаВалютногоСбораРегл + ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаНДСВСтоимостиРегл КАК ОбщаяСуммаРегл,
	               |				ВЫБОР
	               |					КОГДА ГТДОбщий.Количество = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ (ГТДОбщий.СуммаПоступленияРегл + ГТДОбщий.СуммаПошлиныРегл + ГТДОбщий.СуммаВалютногоСбораРегл + ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаНДСВСтоимостиРегл) / ГТДОбщий.Количество
	               |				КОНЕЦ КАК ОбщаяЦенаРегл,
	               |				ГТДОбщий.ЦенаРегл КАК ЦенаРегл,
	               |				ГТДОбщий.ЦенаВал КАК ЦенаВал,
	               |				ГТДОбщий.ВалютаДокумента КАК ВалютаДокумента,
	               |				ГТДОбщий.КодНоменклатуры КАК КодНоменклатуры,
	               |				ГТДОбщий.ДокументПартии КАК ДокументПартии,
	               |				ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаВалютногоСбораРегл КАК СуммаВсехСборов,
	               |				ГТДОбщий.ДатаГТД КАК ДатаГТД,
	               |				ГТДОбщий.НомерГТД КАК НомерГТД,
	               |				ГТДОбщий.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
	               |					ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
	               |					ГТДИмпортТовары.Номенклатура КАК Номенклатура,
	               |					ГТДИмпортТовары.ФактурнаяСтоимость КАК ТаможеннаяСтоимость,
	               |					ВЫБОР
	               |						КОГДА (НЕ ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента)
	               |							ТОГДА ГТДИмпортТовары.СуммаПошлины
	               |						ИНАЧЕ 0
	               |					КОНЕЦ КАК СуммаПошлиныВВалюте,
	               |					ГТДИмпортТовары.СуммаСбора КАК СуммаСбора,
	               |					ГТДИмпортТовары.СуммаСбораВал КАК СуммаСбораВВалюте,
	               |					ГТДИмпортРазделы.ДоговорВзаиморасчетовСбор.ВалютаВзаиморасчетов КАК ВалютаСбора,
	               |					ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) КАК Количество,
	               |					ПоступлениеТМЗ.ВалютаДокумента КАК ВалютаДокументаПоступления,
	               |					ГТДИмпортРазделы.СтавкаПошлины КАК СтавкаПошлины,
	               |					ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов КАК ВалютаПошлины,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |							ТОГДА 0
	               |						ИНАЧЕ ГТДИмпортТовары.СуммаНДС
	               |					КОНЕЦ КАК СуммаНДСВВалюте,
	               |					ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов КАК ВалютаНДС,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |							ТОГДА ГТДИмпортТовары.СуммаПошлины
	               |						КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаПошлины * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |					КОНЕЦ КАК СуммаПошлиныРегл,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаСбораВал * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |					КОНЕЦ КАК СуммаВалютногоСбораРегл,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |							ТОГДА ГТДИмпортТовары.СуммаНДС
	               |						КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаНДС * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |					КОНЕЦ КАК СуммаНДСРегл,
	               |					ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0) КАК СуммаПоступленияРегл,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.Ссылка.НДСВключенВСтоимость
	               |							ТОГДА ВЫБОР
	               |									КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |										ТОГДА ГТДИмпортТовары.СуммаНДС
	               |									КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |										ТОГДА 0
	               |									ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаНДС * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |								КОНЕЦ
	               |						ИНАЧЕ 0
	               |					КОНЕЦ КАК СуммаНДСВСтоимостиРегл,
	               |					ВЫРАЗИТЬ(ВЫБОР
	               |							КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
	               |								ТОГДА 0
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияВал, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
	               |						КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаВал,
	               |					ВЫРАЗИТЬ(ВЫБОР
	               |							КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
	               |								ТОГДА 0
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
	               |						КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаРегл,
	               |					ГТДИмпортРазделы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	               |					ГТДИмпортТовары.Номенклатура.Код КАК КодНоменклатуры,
	               |					ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
	               |					ГТДИмпортТовары.Ссылка.Дата КАК ДатаГТД,
	               |					ГТДИмпортТовары.Ссылка.НомерГТД КАК НомерГТД,
	               |					ГТДИмпортРазделы.Ссылка.Ссылка КАК Ссылка,
	               |					ПоступлениеТМЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |				ИЗ
	               |					(ВЫБРАТЬ
	               |						ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
	               |						ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
	               |						ГТДИмпортТовары.Номенклатура КАК Номенклатура,
	               |						ГТДИмпортТовары.Количество КАК Количество,
	               |						ГТДИмпортТовары.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
	               |						ГТДИмпортТовары.СуммаПошлины КАК СуммаПошлины,
	               |						ГТДИмпортТовары.СуммаСбора КАК СуммаСбора,
	               |						ГТДИмпортТовары.СуммаСбораВал КАК СуммаСбораВал,
	               |						ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
	               |						ГТДИмпортТовары.Ссылка КАК Ссылка,
	               |						ГТДИмпортТовары.СуммаНДС КАК СуммаНДС
	               |					ИЗ
	               |						Документ.ГТДИмпорт.Товары КАК ГТДИмпортТовары
	               |					ГДЕ
	               |						ГТДИмпортТовары.ДокументПартии В
	               |								(ВЫБРАТЬ
	               |									ПоступлениеТоваровУслуг.Ссылка
	               |								ИЗ
	               |									ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг)
	               |						И ГТДИмпортТовары.Ссылка.Проведен
	               |					
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |					
	               |					ВЫБРАТЬ
	               |						ГТДИмпортОС.НомерСтроки,
	               |						ГТДИмпортОС.НомерРаздела,
	               |						ГТДИмпортОС.ОсновноеСредство,
	               |						1,
	               |						ГТДИмпортОС.ФактурнаяСтоимость,
	               |						ГТДИмпортОС.СуммаПошлины,
	               |						ГТДИмпортОС.СуммаСбора,
	               |						ГТДИмпортОС.СуммаСбораВал,
	               |						ГТДИмпортОС.ДокументПартии,
	               |						ГТДИмпортОС.Ссылка,
	               |						ГТДИмпортОС.СуммаНДС
	               |					ИЗ
	               |						Документ.ГТДИмпорт.ОС КАК ГТДИмпортОС
	               |					ГДЕ
	               |						ГТДИмпортОС.ДокументПартии В
	               |								(ВЫБРАТЬ
	               |									ПоступлениеТоваровУслуг.Ссылка
	               |								ИЗ
	               |									ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг)
	               |						И ГТДИмпортОС.Ссылка.Проведен) КАК ГТДИмпортТовары
	               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГТДИмпорт.Разделы КАК ГТДИмпортРазделы
	               |						ПО ГТДИмпортТовары.Ссылка = ГТДИмпортРазделы.Ссылка
	               |							И ГТДИмпортТовары.НомерРаздела = ГТДИмпортРазделы.НомерСтроки
	               |						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |							ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |							СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	               |							СУММА(ВЫБОР
	               |									КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |											И (НЕ ПоступлениеТоваровУслугТовары.Ссылка.НДСВключенВСтоимость)
	               |										ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |									ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |								КОНЕЦ) КАК СуммаПоступленияВал,
	               |							ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	               |							СУММА(ВЫБОР
	               |									КОГДА ПоступлениеТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |										ТОГДА 0
	               |									ИНАЧЕ ПоступлениеТоваровУслугТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов * ВЫБОР
	               |											КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |													И (НЕ ПоступлениеТоваровУслугТовары.Ссылка.НДСВключенВСтоимость)
	               |												ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |											ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |										КОНЕЦ
	               |								КОНЕЦ) КАК СуммаПоступленияРегл,
	               |							ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |						ИЗ
	               |							Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |						ГДЕ
	               |							ПоступлениеТоваровУслугТовары.Ссылка В
	               |									(ВЫБРАТЬ
	               |										ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |									ИЗ
	               |										ВТ_ПоступлениеТоваровУслуг)
	               |						
	               |						СГРУППИРОВАТЬ ПО
	               |							ПоступлениеТоваровУслугТовары.Ссылка,
	               |							ПоступлениеТоваровУслугТовары.Номенклатура,
	               |							ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента,
	               |							ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения) КАК ПоступлениеТМЗ
	               |						ПО ГТДИмпортТовары.ДокументПартии = ПоступлениеТМЗ.Ссылка
	               |							И ГТДИмпортТовары.Номенклатура = ПоступлениеТМЗ.Номенклатура) КАК ГТДОбщий) КАК ГТД
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			НДСКУплатеТС.ДокументОснование,
	               |			НДСКУплатеТС.Номенклатура,
	               |			NULL,
	               |			НДСКУплатеТС.СуммаНДС,
	               |			NULL,
	               |			NULL,
	               |			НДСКУплатеТС.Дата,
	               |			НДСКУплатеТС.Номер,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			НДСКУплатеТС.ЕдиницаИзмерения,
	               |			NULL
	               |		ИЗ
	               |			НДСКУплатеТС КАК НДСКУплатеТС
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ВТ_НДСЗаНерезидента.ДокументПоступления,
	               |			ВТ_НДСЗаНерезидента.Номенклатура,
	               |			NULL,
	               |			ВТ_НДСЗаНерезидента.СуммаНДСПриход,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL
	               |		ИЗ
	               |			ВТ_НДСЗаНерезидента КАК ВТ_НДСЗаНерезидента) КАК ЗапросОбъединенный
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗапросОбъединенный.Номенклатура,
	               |		ЗапросОбъединенный.Ссылка) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингИмпорта.СоздатьНаборЗаписей();	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка;
				
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;		
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ПинКод             = Выборка.ПинКод;
		Движение.КодТНВЭД           = Выборка.КодТНВЭД;
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Движение.СуммаБезНалогов 	= Выборка.Сумма;
		Движение.СуммаНДС 			= Выборка.СуммаНДС;
		Движение.СуммаПошлины 		= Выборка.СуммаПошлины;
		Движение.СуммаСборов 		= Выборка.СуммаСбора;
		Движение.СсылкаНаДокумент	= Выборка.Ссылка;
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.Контрагент 		= Выборка.Контрагент;
		Движение.Организация 		= Выборка.Организация;				
		Движение.Количество 		= Выборка.Количество;
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);		
		Движение.НомерГТД		 	= Выборка.НомерГТД;		
		Движение.ДатаГТД		 	= Выборка.ДатаГТД;
		Движение.Счет 				= Выборка.Счет;
		//Движение.НомерИнвойса	 	= "";
		//Движение.ДатаИнвойса	 	= "";		
		Движение.Акциз 				= 0;
		Движение.Валюта 			= Выборка.Валюта;
		Движение.КурсТенге 			= Выборка.КурсВалюты;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу экспорта
//
Процедура ВыполнитьДвиженияПоМониторингуЭкспорта(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	//Делаем проверку на правильность обращения к перечислению
	//в конфигурации "Бухгалтерии для Казахстана" релиз 1.5.5.4 и ниже, 
	//использовалось перечисление "ВидыОперацийРеализацииТоваровУслуг"
	//начиная с версии 1.5.6.11 используется перечисление "ВидыОперацийРеализацияТоваров"
	Если Метаданные.Перечисления.Найти("ВидыОперацийРеализацияТоваров") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацияТоваров"].ПередачаСтруктурномуПодразделению);
	ИначеЕсли  Метаданные.Перечисления.Найти("ВидыОперацийРеализацииТоваровУслуг") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацииТоваровУслуг"].ПередачаСтруктурномуПодразделению);	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеОС", Перечисления.ВидыОперацийПередачиОС.ПередачаСтруктурномуПодразделению);
	
	ТекущийРелиз = ОбщегоНазначения.ПолучитьНомерРелиза(Метаданные.Версия);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.СчетДоходовБУ,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.СУММА,
	               |	ВложенныйЗапрос.Валюта,
	               |	ВложенныйЗапрос.КурсВалюты,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.Организация,
	               |	моп_ОбъектыМониторинга.ПинКод,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	моп_СведенияПоЭкспортуТовары.НомерГТД,
	               |	моп_СведенияПоЭкспортуТовары.ДатаГТД,
	               |	моп_СведенияПоЭкспортуТовары.ДатаИнвойса,
	               |	моп_СведенияПоЭкспортуТовары.НомерИнвойса,
	               |	моп_СведенияПоЭкспортуТовары.МестоОтгрузки,
	               |	моп_СведенияПоЭкспортуТовары.ДатаПаспортаСделки,
	               |	моп_СведенияПоЭкспортуТовары.НомерПаспортаСделки,
	               |	моп_СведенияПоЭкспортуТовары.ДатаОплаты,
	               |	моп_СведенияПоЭкспортуТовары.УсловияПоставки,
	               |	моп_СведенияПоЭкспортуТовары.СуммаСборов,
	               |	моп_СведенияПоЭкспортуТовары.СуммаПошлины
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	               |		РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		РеализацияТоваровУслугТовары.Цена КАК Цена,
	               |		РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ КАК СУММА,
	               |		РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента КАК Валюта,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов / РеализацияТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ КАК КурсВалюты,
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата КАК Дата,
	               |		РеализацияТоваровУслугТовары.Ссылка.Ссылка КАК СсылкаНаДокумент,
	               |		РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	               |		РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Номенклатура,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Контрагент,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Цена,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КурсВзаиморасчетов / АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация,
	               |		АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	               |	ГДЕ
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация = &Организация
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаНМА.СчетДоходовБУ,
	               |		ПередачаНМА.НематериальныйАктив,
	               |		ПередачаНМА.Контрагент,
	               |		ПередачаНМА.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		ПередачаНМА.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА ПередачаНМА.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ ПередачаНМА.Ссылка.КурсВзаиморасчетов / ПередачаНМА.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		ПередачаНМА.Дата,
	               |		ПередачаНМА.Ссылка,
	               |		ПередачаНМА.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаНМА КАК ПередачаНМА
	               |	ГДЕ
	               |		ПередачаНМА.Дата >= &НачДата
	               |		И ПередачаНМА.Дата <= &КонДата
	               |		И ПередачаНМА.Организация = &Организация
	               |		И ПередачаНМА.Проведен = ИСТИНА
	               |		И ПередачаНМА.ВалютаДокумента <> &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаОСОС.СчетДоходовБУ,
	               |		ПередачаОСОС.ОсновноеСредство,
	               |		ПередачаОСОС.Ссылка.Контрагент,
	               |		ПередачаОСОС.Ссылка.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		ПередачаОСОС.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА ПередачаОСОС.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ ПередачаОСОС.Ссылка.КурсВзаиморасчетов / ПередачаОСОС.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		ПередачаОСОС.Ссылка.Дата,
	               |		ПередачаОСОС.Ссылка.Ссылка,
	               |		ПередачаОСОС.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаОС.ОС КАК ПередачаОСОС
	               |	ГДЕ
	               |		ПередачаОСОС.Ссылка.Дата >= &НачДата
	               |		И ПередачаОСОС.Ссылка.Дата <= &КонДата
	               |		И ПередачаОСОС.Ссылка.Организация = &Организация
	               |		И ПередачаОСОС.Ссылка.Проведен = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И ПередачаОСОС.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеОС
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугУслуги.СчетДоходовБУ,
	               |		РеализацияТоваровУслугУслуги.Номенклатура,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугУслуги.Цена,
	               |		РеализацияТоваровУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов / РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеУслуги.Номенклатура,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеУслуги.Цена,
	               |		РеализацияУслугПоПереработкеУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Ссылка.КурсВзаиморасчетов / РеализацияУслугПоПереработкеУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Ссылка,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Проведен = ИСТИНА) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии КАК ДокументПартии,
	               |			моп_СведенияПоЭкспортуТовары.Номенклатура КАК Номенклатура,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА моп_СведенияПоЭкспортуТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегУчета
	               |						ТОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаПошлины, 0)
	               |					КОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаПошлины, 0) * ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КурсВзаиморасчетов, 0) / ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) КАК ЧИСЛО(15, 2))
	               |				КОНЕЦ) КАК СуммаПошлины,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерГТД КАК НомерГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаГТД КАК ДатаГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаИнвойса КАК ДатаИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерИнвойса КАК НомерИнвойса,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.МестоОтгрузки, 1, 250) КАК МестоОтгрузки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаПаспортаСделки КАК ДатаПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерПаспортаСделки КАК НомерПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаОплаты КАК ДатаОплаты,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.УсловияПоставки, 1, 250) КАК УсловияПоставки,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА моп_СведенияПоЭкспортуТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегУчета
	               |						ТОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаСборов, 0)
	               |					КОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаСборов, 0) * ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КурсВзаиморасчетов, 0) / ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) КАК ЧИСЛО(15, 2))
	               |				КОНЕЦ) КАК СуммаСборов
	               |		ИЗ
	               |			Документ.моп_СведенияПоЭкспорту.Товары КАК моп_СведенияПоЭкспортуТовары
	               |		ГДЕ
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии В
	               |					(ВЫБРАТЬ
	               |						РеализацияТоваровУслуг.Ссылка
	               |					ИЗ
	               |						Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |					ГДЕ
	               |						РеализацияТоваровУслуг.Дата >= &НачДата
	               |						И РеализацияТоваровУслуг.Дата <= &КонДата
	               |						И РеализацияТоваровУслуг.Организация = &Организация
	               |						И РеализацияТоваровУслуг.Проведен
	               |						И РеализацияТоваровУслуг.ВалютаДокумента <> &ВалютаРегУчета
	               |						И РеализацияТоваровУслуг.ВидОперации <> &ВидОперацииСтруктурные)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии,
	               |			моп_СведенияПоЭкспортуТовары.Номенклатура,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаОплаты,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.МестоОтгрузки, 1, 250),
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.УсловияПоставки, 1, 250)) КАК моп_СведенияПоЭкспортуТовары
	               |		ПО ВложенныйЗапрос.СсылкаНаДокумент = моп_СведенияПоЭкспортуТовары.ДокументПартии
	               |			И ВложенныйЗапрос.Номенклатура = моп_СведенияПоЭкспортуТовары.Номенклатура";					   			
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингЭкспорта.СоздатьНаборЗаписей();	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.СсылкаНаДокумент;
		
		СчетФактура = ОбщегоНазначения.НайтиПодчиненныйДокумент(Док, "СчетФактураВыданный");		
		Если ЗначениеЗаполнено(СчетФактура) Тогда								
			Если СчетФактура.Дополнительная тогда
				продолжить;
			КонецЕсли;		
		КонецЕсли;	
				
		Движение 						= ТаблицаДвижений.Добавить();
		Движение.Период 				= Выборка.Дата;	
		Движение.Счет					= Выборка.СчетДоходовБУ;
		Движение.Номенклатура 			= Выборка.Номенклатура;
		Движение.ПинКод             	= Выборка.ПинКод;
		Движение.КодТНВЭД           	= Выборка.КодТНВЭД;
		Движение.ЕдиницаИзмерения   	= Выборка.ЕдиницаИзмерения;
		
		Движение.СуммаБезНалогов 		= Выборка.Сумма;
		Движение.СуммаПошлины			= Выборка.СуммаПошлины;
		Движение.СуммаСборов			= Выборка.СуммаСборов;		
		Движение.СсылкаНаДокумент		= Док;
		Движение.ДоговорКонтрагента 	= Выборка.ДоговорКонтрагента;
		Движение.Контрагент 			= Выборка.Контрагент;
		Движение.Организация 			= Выборка.Организация;				
		Движение.Количество 			= Выборка.Количество;
		Движение.Цена 					= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);		
		Движение.Валюта 				= Выборка.Валюта;
		Движение.КурсТенге 				= Выборка.КурсВалюты;
		
		Движение.НомерГТД				= Выборка.НомерГТД;
		Движение.ДатаГТД				= Выборка.ДатаГТД;
		Движение.НомерИнвойса			= Выборка.НомерИнвойса;		
		Движение.ДатаИнвойса			= Выборка.ДатаИнвойса;
		Движение.УсловияПоставки		= Выборка.УсловияПоставки;
		Движение.МестоОтгрузки			= Выборка.МестоОтгрузки;
		Движение.ДатаПаспортаСделки		= Выборка.ДатаПаспортаСделки;
		Движение.НомерПаспортаСделки	= Выборка.НомерПаспортаСделки;
		Движение.ДатаОплаты				= Выборка.ДатаОплаты;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу реализации
// если дополнение встроено в конфигурацию "1С-Рейтинг: Нефтебаза"
//
Процедура ВыполнитьДвиженияПоМониторингуРеализацииГСМ(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
			
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	//Делаем проверку на правильность обращения к перечислению
	//в конфигурации "Бухгалтерии для Казахстана" релиз 1.5.5.4 и ниже,
	//использовалось перечисление "ВидыОперацийРеализацииТоваровУслуг"
	//начиная с версии 1.5.6.11 используется перечисление "ВидыОперацийРеализацияТоваров"
	Если Метаданные.Перечисления.Найти("ВидыОперацийРеализацияТоваров") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацияТоваров"].ПередачаСтруктурномуПодразделению);
	ИначеЕсли  Метаданные.Перечисления.Найти("ВидыОперацийРеализацииТоваровУслуг") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацииТоваровУслуг"].ПередачаСтруктурномуПодразделению);	
	КонецЕсли; 
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеОС", Перечисления.ВидыОперацийПередачиОС.ПередачаСтруктурномуПодразделению);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеГСМ", Перечисления.гсм_ВидыОперацийРеализации.ПередачаСтруктурномуПодразделению);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.СчетДоходовБУ,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.СтавкаНДС,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.ОснованиеВозврата,
	               |	ВложенныйЗапрос.Организация,
	               |	ЕСТЬNULL(ВложенныйЗапрос.ПинКод, моп_ОбъектыМониторинга.ПинКод) КАК ПинКод,
	               |	ВложенныйЗапрос.СуммаАкциза,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА (НЕ ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL )
	               |				И ВложенныйЗапрос.Контрагент.Ссылка <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				И (ВложенныйЗапрос.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |					И (НЕ ВложенныйЗапрос.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус))
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL 
	               |				ИЛИ ВложенныйЗапрос.Контрагент.Ссылка = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК КонтрагентЯвляетсяЧастнымЛицом
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВозвратТоваровОтПокупателяТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |		ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент КАК Контрагент,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВозвратТоваровОтПокупателяТовары.Цена КАК Цена,
	               |		ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |					И ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС - ВозвратТоваровОтПокупателяТовары.СуммаАкциза
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаАкциза
	               |			ИНАЧЕ ВозвратТоваровОтПокупателяТовары.Сумма
	               |		КОНЕЦ КАК Сумма,
	               |		ВозвратТоваровОтПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	               |		ВозвратТоваровОтПокупателяТовары.СуммаНДС КАК СуммаНДС,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Дата КАК Дата,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка КАК СсылкаНаДокумент,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.ДокументОснование КАК ОснованиеВозврата,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Организация КАК Организация,
	               |		NULL КАК ПинКод,
	               |		ВозвратТоваровОтПокупателяТовары.СуммаАкциза КАК СуммаАкциза,
	               |		ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	               |	ГДЕ
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен = ИСТИНА
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровОтПокупателяУслуги.СчетДоходовБУ,
	               |		ВозвратТоваровОтПокупателяУслуги.Номенклатура,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Контрагент,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.ДоговорКонтрагента,
	               |		ВозвратТоваровОтПокупателяУслуги.Цена,
	               |		ВозвратТоваровОтПокупателяУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровОтПокупателяУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровОтПокупателяУслуги.Сумма - ВозвратТоваровОтПокупателяУслуги.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровОтПокупателяУслуги.Сумма
	               |		КОНЕЦ,
	               |		ВозвратТоваровОтПокупателяУслуги.СтавкаНДС,
	               |		ВозвратТоваровОтПокупателяУслуги.СуммаНДС,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Дата,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.ДокументОснование,
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Организация,
	               |		NULL,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.ВозвратТоваровОтПокупателя.Услуги КАК ВозвратТоваровОтПокупателяУслуги
	               |	ГДЕ
	               |		ВозвратТоваровОтПокупателяУслуги.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.Проведен = ИСТИНА
	               |		И ВозвратТоваровОтПокупателяУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.СчетДоходовБУ,
	               |		РеализацияТоваровУслугТовары.Номенклатура,
	               |		РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугТовары.Цена,
	               |		РеализацияТоваровУслугТовары.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |					И РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС - РеализацияТоваровУслугТовары.СуммаАкциза
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаАкциза
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугТовары.СтавкаНДС,
	               |		РеализацияТоваровУслугТовары.СуммаНДС,
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата,
	               |		РеализацияТоваровУслугТовары.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияТоваровУслугТовары.Ссылка.Организация,
	               |		NULL,
	               |		РеализацияТоваровУслугТовары.СуммаАкциза,
	               |		РеализацияТоваровУслугТовары.ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Номенклатура,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Контрагент,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Цена,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	               |		АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка,
	               |		0,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация,
	               |		NULL,
	               |		0,
	               |		АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	               |	ГДЕ
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация = &Организация
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаНМА.СчетДоходовБУ,
	               |		ПередачаНМА.НематериальныйАктив,
	               |		ПередачаНМА.Контрагент,
	               |		ПередачаНМА.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		ПередачаНМА.СтавкаНДС,
	               |		ПередачаНМА.СуммаНДС,
	               |		ПередачаНМА.Дата,
	               |		ПередачаНМА.Ссылка,
	               |		0,
	               |		ПередачаНМА.Организация,
	               |		NULL,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаНМА КАК ПередачаНМА
	               |	ГДЕ
	               |		ПередачаНМА.Дата >= &НачДата
	               |		И ПередачаНМА.Дата <= &КонДата
	               |		И ПередачаНМА.Организация = &Организация
	               |		И ПередачаНМА.Проведен = ИСТИНА
	               |		И ПередачаНМА.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаОСОС.СчетДоходовБУ,
	               |		ПередачаОСОС.ОсновноеСредство,
	               |		ПередачаОСОС.Ссылка.Контрагент,
	               |		ПередачаОСОС.Ссылка.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		ПередачаОСОС.СтавкаНДС,
	               |		ПередачаОСОС.СуммаНДС,
	               |		ПередачаОСОС.Ссылка.Дата,
	               |		ПередачаОСОС.Ссылка.Ссылка,
	               |		0,
	               |		ПередачаОСОС.Ссылка.Организация,
	               |		NULL,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаОС.ОС КАК ПередачаОСОС
	               |	ГДЕ
	               |		ПередачаОСОС.Ссылка.Дата >= &НачДата
	               |		И ПередачаОСОС.Ссылка.Дата <= &КонДата
	               |		И ПередачаОСОС.Ссылка.Организация = &Организация
	               |		И ПередачаОСОС.Ссылка.Проведен = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И ПередачаОСОС.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеОС
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугУслуги.СчетДоходовБУ,
	               |		РеализацияТоваровУслугУслуги.Номенклатура,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугУслуги.Цена,
	               |		РеализацияТоваровУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.СтавкаНДС,
	               |		РеализацияТоваровУслугУслуги.СуммаНДС,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Организация,
	               |		NULL,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеУслуги.Номенклатура,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеУслуги.Цена,
	               |		РеализацияУслугПоПереработкеУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.СтавкаНДС,
	               |		РеализацияУслугПоПереработкеУслуги.СуммаНДС,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Организация,
	               |		NULL,
	               |		0,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		гсм_ВозвратОтПокупателяТовары.СчетДоходовБУ,
	               |		гсм_ВозвратОтПокупателяТовары.Номенклатура,
	               |		гсм_ВозвратОтПокупателяТовары.Ссылка.Контрагент,
	               |		гсм_ВозвратОтПокупателяТовары.Ссылка.ДоговорКонтрагента,
	               |		гсм_ВозвратОтПокупателяТовары.Цена,
	               |		гсм_ВозвратОтПокупателяТовары.Количество,
	               |		ВЫБОР
	               |			КОГДА гсм_ВозвратОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |					И гсм_ВозвратОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА гсм_ВозвратОтПокупателяТовары.Сумма - гсм_ВозвратОтПокупателяТовары.СуммаНДС - гсм_ВозвратОтПокупателяТовары.СуммаАкциза
	               |			КОГДА гсм_ВозвратОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА гсм_ВозвратОтПокупателяТовары.Сумма - гсм_ВозвратОтПокупателяТовары.СуммаНДС
	               |			КОГДА гсм_ВозвратОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА гсм_ВозвратОтПокупателяТовары.Сумма - гсм_ВозвратОтПокупателяТовары.СуммаАкциза
	               |			ИНАЧЕ гсм_ВозвратОтПокупателяТовары.Сумма
	               |		КОНЕЦ,
	               |		гсм_ВозвратОтПокупателяТовары.СтавкаНДС,
	               |		гсм_ВозвратОтПокупателяТовары.СуммаНДС,
	               |		гсм_ВозвратОтПокупателяТовары.Ссылка.Дата,
	               |		гсм_ВозвратОтПокупателяТовары.Ссылка,
	               |		гсм_ВозвратОтПокупателяТовары.Ссылка.ДокументОснование,
	               |		гсм_ВозвратОтПокупателяТовары.Ссылка.Организация,
	               |		гсм_ВозвратОтПокупателяТовары.ПинКод.Код,
	               |		гсм_ВозвратОтПокупателяТовары.СуммаАкциза,
	               |		гсм_ВозвратОтПокупателяТовары.Номенклатура.БазоваяЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.гсм_ВозвратОтПокупателя.Товары КАК гсм_ВозвратОтПокупателяТовары
	               |	ГДЕ
	               |		гсм_ВозвратОтПокупателяТовары.Ссылка.Дата >= &НачДата
	               |		И гсм_ВозвратОтПокупателяТовары.Ссылка.Организация = &Организация
	               |		И гсм_ВозвратОтПокупателяТовары.Ссылка.Дата <= &КонДата
	               |		И гсм_ВозвратОтПокупателяТовары.Ссылка.Проведен = ИСТИНА
	               |		И гсм_ВозвратОтПокупателяТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		гсм_РеализацияТовары.СчетДоходовБУ,
	               |		гсм_РеализацияТовары.Номенклатура,
	               |		гсм_РеализацияТовары.Ссылка.Контрагент,
	               |		гсм_РеализацияТовары.Ссылка.ДоговорКонтрагента,
	               |		гсм_РеализацияТовары.Цена,
	               |		гсм_РеализацияТовары.Количество,
	               |		ВЫБОР
	               |			КОГДА гсм_РеализацияТовары.Ссылка.СуммаВключаетНДС
	               |					И гсм_РеализацияТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА гсм_РеализацияТовары.Сумма - гсм_РеализацияТовары.СуммаНДС - гсм_РеализацияТовары.СуммаАкциза
	               |			КОГДА гсм_РеализацияТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА гсм_РеализацияТовары.Сумма - гсм_РеализацияТовары.СуммаНДС
	               |			КОГДА гсм_РеализацияТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА гсм_РеализацияТовары.Сумма - гсм_РеализацияТовары.СуммаАкциза
	               |			ИНАЧЕ гсм_РеализацияТовары.Сумма
	               |		КОНЕЦ,
	               |		гсм_РеализацияТовары.СтавкаНДС,
	               |		гсм_РеализацияТовары.СуммаНДС,
	               |		гсм_РеализацияТовары.Ссылка.Дата,
	               |		гсм_РеализацияТовары.Ссылка.Ссылка,
	               |		0,
	               |		гсм_РеализацияТовары.Ссылка.Организация,
	               |		гсм_РеализацияТовары.ПинКод.Код,
	               |		гсм_РеализацияТовары.СуммаАкциза,
	               |		гсм_РеализацияТовары.Номенклатура.БазоваяЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.гсм_Реализация.Товары КАК гсм_РеализацияТовары
	               |	ГДЕ
	               |		гсм_РеализацияТовары.Ссылка.Дата >= &НачДата
	               |		И гсм_РеализацияТовары.Ссылка.Дата <= &КонДата
	               |		И гсм_РеализацияТовары.Ссылка.Организация = &Организация
	               |		И гсм_РеализацияТовары.Ссылка.Проведен = ИСТИНА
	               |		И гсм_РеализацияТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И гсм_РеализацияТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеГСМ
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		гсм_РеализацияТоварыЧерезАЗС.СчетДоходовБУ,
	               |		гсм_РеализацияТоварыЧерезАЗС.Номенклатура,
	               |		гсм_РеализацияТоварыЧерезАЗС.Контрагент,
	               |		гсм_РеализацияТоварыЧерезАЗС.ДоговорКонтрагента,
	               |		гсм_РеализацияТоварыЧерезАЗС.Цена,
	               |		гсм_РеализацияТоварыЧерезАЗС.Количество,
	               |		гсм_РеализацияТоварыЧерезАЗС.Сумма,
	               |		гсм_РеализацияТоварыЧерезАЗС.СтавкаНДС,
	               |		гсм_РеализацияТоварыЧерезАЗС.СуммаНДС,
	               |		гсм_РеализацияТоварыЧерезАЗС.Дата,
	               |		гсм_РеализацияТоварыЧерезАЗС.СсылкаНаДокумент,
	               |		гсм_РеализацияТоварыЧерезАЗС.ОснованиеВозврата,
	               |		гсм_РеализацияТоварыЧерезАЗС.Организация,
	               |		гсм_РеализацияТоварыЧерезАЗС.ПинКод,
	               |		гсм_РеализацияТоварыЧерезАЗС.СуммаАкциза,
	               |		гсм_РеализацияТоварыЧерезАЗС.Номенклатура.БазоваяЕдиницаИзмерения
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			гсм_РеализацияЧерезАЗСТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |			гсм_РеализацияЧерезАЗСТовары.Номенклатура КАК Номенклатура,
	               |			гсм_РеализацияЧерезАЗСКонтрагенты.Контрагент КАК Контрагент,
	               |			гсм_РеализацияЧерезАЗСКонтрагенты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			гсм_РеализацияЧерезАЗСТовары.Цена КАК Цена,
	               |			гсм_РеализацияЧерезАЗСТовары.Количество КАК Количество,
	               |			ВЫБОР
	               |				КОГДА гсм_РеализацияЧерезАЗСТовары.Ссылка.СуммаВключаетНДС
	               |						И гсм_РеализацияЧерезАЗСТовары.Ссылка.СуммаВключаетАкциз
	               |					ТОГДА гсм_РеализацияЧерезАЗСТовары.Сумма - гсм_РеализацияЧерезАЗСТовары.СуммаНДС - гсм_РеализацияЧерезАЗСТовары.СуммаАкциза
	               |				КОГДА гсм_РеализацияЧерезАЗСТовары.Ссылка.СуммаВключаетНДС
	               |					ТОГДА гсм_РеализацияЧерезАЗСТовары.Сумма - гсм_РеализацияЧерезАЗСТовары.СуммаНДС
	               |				КОГДА гсм_РеализацияЧерезАЗСТовары.Ссылка.СуммаВключаетАкциз
	               |					ТОГДА гсм_РеализацияЧерезАЗСТовары.Сумма - гсм_РеализацияЧерезАЗСТовары.СуммаАкциза
	               |				ИНАЧЕ гсм_РеализацияЧерезАЗСТовары.Сумма
	               |			КОНЕЦ КАК Сумма,
	               |			гсм_РеализацияЧерезАЗСТовары.СтавкаНДС КАК СтавкаНДС,
	               |			гсм_РеализацияЧерезАЗСТовары.СуммаНДС КАК СуммаНДС,
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Дата КАК Дата,
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Ссылка КАК СсылкаНаДокумент,
	               |			0 КАК ОснованиеВозврата,
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Организация КАК Организация,
	               |			гсм_РеализацияЧерезАЗСТовары.ПинКод.Код КАК ПинКод,
	               |			гсм_РеализацияЧерезАЗСТовары.СуммаАкциза КАК СуммаАкциза
	               |		ИЗ
	               |			Документ.гсм_РеализацияЧерезАЗС.Товары КАК гсм_РеализацияЧерезАЗСТовары
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.гсм_РеализацияЧерезАЗС.Контрагенты КАК гсм_РеализацияЧерезАЗСКонтрагенты
	               |				ПО гсм_РеализацияЧерезАЗСТовары.Ссылка = гсм_РеализацияЧерезАЗСКонтрагенты.Ссылка
	               |					И гсм_РеализацияЧерезАЗСТовары.НомерКонтрагента = гсм_РеализацияЧерезАЗСКонтрагенты.НомерСтроки
	               |		ГДЕ
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Дата >= &НачДата
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.Дата <= &КонДата
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.Организация = &Организация
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.Проведен = ИСТИНА
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета) КАК гсм_РеализацияТоварыЧерезАЗС) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП";	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингРеализации.СоздатьНаборЗаписей();	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	ДоступенРеквизитОсновнойСчетФактура = ?(Метаданные.Документы.СчетФактураВыданный.Реквизиты.Найти("ОсновнойСчетФактура") = Неопределено, Ложь, Истина);
	
	ИспользоватьДанныеИзДополнительныхСчетовФактур = моп_Общий.ИспользоватьДанныеИзДополнительныхСчетовФактур(ДанныеДокумента.Дата);
	Если ИспользоватьДанныеИзДополнительныхСчетовФактур = Неопределено Тогда
		ИспользоватьДанныеИзДополнительныхСчетовФактур = Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.СсылкаНаДокумент;
				
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;
		Движение.Счет 				= Выборка.СчетДоходовБУ;
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ПинКод 		    = Выборка.ПинКод;
		Движение.КодТНВЭД 		    = Выборка.КодТНВЭД;
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Движение.Контрагент 		= Выборка.Контрагент;	
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.СсылкаНаДокумент 	= Док;
		
		Движение.СчетФактура 		= ОбщегоНазначения.НайтиПодчиненныйДокумент(Док, "СчетФактураВыданный");
		
		Если ЗначениеЗаполнено(Движение.СчетФактура) Тогда								
			Движение.СчетФактураЯвляетсяДополнительным = Движение.СчетФактура.Дополнительная;
			Если ДоступенРеквизитОсновнойСчетФактура Тогда				
				Движение.СчетФактураКорректируемый = Движение.СчетФактура.ОсновнойСчетФактура;				
			КонецЕсли;						
		КонецЕсли;	
				
		ДанныеКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Выборка.Дата);		
		
		Если ИспользоватьДанныеИзДополнительныхСчетовФактур и ЗначениеЗаполнено(Движение.СчетФактура) и Движение.СчетФактураЯвляетсяДополнительным Тогда
			ЗаполнитьДанныеИзДополнительногоСчетаФактуры(Движение.СчетФактура, Движение, Выборка, ДанныеКурсаВалюты, ВалютаРегламентированногоУчета, Истина);
		Иначе
				
		Движение.Количество 		= Выборка.Количество;
		
		Движение.СуммаБезНалогов 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
		Док.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Док.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Док.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);		
				
		Движение.Акциз 				= ?(Выборка.СуммаАкциза = NULL, 0 , Выборка.СуммаАкциза);
		
		Движение.СуммаНДС 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, 
		Док.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Док.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Док.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
		
		КонецЕсли;
		
		Движение.СтавкаНДС 			= Выборка.СтавкаНДС;		
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);
		
		Если Не ЗначениеЗаполнено(Движение.СчетФактураКорректируемый) Тогда
			Если ЗначениеЗаполнено(Выборка.ОснованиеВозврата) Тогда
				Движение.СчетФактураКорректируемый = ОбщегоНазначения.НайтиПодчиненныйДокумент(Выборка.ОснованиеВозврата, "СчетФактураВыданный");
			КонецЕсли;			
		КонецЕсли; 
		
		Движение.Организация 		= Выборка.Организация;
		Движение.КонтрагентЯвляетсяЧастнымЛицом = Выборка.КонтрагентЯвляетсяЧастнымЛицом;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
		
КонецПроцедуры

// Выполняет движения по мониторингу покупок
// если дополнение встроено в конфигурацию "1С-Рейтинг: Нефтебаза"
//
Процедура ВыполнитьДвиженияПоМониторингуПокупокГСМ(ДанныеДокумента,НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВидОперацииИмпорт", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);
	Запрос.УстановитьПараметр("ВидОперацииИмпортГСМ", Перечисления.гсм_ВидыОперацийПоступление.Импорт);			
	Запрос.УстановитьПараметр("ВидСубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоТиповые.ОсновныеСредства);
	Запрос.УстановитьПараметр("ВидСубконтоНоменклатура", ПланыВидовХарактеристик.ВидыСубконтоТиповые.Номенклатура);
	Запрос.УстановитьПараметр("ВидСубконтоНМА", ПланыВидовХарактеристик.ВидыСубконтоТиповые.НематериальныеАктивы);	
	Запрос.УстановитьПараметр("ПустойПинКод", Справочники.гсм_ПинКоды.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтСтруктурногоПодразделения);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеГСМ", Перечисления.гсм_ВидыОперацийПоступление.ОтСтруктурногоПодразделения);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	               |	МАКСИМУМ(ВложенныйЗапрос.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ВложенныйЗапрос.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ВложенныйЗапрос.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ВложенныйЗапрос.Организация) КАК Организация
	               |ПОМЕСТИТЬ ВТ_ПоступлениеНМА
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеНМА.Ссылка КАК Ссылка,
	               |		ПоступлениеНМА.Дата КАК Дата,
	               |		ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПоступлениеНМА.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПоступлениеНМА.Контрагент КАК Контрагент,
	               |		ПоступлениеНМА.Организация КАК Организация
	               |	ИЗ
	               |		Документ.ПоступлениеНМА КАК ПоступлениеНМА
	               |	ГДЕ
	               |		ПоступлениеНМА.Дата >= &НачДата
	               |		И ПоступлениеНМА.Дата <= &КонДата
	               |		И ПоступлениеНМА.Организация = &Организация
	               |		И ПоступлениеНМА.Проведен) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО ВложенныйЗапрос.Ссылка = СчетФактураПолученныйДокументыОснования.ДокументОснование
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Дата) КАК Дата,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Организация) КАК Организация,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.ДоговорКонтрагента) КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслуг
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |		ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |		ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |		ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |		ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |	ГДЕ
	               |		ПоступлениеТоваровУслуг.Дата >= &НачДата
	               |		И ПоступлениеТоваровУслуг.Дата <= &КонДата
	               |		И ПоступлениеТоваровУслуг.ВидОперации <> &ВидОперацииИмпорт
	               |		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	               |		И ПоступлениеТоваровУслуг.Организация = &Организация
	               |		И ПоступлениеТоваровУслуг.ВидОперации <> &ВидОперацииСтруктурные) КАК ПоступлениеТоваровУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ПоступлениеТоваровУслуг.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ПоступлениеТоваровУслуг)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НДСЗаНерезидентаОбороты.ДокументПоступления КАК ДокументПоступления,
	               |	НДСЗаНерезидентаОбороты.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_НДСЗаНерезидента
	               |ИЗ
	               |	РегистрНакопления.НДСЗаНерезидента.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Налогоплательщик = &Организация
	               |				И ДокументПоступления В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеТоваровУслуг
	               |			
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |					ВЫБРАТЬ
	               |						ВТ_ПоступлениеНМА.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеНМА)) КАК НДСЗаНерезидентаОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументПоступления,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.СтавкаНДС,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.Счет,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.ОснованиеВозврата,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.СуммаИПН,
	               |	ЕСТЬNULL(ВложенныйЗапрос.ПинКод, моп_ОбъектыМониторинга.ПинКод) КАК ПинКод,
	               |	моп_ОбъектыМониторинга.КодТНВЭД КАК КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.ВалютаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КратностьВзаиморасчетов, 0) КАК КратностьВзаиморасчетов,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КурсВзаиморасчетов, 0) КАК КурсВзаиморасчетов,
	               |	ВложенныйЗапрос.СчетФактура,
	               |	ВЫБОР
	               |		КОГДА (НЕ ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL )
	               |				И ВложенныйЗапрос.Контрагент.Ссылка <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				И (ВложенныйЗапрос.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |					И (НЕ ВложенныйЗапрос.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус))
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL 
	               |				ИЛИ ВложенныйЗапрос.Контрагент.Ссылка = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК КонтрагентЯвляетсяЧастнымЛицом
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугТовары.Ссылка КАК СсылкаНаДокумент,
	               |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |		ВТ_ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |		ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	               |		ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |		ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |		ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК Счет,
	               |		ВТ_ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |		0 КАК ОснованиеВозврата,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |		КОНЕЦ КАК Сумма,
	               |		Налоги.СуммаИПНВсего * ПоступлениеТоваровУслугТовары.Сумма / Поступления.СуммаПоступленияВсего КАК СуммаИПН,
	               |		NULL КАК ПинКод,
	               |		ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.СчетФактура КАК СчетФактура
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК СуммаИПНВсего
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |				СУММА(ВложенныйЗапрос.СуммаПоступленияВсего) КАК СуммаПоступленияВсего
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК СуммаПоступленияВсего
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугТовары.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугТовары.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугУслуги.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугУслуги.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугУслуги.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |					И (НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |								(ВЫБРАТЬ
	               |									ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |									ВТ_НДСЗаНерезидента.Номенклатура
	               |								ИЗ
	               |									ВТ_НДСЗаНерезидента))
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугУслуги.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугОС.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугОС.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугОС.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугОС.Ссылка) КАК ВложенныйЗапрос
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВложенныйЗапрос.Ссылка) КАК Поступления
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = Поступления.Ссылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугУслуги.Ссылка,
	               |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |		ВТ_ПоступлениеТоваровУслуг.Организация,
	               |		ПоступлениеТоваровУслугУслуги.Номенклатура,
	               |		ПоступлениеТоваровУслугУслуги.Цена,
	               |		ПоступлениеТоваровУслугУслуги.Количество,
	               |		ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	               |		ПоступлениеТоваровУслугУслуги.СуммаНДС,
	               |		ПоступлениеТоваровУслугУслуги.СчетЗатратБУ,
	               |		ПоступлениеТоваровУслугУслуги.Ссылка.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеТоваровУслугУслуги.Сумма / Поступления.Сумма,
	               |		NULL,
	               |		NULL,
	               |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.СчетФактура
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |				СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК Сумма
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугТовары.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугТовары.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугУслуги.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугУслуги.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |				ГДЕ
	               |					(НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |								(ВЫБРАТЬ
	               |									ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |									ВТ_НДСЗаНерезидента.Номенклатура
	               |								ИЗ
	               |									ВТ_НДСЗаНерезидента))
	               |					И ПоступлениеТоваровУслугУслуги.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугУслуги.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугОС.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугОС.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугОС.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугОС.Ссылка) КАК ВложенныйЗапрос
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВложенныйЗапрос.Ссылка) КАК Поступления
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |	ГДЕ
	               |		(НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |					(ВЫБРАТЬ
	               |						ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |						ВТ_НДСЗаНерезидента.Номенклатура
	               |					ИЗ
	               |						ВТ_НДСЗаНерезидента))
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугОС.Ссылка,
	               |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |		ВТ_ПоступлениеТоваровУслуг.Организация,
	               |		ПоступлениеТоваровУслугОС.ОсновноеСредство,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ПоступлениеТоваровУслугОС.СтавкаНДС,
	               |		ПоступлениеТоваровУслугОС.СуммаНДС,
	               |		ПоступлениеТоваровУслугОС.СчетУчетаБУ,
	               |		ВТ_ПоступлениеТоваровУслуг.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеТоваровУслугОС.Сумма / Поступления.Сумма,
	               |		NULL,
	               |		NULL,
	               |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.СчетФактура
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |				СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК Сумма
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугТовары.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугТовары.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугУслуги.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугУслуги.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугУслуги.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |					И (НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |								(ВЫБРАТЬ
	               |									ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |									ВТ_НДСЗаНерезидента.Номенклатура
	               |								ИЗ
	               |									ВТ_НДСЗаНерезидента))
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугУслуги.Ссылка
	               |				
	               |				ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |				ВЫБРАТЬ
	               |					ПоступлениеТоваровУслугОС.Ссылка,
	               |					СУММА(ПоступлениеТоваровУслугОС.Сумма)
	               |				ИЗ
	               |					Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |				ГДЕ
	               |					ПоступлениеТоваровУслугОС.Ссылка В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеТоваровУслуг)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПоступлениеТоваровУслугОС.Ссылка) КАК ВложенныйЗапрос
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ВложенныйЗапрос.Ссылка) КАК Поступления
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТиповойДвиженияССубконто.Регистратор.Ссылка,
	               |		ТиповойДвиженияССубконто.Регистратор.ДоговорКонтрагента,
	               |		ТиповойДвиженияССубконто.Регистратор.Контрагент,
	               |		ТиповойДвиженияССубконто.Регистратор.Организация,
	               |		ТиповойДвиженияССубконто.СубконтоДт1,
	               |		ТиповойДвиженияССубконто.Сумма,
	               |		0,
	               |		НДСКВозмещению.СтавкаНДС,
	               |		ЕСТЬNULL(НДСКВозмещению.УплаченныйНДС, 0),
	               |		ТиповойДвиженияССубконто.СчетДт,
	               |		ТиповойДвиженияССубконто.Регистратор.Дата,
	               |		0,
	               |		ТиповойДвиженияССубконто.Сумма,
	               |		NULL,
	               |		NULL,
	               |		NULL,
	               |		&ВалютаРегУчета,
	               |		1,
	               |		1,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ТиповойДвиженияССубконто.Регистратор КАК Регистратор,
	               |				ТиповойДвиженияССубконто.СчетДт КАК СчетДт,
	               |				ТиповойДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |				ТиповойДвиженияССубконто.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	               |				СУММА(ТиповойДвиженияССубконто.Сумма) КАК Сумма
	               |			ИЗ
	               |				РегистрБухгалтерии.Типовой.ДвиженияССубконто(
	               |						,
	               |						,
	               |						(ВидСубконтоДт1 = &ВидСубконтоОС
	               |							ИЛИ ВидСубконтоДт1 = &ВидСубконтоНоменклатура
	               |							ИЛИ ВидСубконтоДт1 = &ВидСубконтоНМА)
	               |							И Регистратор.Дата >= &НачДата
	               |							И Регистратор.Дата <= &КонДата
	               |							И Регистратор.Организация = &Организация,
	               |						,
	               |						) КАК ТиповойДвиженияССубконто
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ТиповойДвиженияССубконто.ВидСубконтоДт1,
	               |				ТиповойДвиженияССубконто.Регистратор,
	               |				ТиповойДвиженияССубконто.СубконтоДт1,
	               |				ТиповойДвиженияССубконто.СчетДт) КАК ТиповойДвиженияССубконто
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					НДСКВозмещению.Регистратор КАК Регистратор,
	               |					НДСКВозмещению.СтавкаНДС КАК СтавкаНДС,
	               |					СУММА(НДСКВозмещению.УплаченныйНДС) КАК УплаченныйНДС,
	               |					НДСКВозмещению.ТМЗ КАК ТМЗ
	               |				ИЗ
	               |					РегистрНакопления.НДСКВозмещению КАК НДСКВозмещению
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					НДСКВозмещению.Регистратор,
	               |					НДСКВозмещению.ТМЗ,
	               |					НДСКВозмещению.СтавкаНДС) КАК НДСКВозмещению
	               |				ПО ТиповойДвиженияССубконто.СубконтоДт1 = НДСКВозмещению.ТМЗ
	               |					И ТиповойДвиженияССубконто.Регистратор = НДСКВозмещению.Регистратор
	               |			ПО ПоступлениеДопРасходов.Ссылка = ТиповойДвиженияССубконто.Регистратор
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуТовары.Ссылка,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.ДоговорКонтрагента,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.Организация,
	               |		ВозвратТоваровПоставщикуТовары.Номенклатура,
	               |		ВозвратТоваровПоставщикуТовары.Цена,
	               |		ВозвратТоваровПоставщикуТовары.Количество,
	               |		ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуТовары.СуммаНДС,
	               |		ВозвратТоваровПоставщикуТовары.СчетУчетаБУ,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.Дата,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуТовары.Сумма - ВозвратТоваровПоставщикуТовары.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуТовары.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.ВалютаДокумента,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.КратностьВзаиморасчетов,
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.КурсВзаиморасчетов,
	               |		NULL
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |	ГДЕ
	               |		ВозвратТоваровПоставщикуТовары.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровПоставщикуТовары.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровПоставщикуТовары.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровПоставщикуТовары.Ссылка.Проведен = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеНМАНМА.Ссылка,
	               |		ВТ_ПоступлениеНМА.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеНМА.Контрагент,
	               |		ВТ_ПоступлениеНМА.Организация,
	               |		ПоступлениеНМАНМА.НематериальныйАктив,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ПоступлениеНМАНМА.СтавкаНДС,
	               |		ПоступлениеНМАНМА.СуммаНДС,
	               |		ПоступлениеНМАНМА.СчетУчетаБУ,
	               |		ВТ_ПоступлениеНМА.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеНМАНМА.Сумма / Поступления.Сумма,
	               |		NULL,
	               |		NULL,
	               |		ВТ_ПоступлениеНМА.ВалютаДокумента,
	               |		ВТ_ПоступлениеНМА.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеНМА.КурсВзаиморасчетов,
	               |		ВТ_ПоступлениеНМА.СчетФактура
	               |	ИЗ
	               |		Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ПоступлениеНМАНМА.Ссылка КАК Ссылка,
	               |				СУММА(ПоступлениеНМАНМА.Сумма) КАК Сумма
	               |			ИЗ
	               |				Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
	               |			ГДЕ
	               |				ПоступлениеНМАНМА.Ссылка В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеНМА.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеНМА)
	               |				И (НЕ (ПоступлениеНМАНМА.Ссылка, ПоступлениеНМАНМА.НематериальныйАктив) В
	               |							(ВЫБРАТЬ
	               |								ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |								ВТ_НДСЗаНерезидента.Номенклатура
	               |							ИЗ
	               |								ВТ_НДСЗаНерезидента))
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ПоступлениеНМАНМА.Ссылка) КАК Поступления
	               |			ПО ПоступлениеНМАНМА.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеНМАНМА.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеНМА КАК ВТ_ПоступлениеНМА
	               |			ПО ПоступлениеНМАНМА.Ссылка = ВТ_ПоступлениеНМА.Ссылка
	               |	ГДЕ
	               |		(НЕ (ПоступлениеНМАНМА.Ссылка, ПоступлениеНМАНМА.НематериальныйАктив) В
	               |					(ВЫБРАТЬ
	               |						ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |						ВТ_НДСЗаНерезидента.Номенклатура
	               |					ИЗ
	               |						ВТ_НДСЗаНерезидента))
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровГСМ.Ссылка,
	               |		ПоступлениеТоваровГСМ.Ссылка.ДоговорКонтрагента,
	               |		ПоступлениеТоваровГСМ.Ссылка.Контрагент,
	               |		ПоступлениеТоваровГСМ.Ссылка.Организация,
	               |		ПоступлениеТоваровГСМ.Номенклатура,
	               |		ПоступлениеТоваровГСМ.Цена,
	               |		ПоступлениеТоваровГСМ.Количество,
	               |		ПоступлениеТоваровГСМ.СтавкаНДС,
	               |		ПоступлениеТоваровГСМ.СуммаНДС,
	               |		ПоступлениеТоваровГСМ.СчетУчетаБУ,
	               |		ПоступлениеТоваровГСМ.Ссылка.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеТоваровГСМ.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровГСМ.Сумма - ПоступлениеТоваровГСМ.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровГСМ.Сумма
	               |		КОНЕЦ,
	               |		Налоги.СуммаИПНВсего * ПоступлениеТоваровГСМ.Сумма / Поступления.СуммаПоступленияВсего,
	               |		ПоступлениеТоваровГСМ.ПинКод.Код,
	               |		ПоступлениеТоваровГСМ.Номенклатура.БазоваяЕдиницаИзмерения,
	               |		ПоступлениеТоваровГСМ.Ссылка.ВалютаДокумента,
	               |		ПоступлениеТоваровГСМ.Ссылка.КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровГСМ.Ссылка.КурсВзаиморасчетов,
	               |		NULL
	               |	ИЗ
	               |		Документ.гсм_Поступление.Товары КАК ПоступлениеТоваровГСМ
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК СуммаИПНВсего
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровГСМ.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				гсм_ПоступлениеТовары.Ссылка КАК Ссылка,
	               |				СУММА(гсм_ПоступлениеТовары.Сумма) КАК СуммаПоступленияВсего
	               |			ИЗ
	               |				Документ.гсм_Поступление.Товары КАК гсм_ПоступлениеТовары
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				гсм_ПоступлениеТовары.Ссылка) КАК Поступления
	               |			ПО ПоступлениеТоваровГСМ.Ссылка = Поступления.Ссылка
	               |	ГДЕ
	               |		ПоступлениеТоваровГСМ.Ссылка.Дата >= &НачДата
	               |		И ПоступлениеТоваровГСМ.Ссылка.Дата <= &КонДата
	               |		И ПоступлениеТоваровГСМ.Ссылка.Организация = &Организация
	               |		И ПоступлениеТоваровГСМ.Ссылка.Проведен = ИСТИНА
	               |		И ПоступлениеТоваровГСМ.Ссылка.ВидОперации <> &ВидОперацииИмпортГСМ
	               |		И ПоступлениеТоваровГСМ.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеГСМ
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ДопРасходы.СсылкаНаДокумент,
	               |		ДопРасходы.ДоговорКонтрагента,
	               |		ДопРасходы.Контрагент,
	               |		ДопРасходы.Организация,
	               |		ДопРасходы.Номенклатура,
	               |		ДопРасходы.Цена,
	               |		ДопРасходы.Количество,
	               |		ДопРасходы.СтавкаНДС,
	               |		ДопРасходы.СуммаНДС,
	               |		ДопРасходы.Счет,
	               |		ДопРасходы.Дата,
	               |		ДопРасходы.ДокументОснование,
	               |		ДопРасходы.Сумма,
	               |		NULL,
	               |		ДопРасходы.ПинКод,
	               |		ДопРасходы.ЕдиницаИзмерения,
	               |		&ВалютаРегУчета,
	               |		1,
	               |		1,
	               |		NULL
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ДопРасходыПоПинКодам.СсылкаНаДокумент КАК СсылкаНаДокумент,
	               |			ДопРасходыПоПинКодам.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			ДопРасходыПоПинКодам.Контрагент КАК Контрагент,
	               |			ДопРасходыПоПинКодам.Организация КАК Организация,
	               |			ДопРасходыПоПинКодам.Номенклатура КАК Номенклатура,
	               |			ДопРасходыПоПинКодам.Цена КАК Цена,
	               |			ДопРасходыПоПинКодам.Количество КАК Количество,
	               |			ДопРасходыПоПинКодам.СтавкаНДС КАК СтавкаНДС,
	               |			ДопРасходыПоПинКодам.СуммаНДС КАК СуммаНДС,
	               |			ДопРасходыПоПинКодам.Счет КАК Счет,
	               |			ДопРасходыПоПинКодам.Дата КАК Дата,
	               |			ДопРасходыПоПинКодам.Сумма КАК Сумма,
	               |			ДопРасходыПоПинКодам.ПинКод КАК ПинКод,
	               |			ДопРасходыПоПинКодам.ДокументОснование КАК ДокументОснование,
	               |			ДопРасходыПоПинКодам.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.Ссылка КАК СсылкаНаДокумент,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.Контрагент КАК Контрагент,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.Организация КАК Организация,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Номенклатура КАК Номенклатура,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.СуммаОборот КАК Цена,
	               |				0 КАК Количество,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.СтавкаНДС КАК СтавкаНДС,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.НДСОборот КАК СуммаНДС,
	               |				гсм_УчетПоПинКодамОбороты.СчетУчета КАК Счет,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Период КАК Дата,
	               |				0 КАК ДокументОснование,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.СуммаОборот КАК Сумма,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.ПинКод.Код КАК ПинКод
	               |			ИЗ
	               |				РегистрНакопления.гсм_ОборотыПоВидамДвижения.Обороты(
	               |						&НачДата,
	               |						&КонДата,
	               |						Регистратор,
	               |						ПинКод <> &ПустойПинКод
	               |							И Организация = &Организация) КАК гсм_ОборотыПоВидамДвиженияОбороты
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.гсм_УчетПоПинКодам.Обороты(&НачДата, &КонДата, Регистратор, Организация = &Организация) КАК гсм_УчетПоПинКодамОбороты
	               |					ПО гсм_ОборотыПоВидамДвиженияОбороты.Номенклатура = гсм_УчетПоПинКодамОбороты.Номенклатура
	               |						И гсм_ОборотыПоВидамДвиженияОбороты.ПинКод = гсм_УчетПоПинКодамОбороты.ПинКод
	               |						И гсм_ОборотыПоВидамДвиженияОбороты.Регистратор = гсм_УчетПоПинКодамОбороты.Регистратор
	               |			ГДЕ
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор ССЫЛКА Документ.гсм_ПоступлениеДопРасходов) КАК ДопРасходыПоПинКодам
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ДопРасходы.СсылкаНаДокумент,
	               |			ДопРасходы.ДоговорКонтрагента,
	               |			ДопРасходы.Контрагент,
	               |			ДопРасходы.Организация,
	               |			ДопРасходы.Номенклатура,
	               |			ДопРасходы.Цена,
	               |			ДопРасходы.Количество,
	               |			ДопРасходы.СтавкаНДС,
	               |			ДопРасходы.СуммаНДС,
	               |			ДопРасходы.Счет,
	               |			ДопРасходы.Дата,
	               |			ДопРасходы.Сумма,
	               |			ДопРасходы.ПинКод,
	               |			ДопРасходы.ДокументОснование,
	               |			ДопРасходы.Номенклатура.БазоваяЕдиницаИзмерения
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.Ссылка КАК СсылкаНаДокумент,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.Контрагент КАК Контрагент,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор.Организация КАК Организация,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Номенклатура КАК Номенклатура,
	               |				ТиповойДвиженияССубконто.Сумма КАК Цена,
	               |				0 КАК Количество,
	               |				НДСКВозмещению.СтавкаНДС КАК СтавкаНДС,
	               |				ЕСТЬNULL(НДСКВозмещению.УплаченныйНДС, 0) КАК СуммаНДС,
	               |				ТиповойДвиженияССубконто.СчетДт КАК Счет,
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Период КАК Дата,
	               |				0 КАК ДокументОснование,
	               |				NULL КАК ПинКод,
	               |				ТиповойДвиженияССубконто.Сумма КАК Сумма
	               |			ИЗ
	               |				РегистрНакопления.гсм_ОборотыПоВидамДвижения.Обороты(
	               |						&НачДата,
	               |						&КонДата,
	               |						Регистратор,
	               |						ПинКод = &ПустойПинКод
	               |							И Организация = &Организация) КАК гсм_ОборотыПоВидамДвиженияОбороты
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						НДСКВозмещению.Регистратор КАК Регистратор,
	               |						НДСКВозмещению.СтавкаНДС КАК СтавкаНДС,
	               |						СУММА(НДСКВозмещению.УплаченныйНДС) КАК УплаченныйНДС,
	               |						НДСКВозмещению.ТМЗ КАК ТМЗ
	               |					ИЗ
	               |						РегистрНакопления.НДСКВозмещению КАК НДСКВозмещению
	               |					ГДЕ
	               |						НДСКВозмещению.Организация = &Организация
	               |					
	               |					СГРУППИРОВАТЬ ПО
	               |						НДСКВозмещению.Регистратор,
	               |						НДСКВозмещению.ТМЗ,
	               |						НДСКВозмещению.СтавкаНДС) КАК НДСКВозмещению
	               |					ПО гсм_ОборотыПоВидамДвиженияОбороты.Регистратор = НДСКВозмещению.Регистратор
	               |						И гсм_ОборотыПоВидамДвиженияОбороты.Номенклатура = НДСКВозмещению.ТМЗ
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						ТиповойДвиженияССубконто.Регистратор КАК Регистратор,
	               |						ТиповойДвиженияССубконто.СчетДт КАК СчетДт,
	               |						ТиповойДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |						ТиповойДвиженияССубконто.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	               |						СУММА(ТиповойДвиженияССубконто.Сумма) КАК Сумма
	               |					ИЗ
	               |						РегистрБухгалтерии.Типовой.ДвиженияССубконто(
	               |								,
	               |								,
	               |								(ВидСубконтоДт1 = &ВидСубконтоОС
	               |									ИЛИ ВидСубконтоДт1 = &ВидСубконтоНоменклатура
	               |									ИЛИ ВидСубконтоДт1 = &ВидСубконтоНМА)
	               |									И Регистратор.Дата >= &НачДата
	               |									И Регистратор.Дата <= &КонДата
	               |									И Регистратор.Организация = &Организация,
	               |								,
	               |								) КАК ТиповойДвиженияССубконто
	               |					
	               |					СГРУППИРОВАТЬ ПО
	               |						ТиповойДвиженияССубконто.ВидСубконтоДт1,
	               |						ТиповойДвиженияССубконто.Регистратор,
	               |						ТиповойДвиженияССубконто.СубконтоДт1,
	               |						ТиповойДвиженияССубконто.СчетДт) КАК ТиповойДвиженияССубконто
	               |					ПО гсм_ОборотыПоВидамДвиженияОбороты.Регистратор = ТиповойДвиженияССубконто.Регистратор
	               |						И гсм_ОборотыПоВидамДвиженияОбороты.Номенклатура = ТиповойДвиженияССубконто.СубконтоДт1
	               |			ГДЕ
	               |				гсм_ОборотыПоВидамДвиженияОбороты.Регистратор ССЫЛКА Документ.гсм_ПоступлениеДопРасходов) КАК ДопРасходы) КАК ДопРасходы
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		гсм_ВозвратПоставщикуТовары.Ссылка,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.ДоговорКонтрагента,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.Контрагент,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.Организация,
	               |		гсм_ВозвратПоставщикуТовары.Номенклатура,
	               |		гсм_ВозвратПоставщикуТовары.Цена,
	               |		гсм_ВозвратПоставщикуТовары.Количество,
	               |		гсм_ВозвратПоставщикуТовары.СтавкаНДС,
	               |		гсм_ВозвратПоставщикуТовары.СуммаНДС,
	               |		гсм_ВозвратПоставщикуТовары.СчетУчетаБУ,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.Дата,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА гсм_ВозвратПоставщикуТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА гсм_ВозвратПоставщикуТовары.Сумма - гсм_ВозвратПоставщикуТовары.СуммаНДС
	               |			ИНАЧЕ гсм_ВозвратПоставщикуТовары.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		гсм_ВозвратПоставщикуТовары.ПинКод.Код,
	               |		гсм_ВозвратПоставщикуТовары.Номенклатура.БазоваяЕдиницаИзмерения,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.ВалютаДокумента,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.КратностьВзаиморасчетов,
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.КурсВзаиморасчетов,
	               |		NULL
	               |	ИЗ
	               |		Документ.гсм_ВозвратПоставщику.Товары КАК гсм_ВозвратПоставщикуТовары
	               |	ГДЕ
	               |		гсм_ВозвратПоставщикуТовары.Ссылка.Дата >= &НачДата
	               |		И гсм_ВозвратПоставщикуТовары.Ссылка.Дата <= &КонДата
	               |		И гсм_ВозвратПоставщикуТовары.Ссылка.Организация = &Организация
	               |		И гсм_ВозвратПоставщикуТовары.Ссылка.Проведен = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуОС.Ссылка,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.ДоговорКонтрагента,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.Контрагент,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.Организация,
	               |		ВозвратТоваровПоставщикуОС.ОсновноеСредство,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровПоставщикуОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуОС.Сумма - ВозвратТоваровПоставщикуОС.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВозвратТоваровПоставщикуОС.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуОС.СуммаНДС,
	               |		ВозвратТоваровПоставщикуОС.СчетУчетаБУ,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.Дата,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровПоставщикуОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуОС.Сумма - ВозвратТоваровПоставщикуОС.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуОС.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		NULL,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.ВалютаДокумента,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.КратностьВзаиморасчетов,
	               |		ВозвратТоваровПоставщикуОС.Ссылка.КурсВзаиморасчетов,
	               |		NULL
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщику.ОС КАК ВозвратТоваровПоставщикуОС
	               |	ГДЕ
	               |		ВозвратТоваровПоставщикуОС.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровПоставщикуОС.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровПоставщикуОС.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровПоставщикуОС.Ссылка.Проведен = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АвансовыйОтчетТовары.Ссылка,
	               |		АвансовыйОтчетТовары.СчетФактура.ДоговорКонтрагента,
	               |		АвансовыйОтчетТовары.Поставщик,
	               |		АвансовыйОтчетТовары.Ссылка.Организация,
	               |		АвансовыйОтчетТовары.Номенклатура,
	               |		АвансовыйОтчетТовары.Цена,
	               |		АвансовыйОтчетТовары.Количество,
	               |		АвансовыйОтчетТовары.СтавкаНДС,
	               |		АвансовыйОтчетТовары.СуммаНДС,
	               |		АвансовыйОтчетТовары.СчетУчетаБУ,
	               |		АвансовыйОтчетТовары.Ссылка.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА АвансовыйОтчетТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетТовары.Сумма - АвансовыйОтчетТовары.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетТовары.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		АвансовыйОтчетТовары.ЕдиницаИзмерения,
	               |		АвансовыйОтчетТовары.Ссылка.ВалютаДокумента,
	               |		АвансовыйОтчетТовары.Ссылка.КратностьДокумента,
	               |		АвансовыйОтчетТовары.Ссылка.КурсДокумента,
	               |		АвансовыйОтчетТовары.СчетФактура
	               |	ИЗ
	               |		Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
	               |	ГДЕ
	               |		АвансовыйОтчетТовары.Ссылка.Дата >= &НачДата
	               |		И АвансовыйОтчетТовары.Ссылка.Дата <= &КонДата
	               |		И АвансовыйОтчетТовары.Ссылка.Проведен = ИСТИНА
	               |		И АвансовыйОтчетТовары.Ссылка.Организация = &Организация
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.ДоговорКонтрагента,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.Контрагент,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.Организация,
	               |		ВозвратТоваровПоставщикуУслуги.Номенклатура,
	               |		ВозвратТоваровПоставщикуУслуги.Цена,
	               |		ВозвратТоваровПоставщикуУслуги.Количество,
	               |		ВозвратТоваровПоставщикуУслуги.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуУслуги.СуммаНДС,
	               |		ВозвратТоваровПоставщикуУслуги.СчетЗатратБУ,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.Дата,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровПоставщикуУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуУслуги.Сумма - ВозвратТоваровПоставщикуУслуги.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуУслуги.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		NULL,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.ВалютаДокумента,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.КратностьВзаиморасчетов,
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.КурсВзаиморасчетов,
	               |		NULL
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщику.Услуги КАК ВозвратТоваровПоставщикуУслуги
	               |	ГДЕ
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровПоставщикуУслуги.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровПоставщикуУслуги.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровПоставщикуУслуги.Ссылка.Проведен = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АвансовыйОтчетПрочее.Ссылка,
	               |		АвансовыйОтчетПрочее.СчетФактура.ДоговорКонтрагента,
	               |		АвансовыйОтчетПрочее.Поставщик,
	               |		АвансовыйОтчетПрочее.Ссылка.Организация,
	               |		АвансовыйОтчетПрочее.Номенклатура,
	               |		ВЫБОР
	               |			КОГДА АвансовыйОтчетПрочее.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетПрочее.Сумма - АвансовыйОтчетПрочее.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетПрочее.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		АвансовыйОтчетПрочее.СтавкаНДС,
	               |		АвансовыйОтчетПрочее.СуммаНДС,
	               |		АвансовыйОтчетПрочее.СчетЗатратБУ,
	               |		АвансовыйОтчетПрочее.Ссылка.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА АвансовыйОтчетПрочее.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетПрочее.Сумма - АвансовыйОтчетПрочее.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетПрочее.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		NULL,
	               |		АвансовыйОтчетПрочее.Ссылка.ВалютаДокумента,
	               |		АвансовыйОтчетПрочее.Ссылка.КратностьДокумента,
	               |		АвансовыйОтчетПрочее.Ссылка.КурсДокумента,
	               |		АвансовыйОтчетПрочее.СчетФактура
	               |	ИЗ
	               |		Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
	               |	ГДЕ
	               |		АвансовыйОтчетПрочее.Ссылка.Дата >= &НачДата
	               |		И АвансовыйОтчетПрочее.Ссылка.Дата <= &КонДата
	               |		И АвансовыйОтчетПрочее.Ссылка.Организация = &Организация
	               |		И АвансовыйОтчетПрочее.Ссылка.Проведен = ИСТИНА
	               |		И АвансовыйОтчетПрочее.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |		И АвансовыйОтчетПрочее.Номенклатура.Услуга = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеИзПереработкиУслуги.Ссылка,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.ДоговорКонтрагента,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.Контрагент,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.Организация,
	               |		ПоступлениеИзПереработкиУслуги.Номенклатура,
	               |		ПоступлениеИзПереработкиУслуги.Цена,
	               |		ПоступлениеИзПереработкиУслуги.Количество,
	               |		ПоступлениеИзПереработкиУслуги.СтавкаНДС,
	               |		ПоступлениеИзПереработкиУслуги.СуммаНДС,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.СчетЗатратБУ,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеИзПереработкиУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеИзПереработкиУслуги.Сумма - ПоступлениеИзПереработкиУслуги.СуммаНДС
	               |			ИНАЧЕ ПоступлениеИзПереработкиУслуги.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		NULL,
	               |		NULL,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.ВалютаДокумента,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.КратностьВзаиморасчетов,
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.КурсВзаиморасчетов,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПоступлениеИзПереработки.Услуги КАК ПоступлениеИзПереработкиУслуги
	               |	ГДЕ
	               |		ПоступлениеИзПереработкиУслуги.Ссылка.Дата >= &НачДата
	               |		И ПоступлениеИзПереработкиУслуги.Ссылка.Дата <= &КонДата
	               |		И ПоступлениеИзПереработкиУслуги.Ссылка.Организация = &Организация
	               |		И ПоступлениеИзПереработкиУслуги.Ссылка.Проведен = ИСТИНА) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП";				   
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингПокупок.СоздатьНаборЗаписей();	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	ДоступенРеквизитОсновнойСчетФактура = ?(Метаданные.Документы.СчетФактураПолученный.Реквизиты.Найти("ОсновнойСчетФактура") = Неопределено, Ложь, Истина);
	
	ИспользоватьДанныеИзДополнительныхСчетовФактур = моп_Общий.ИспользоватьДанныеИзДополнительныхСчетовФактур(ДанныеДокумента.Дата);
	Если ИспользоватьДанныеИзДополнительныхСчетовФактур = Неопределено Тогда
		ИспользоватьДанныеИзДополнительныхСчетовФактур = Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.СсылкаНаДокумент;
				
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;
		Движение.Счет 				= Выборка.Счет;
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ПинКод     		= Выборка.ПинКод;
		Движение.КодТНВЭД     		= Выборка.КодТНВЭД;
		Движение.Контрагент 		= Выборка.Контрагент;	
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		
		Если ЗначениеЗаполнено(Выборка.СчетФактура) Тогда
			Движение.СчетФактура = Выборка.СчетФактура;
		ИначеЕсли Док.Метаданные().Имя <> "АвансовыйОтчет"  Тогда 
			Движение.СчетФактура 		= ОбщегоНазначения.НайтиПодчиненныйДокумент(Док, "СчетФактураПолученный");		
		КонецЕсли;
		
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Если ЗначениеЗаполнено(Движение.СчетФактура) Тогда				
			Движение.СчетФактураЯвляетсяДополнительным = Движение.СчетФактура.Дополнительная;	
			Если ДоступенРеквизитОсновнойСчетФактура Тогда				
				Движение.СчетФактураКорректируемый = Движение.СчетФактура.ОсновнойСчетФактура;				
			КонецЕсли;						
		КонецЕсли;			
		
		ДанныеКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Выборка.Дата);		
		
		Если ИспользоватьДанныеИзДополнительныхСчетовФактур и ЗначениеЗаполнено(Движение.СчетФактура) и Движение.СчетФактураЯвляетсяДополнительным Тогда
			ЗаполнитьДанныеИзДополнительногоСчетаФактуры(Движение.СчетФактура, Движение, Выборка, ДанныеКурсаВалюты, ВалютаРегламентированногоУчета);
		Иначе
		
		Движение.Количество 		= Выборка.Количество;
		
		Движение.СуммаБезНалогов 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
		
		Движение.Акциз 				= 0;
		
		Движение.СуммаНДС 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
		
	КонецЕсли;
	
		Движение.СтавкаНДС 			= Выборка.СтавкаНДС;
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);
		
		Если Не ЗначениеЗаполнено(Движение.СчетФактураКорректируемый) Тогда
			Если ЗначениеЗаполнено(Выборка.ОснованиеВозврата) Тогда
				Движение.СчетФактураКорректируемый = ОбщегоНазначения.НайтиПодчиненныйДокумент(Выборка.ОснованиеВозврата, "СчетФактураПолученный");
			КонецЕсли;			
		КонецЕсли; 
		
		Движение.СсылкаНаДокумент 	= Док;
		Движение.Организация 		= Выборка.Организация;
		
		Движение.СуммаИПН 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(?(Выборка.СуммаИПН=NULL,0,Выборка.СуммаИПН), 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
		
		Движение.КонтрагентЯвляетсяЧастнымЛицом = Выборка.КонтрагентЯвляетсяЧастнымЛицом;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу импорта
// если дополнение встроено в конфигурацию "1С-Рейтинг: Нефтебаза"
//
Процедура ВыполнитьДвиженияПоМониторингуИмпортаГСМ(ДанныеДокумента,НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("Импорт", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);	
	Запрос.УстановитьПараметр("ИмпортГСМ", Перечисления.гсм_ВидыОперацийПоступление.Импорт);	
				
		Запрос.Текст="ВЫБРАТЬ
		             |	гсм_Поступление.Ссылка КАК Ссылка,
		             |	гсм_Поступление.Дата КАК Дата,
		             |	гсм_Поступление.Контрагент КАК Контрагент,
		             |	гсм_Поступление.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
		             |	гсм_Поступление.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
		             |	гсм_Поступление.ВалютаДокумента КАК ВалютаДокумента,
		             |	гсм_Поступление.СуммаВключаетНДС КАК СуммаВключаетНДС,
		             |	гсм_Поступление.Организация КАК Организация,
		             |	гсм_Поступление.ДоговорКонтрагента КАК ДоговорКонтрагента
		             |ПОМЕСТИТЬ ВТ_ГСМ_Поступление
		             |ИЗ
		             |	Документ.гсм_Поступление КАК гсм_Поступление
		             |ГДЕ
		             |	гсм_Поступление.ВидОперации = &ИмпортГСМ
		             |	И гсм_Поступление.Проведен = ИСТИНА
		             |	И гсм_Поступление.Дата >= &НачДата
		             |	И гсм_Поступление.Дата <= &КонДата
		             |	И гсм_Поступление.Организация = &Организация
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	Ссылка
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
		             |	ПоступлениеТоваровУслуг.Дата КАК Дата,
		             |	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
		             |	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
		             |	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
		             |	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
		             |	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
		             |	ПоступлениеТоваровУслуг.Организация КАК Организация,
		             |	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
		             |	ПоступлениеТоваровУслуг.ВидОперации
		             |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслуг
		             |ИЗ
		             |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		             |ГДЕ
		             |	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
		             |	И ПоступлениеТоваровУслуг.Дата >= &НачДата
		             |	И ПоступлениеТоваровУслуг.Дата <= &КонДата
		             |	И ПоступлениеТоваровУслуг.Организация = &Организация
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	Ссылка
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ПоступлениеНМА.Ссылка КАК Ссылка,
		             |	ПоступлениеНМА.Дата КАК Дата,
		             |	ПоступлениеНМА.Контрагент КАК Контрагент,
		             |	ПоступлениеНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
		             |	ПоступлениеНМА.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
		             |	ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
		             |	ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
		             |	ПоступлениеНМА.Организация КАК Организация,
		             |	ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента
		             |ПОМЕСТИТЬ ВТ_ПоступлениеНМА
		             |ИЗ
		             |	Документ.ПоступлениеНМА КАК ПоступлениеНМА
		             |ГДЕ
		             |	ПоступлениеНМА.Проведен = ИСТИНА
		             |	И ПоступлениеНМА.Дата >= &НачДата
		             |	И ПоступлениеНМА.Дата <= &КонДата
		             |	И ПоступлениеНМА.Организация = &Организация
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	Ссылка
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	НДСЗаНерезидентаОбороты.ДокументПоступления КАК ДокументПоступления,
		             |	НДСЗаНерезидентаОбороты.Номенклатура КАК Номенклатура,
		             |	НДСЗаНерезидентаОбороты.СуммаНДСПриход
		             |ПОМЕСТИТЬ ВТ_НДСЗаНерезидента
		             |ИЗ
		             |	РегистрНакопления.НДСЗаНерезидента.Обороты(
		             |			,
		             |			,
		             |			,
		             |			Налогоплательщик = &Организация
		             |				И ДокументПоступления В
		             |					(ВЫБРАТЬ
		             |						ВТ_ПоступлениеТоваровУслуг.Ссылка
		             |					ИЗ
		             |						ВТ_ПоступлениеТоваровУслуг
		             |			
		             |					ОБЪЕДИНИТЬ ВСЕ
		             |			
		             |					ВЫБРАТЬ
		             |						ВТ_ПоступлениеНМА.Ссылка
		             |					ИЗ
		             |						ВТ_ПоступлениеНМА)) КАК НДСЗаНерезидентаОбороты
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	ДокументПоступления,
		             |	Номенклатура
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ГТДОбщий.СуммаПошлиныРегл КАК СуммаПошлиныРегл,
		             |	ГТДОбщий.СуммаСбора КАК СуммаСбора,
		             |	ГТДОбщий.СуммаВалютногоСбораРегл КАК СуммаВалютногоСбораРегл,
		             |	ГТДОбщий.СуммаНДСРегл КАК СуммаНДСРегл,
		             |	ГТДОбщий.Номенклатура КАК Номенклатура,
		             |	ГТДОбщий.НомерСтроки КАК НомерСтроки,
		             |	ГТДОбщий.НомерРаздела КАК НомерРаздела,
		             |	ГТДОбщий.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
		             |	ГТДОбщий.СуммаПошлиныВВалюте КАК СуммаПошлиныВВалюте,
		             |	ГТДОбщий.СуммаСбораВВалюте КАК СуммаСбораВВалюте,
		             |	ГТДОбщий.ВалютаСбора КАК ВалютаСбора,
		             |	ГТДОбщий.Количество КАК Количество,
		             |	ГТДОбщий.ВалютаДокументаПоступления КАК ВалютаДокументаПоступления,
		             |	ГТДОбщий.СтавкаПошлины КАК СтавкаПошлины,
		             |	ГТДОбщий.ВалютаПошлины КАК ВалютаПошлины,
		             |	ГТДОбщий.СуммаНДСВВалюте КАК СуммаНДСВВалюте,
		             |	ГТДОбщий.ВалютаНДС КАК ВалютаНДС,
		             |	ГТДОбщий.СуммаПоступленияРегл КАК СуммаПоступленияРегл,
		             |	ГТДОбщий.СуммаПоступленияРегл + ГТДОбщий.СуммаПошлиныРегл + ГТДОбщий.СуммаВалютногоСбораРегл + ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаНДСВСтоимостиРегл КАК ОбщаяСуммаРегл,
		             |	ВЫБОР
		             |		КОГДА ГТДОбщий.Количество = 0
		             |			ТОГДА 0
		             |		ИНАЧЕ (ГТДОбщий.СуммаПоступленияРегл + ГТДОбщий.СуммаПошлиныРегл + ГТДОбщий.СуммаВалютногоСбораРегл + ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаНДСВСтоимостиРегл) / ГТДОбщий.Количество
		             |	КОНЕЦ КАК ОбщаяЦенаРегл,
		             |	ГТДОбщий.ЦенаРегл КАК ЦенаРегл,
		             |	ГТДОбщий.ЦенаВал КАК ЦенаВал,
		             |	ГТДОбщий.ВалютаДокумента КАК ВалютаДокумента,
		             |	ГТДОбщий.КодНоменклатуры КАК КодНоменклатуры,
		             |	ГТДОбщий.ДокументПартии КАК ДокументПартии,
		             |	ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаВалютногоСбораРегл КАК СуммаВсехСборов,
		             |	ГТДОбщий.ДатаГТД КАК ДатаГТД,
		             |	ГТДОбщий.НомерГТД КАК НомерГТД,
		             |	ГТДОбщий.ПинКод КАК ПинКод,
		             |	ГТДОбщий.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		             |	ГТДОбщий.СуммаАкциза КАК СуммаАкциза
		             |ПОМЕСТИТЬ ВТ_ГТД
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
		             |		ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
		             |		ГТДИмпортТовары.Номенклатура КАК Номенклатура,
		             |		ГТДИмпортТовары.ФактурнаяСтоимость КАК ТаможеннаяСтоимость,
		             |		ВЫБОР
		             |			КОГДА (НЕ ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента)
		             |				ТОГДА ГТДИмпортТовары.СуммаПошлины
		             |			ИНАЧЕ 0
		             |		КОНЕЦ КАК СуммаПошлиныВВалюте,
		             |		ГТДИмпортТовары.СуммаСбора КАК СуммаСбора,
		             |		ГТДИмпортТовары.СуммаСбораВал КАК СуммаСбораВВалюте,
		             |		ГТДИмпортРазделы.ДоговорВзаиморасчетовСбор.ВалютаВзаиморасчетов КАК ВалютаСбора,
		             |		ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) КАК Количество,
		             |		ПоступлениеТМЗ.ВалютаДокумента КАК ВалютаДокументаПоступления,
		             |		ГТДИмпортРазделы.СтавкаПошлины КАК СтавкаПошлины,
		             |		ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов КАК ВалютаПошлины,
		             |		ВЫБОР
		             |			КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |				ТОГДА 0
		             |			ИНАЧЕ ГТДИмпортТовары.СуммаНДС
		             |		КОНЕЦ КАК СуммаНДСВВалюте,
		             |		ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов КАК ВалютаНДС,
		             |		ВЫБОР
		             |			КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |				ТОГДА ГТДИмпортТовары.СуммаПошлины
		             |			КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |				ТОГДА 0
		             |			ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаПошлины * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |		КОНЕЦ КАК СуммаПошлиныРегл,
		             |		ВЫБОР
		             |			КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |				ТОГДА 0
		             |			ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаСбораВал * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |		КОНЕЦ КАК СуммаВалютногоСбораРегл,
		             |		ВЫБОР
		             |			КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |				ТОГДА ГТДИмпортТовары.СуммаНДС
		             |			КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |				ТОГДА 0
		             |			ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаНДС * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |		КОНЕЦ КАК СуммаНДСРегл,
		             |		ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0) КАК СуммаПоступленияРегл,
		             |		ВЫБОР
		             |			КОГДА ГТДИмпортРазделы.Ссылка.НДСВключенВСтоимость
		             |				ТОГДА ВЫБОР
		             |						КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |							ТОГДА ГТДИмпортТовары.СуммаНДС
		             |						КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |							ТОГДА 0
		             |						ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаНДС * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |					КОНЕЦ
		             |			ИНАЧЕ 0
		             |		КОНЕЦ КАК СуммаНДСВСтоимостиРегл,
		             |		ВЫРАЗИТЬ(ВЫБОР
		             |				КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
		             |					ТОГДА 0
		             |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияВал, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
		             |			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаВал,
		             |		ВЫРАЗИТЬ(ВЫБОР
		             |				КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
		             |					ТОГДА 0
		             |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
		             |			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаРегл,
		             |		ГТДИмпортРазделы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
		             |		ГТДИмпортТовары.Номенклатура.Код КАК КодНоменклатуры,
		             |		ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
		             |		ГТДИмпортТовары.Ссылка.Дата КАК ДатаГТД,
		             |		ГТДИмпортТовары.Ссылка.НомерГТД КАК НомерГТД,
		             |		NULL КАК ПинКод,
		             |		ПоступлениеТМЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		             |		0 КАК СуммаАкциза,
		             |		ГТДИмпортТовары.Ссылка КАК ГТДСсылка
		             |	ИЗ
		             |		(ВЫБРАТЬ
		             |			ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
		             |			ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
		             |			ГТДИмпортТовары.Номенклатура КАК Номенклатура,
		             |			ГТДИмпортТовары.Количество КАК Количество,
		             |			ГТДИмпортТовары.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
		             |			ГТДИмпортТовары.СуммаПошлины КАК СуммаПошлины,
		             |			ГТДИмпортТовары.СуммаСбора КАК СуммаСбора,
		             |			ГТДИмпортТовары.СуммаСбораВал КАК СуммаСбораВал,
		             |			ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
		             |			ГТДИмпортТовары.Ссылка КАК Ссылка,
		             |			ГТДИмпортТовары.СуммаНДС КАК СуммаНДС
		             |		ИЗ
		             |			Документ.ГТДИмпорт.Товары КАК ГТДИмпортТовары
		             |		ГДЕ
		             |			ГТДИмпортТовары.ДокументПартии В
		             |					(ВЫБРАТЬ
		             |						ВТ_ПоступлениеТоваровУслуг.Ссылка
		             |					ИЗ
		             |						ВТ_ПоступлениеТоваровУслуг)
		             |			И ГТДИмпортТовары.Ссылка.Проведен
		             |		
		             |		ОБЪЕДИНИТЬ ВСЕ
		             |		
		             |		ВЫБРАТЬ
		             |			ГТДИмпортОС.НомерСтроки,
		             |			ГТДИмпортОС.НомерРаздела,
		             |			ГТДИмпортОС.ОсновноеСредство,
		             |			1,
		             |			ГТДИмпортОС.ФактурнаяСтоимость,
		             |			ГТДИмпортОС.СуммаПошлины,
		             |			ГТДИмпортОС.СуммаСбора,
		             |			ГТДИмпортОС.СуммаСбораВал,
		             |			ГТДИмпортОС.ДокументПартии,
		             |			ГТДИмпортОС.Ссылка,
		             |			ГТДИмпортОС.СуммаНДС
		             |		ИЗ
		             |			Документ.ГТДИмпорт.ОС КАК ГТДИмпортОС
		             |		ГДЕ
		             |			ГТДИмпортОС.ДокументПартии В
		             |					(ВЫБРАТЬ
		             |						ВТ_ПоступлениеТоваровУслуг.Ссылка
		             |					ИЗ
		             |						ВТ_ПоступлениеТоваровУслуг)
		             |			И ГТДИмпортОС.Ссылка.Проведен) КАК ГТДИмпортТовары
		             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГТДИмпорт.Разделы КАК ГТДИмпортРазделы
		             |			ПО ГТДИмпортТовары.Ссылка = ГТДИмпортРазделы.Ссылка
		             |				И ГТДИмпортТовары.НомерРаздела = ГТДИмпортРазделы.НомерСтроки
		             |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		             |				ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
		             |				ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		             |				ПоступлениеТоваровУслугТовары.Количество КАК Количество,
		             |				ВЫБОР
		             |					КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		             |							И (НЕ ПоступлениеТоваровУслугТовары.Ссылка.НДСВключенВСтоимость)
		             |						ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
		             |					ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
		             |				КОНЕЦ КАК СуммаПоступленияВал,
		             |				ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
		             |				ВЫБОР
		             |					КОГДА ПоступлениеТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов = 0
		             |						ТОГДА 0
		             |					ИНАЧЕ ПоступлениеТоваровУслугТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов * ВЫБОР
		             |							КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
		             |									И (НЕ ПоступлениеТоваровУслугТовары.Ссылка.НДСВключенВСтоимость)
		             |								ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
		             |							ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
		             |						КОНЕЦ
		             |				КОНЕЦ КАК СуммаПоступленияРегл,
		             |				ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		             |			ИЗ
		             |				Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары) КАК ПоступлениеТМЗ
		             |			ПО ГТДИмпортТовары.ДокументПартии = ПоступлениеТМЗ.Ссылка
		             |				И ГТДИмпортТовары.Номенклатура = ПоступлениеТМЗ.Номенклатура
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		гсм_ГТДИмпортТовары.НомерСтроки,
		             |		гсм_ГТДИмпортТовары.НомерРаздела,
		             |		гсм_ГТДИмпортТовары.Номенклатура,
		             |		гсм_ГТДИмпортТовары.ФактурнаяСтоимость,
		             |		ВЫБОР
		             |			КОГДА (НЕ гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = гсм_ГТДИмпортРазделы.Ссылка.ВалютаДокумента)
		             |				ТОГДА гсм_ГТДИмпортТовары.СуммаПошлины
		             |			ИНАЧЕ 0
		             |		КОНЕЦ,
		             |		гсм_ГТДИмпортТовары.СуммаСбора,
		             |		гсм_ГТДИмпортТовары.СуммаСбораВал,
		             |		гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовСбор.ВалютаВзаиморасчетов,
		             |		ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0),
		             |		ПоступлениеТМЗ.ВалютаДокумента,
		             |		гсм_ГТДИмпортРазделы.СтавкаПошлины,
		             |		гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов,
		             |		ВЫБОР
		             |			КОГДА гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = гсм_ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |				ТОГДА 0
		             |			ИНАЧЕ гсм_ГТДИмпортТовары.СуммаНДС
		             |		КОНЕЦ,
		             |		гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов,
		             |		ВЫБОР
		             |			КОГДА гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = гсм_ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |				ТОГДА гсм_ГТДИмпортТовары.СуммаПошлины
		             |			КОГДА гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |				ТОГДА 0
		             |			ИНАЧЕ ВЫРАЗИТЬ(гсм_ГТДИмпортТовары.СуммаПошлины * гсм_ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |		КОНЕЦ,
		             |		ВЫБОР
		             |			КОГДА гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |				ТОГДА 0
		             |			ИНАЧЕ ВЫРАЗИТЬ(гсм_ГТДИмпортТовары.СуммаСбораВал * гсм_ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |		КОНЕЦ,
		             |		ВЫБОР
		             |			КОГДА гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = гсм_ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |				ТОГДА гсм_ГТДИмпортТовары.СуммаНДС
		             |			КОГДА гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |				ТОГДА 0
		             |			ИНАЧЕ ВЫРАЗИТЬ(гсм_ГТДИмпортТовары.СуммаНДС * гсм_ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |		КОНЕЦ,
		             |		ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0),
		             |		ВЫБОР
		             |			КОГДА гсм_ГТДИмпортРазделы.Ссылка.НДСВключенВСтоимость
		             |				ТОГДА ВЫБОР
		             |						КОГДА гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = гсм_ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |							ТОГДА гсм_ГТДИмпортТовары.СуммаНДС
		             |						КОГДА гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |							ТОГДА 0
		             |						ИНАЧЕ ВЫРАЗИТЬ(гсм_ГТДИмпортТовары.СуммаНДС * гсм_ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |					КОНЕЦ
		             |			ИНАЧЕ 0
		             |		КОНЕЦ,
		             |		ВЫРАЗИТЬ(ВЫБОР
		             |				КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
		             |					ТОГДА 0
		             |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияВал, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
		             |			КОНЕЦ КАК ЧИСЛО(15, 2)),
		             |		ВЫРАЗИТЬ(ВЫБОР
		             |				КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
		             |					ТОГДА 0
		             |				ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
		             |			КОНЕЦ КАК ЧИСЛО(15, 2)),
		             |		гсм_ГТДИмпортРазделы.Ссылка.ВалютаДокумента,
		             |		гсм_ГТДИмпортТовары.Номенклатура.Код,
		             |		гсм_ГТДИмпортТовары.ДокументПартии,
		             |		гсм_ГТДИмпортТовары.Ссылка.Дата,
		             |		гсм_ГТДИмпортТовары.Ссылка.НомерГТД,
		             |		гсм_ГТДИмпортТовары.ПинКод.Код,
		             |		ПоступлениеТМЗ.ЕдиницаИзмерения,
		             |		ВЫБОР
		             |			КОГДА гсм_ГТДИмпортРазделы.ДоговорВзаиморасчетовАкциз.ВалютаВзаиморасчетов = гсм_ГТДИмпортРазделы.Ссылка.ВалютаДокумента
		             |				ТОГДА гсм_ГТДИмпортТовары.СуммаАкциза
		             |			КОГДА гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
		             |				ТОГДА 0
		             |			ИНАЧЕ ВЫРАЗИТЬ(гсм_ГТДИмпортТовары.СуммаАкциза * гсм_ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / гсм_ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
		             |		КОНЕЦ,
		             |		гсм_ГТДИмпортТовары.Ссылка
		             |	ИЗ
		             |		(ВЫБРАТЬ
		             |			гсм_ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
		             |			гсм_ГТДИмпортТовары.Ссылка КАК Ссылка,
		             |			гсм_ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
		             |			гсм_ГТДИмпортТовары.Номенклатура КАК Номенклатура,
		             |			гсм_ГТДИмпортТовары.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
		             |			гсм_ГТДИмпортТовары.СуммаСбора КАК СуммаСбора,
		             |			гсм_ГТДИмпортТовары.СуммаСбораВал КАК СуммаСбораВал,
		             |			гсм_ГТДИмпортТовары.СуммаПошлины КАК СуммаПошлины,
		             |			гсм_ГТДИмпортТовары.СуммаНДС КАК СуммаНДС,
		             |			гсм_ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
		             |			гсм_ГТДИмпортТовары.ПинКод КАК ПинКод,
		             |			гсм_ГТДИмпортТовары.СуммаАкциза КАК СуммаАкциза
		             |		ИЗ
		             |			Документ.гсм_ГТДИмпорт.Товары КАК гсм_ГТДИмпортТовары
		             |		ГДЕ
		             |			гсм_ГТДИмпортТовары.ДокументПартии В
		             |					(ВЫБРАТЬ
		             |						гсм_Поступление.Ссылка
		             |					ИЗ
		             |						ВТ_ГСМ_Поступление КАК гсм_Поступление)
		             |			И гсм_ГТДИмпортТовары.Ссылка.Проведен) КАК гсм_ГТДИмпортТовары
		             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гсм_ГТДИмпорт.Разделы КАК гсм_ГТДИмпортРазделы
		             |			ПО гсм_ГТДИмпортТовары.Ссылка = гсм_ГТДИмпортРазделы.Ссылка
		             |				И гсм_ГТДИмпортТовары.НомерРаздела = гсм_ГТДИмпортРазделы.НомерСтроки
		             |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		             |				гсм_ПоступлениеТовары.Ссылка КАК Ссылка,
		             |				гсм_ПоступлениеТовары.Номенклатура КАК Номенклатура,
		             |				СУММА(гсм_ПоступлениеТовары.Количество) КАК Количество,
		             |				СУММА(ВЫБОР
		             |						КОГДА гсм_ПоступлениеТовары.Ссылка.СуммаВключаетНДС
		             |								И (НЕ гсм_ПоступлениеТовары.Ссылка.НДСВключенВСтоимость)
		             |							ТОГДА гсм_ПоступлениеТовары.Сумма - гсм_ПоступлениеТовары.СуммаНДС
		             |						ИНАЧЕ гсм_ПоступлениеТовары.Сумма
		             |					КОНЕЦ) КАК СуммаПоступленияВал,
		             |				гсм_ПоступлениеТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
		             |				СУММА(ВЫБОР
		             |						КОГДА гсм_ПоступлениеТовары.Ссылка.КратностьВзаиморасчетов = 0
		             |							ТОГДА 0
		             |						ИНАЧЕ гсм_ПоступлениеТовары.Ссылка.КурсВзаиморасчетов / гсм_ПоступлениеТовары.Ссылка.КратностьВзаиморасчетов * ВЫБОР
		             |								КОГДА гсм_ПоступлениеТовары.Ссылка.СуммаВключаетНДС
		             |										И (НЕ гсм_ПоступлениеТовары.Ссылка.НДСВключенВСтоимость)
		             |									ТОГДА гсм_ПоступлениеТовары.Сумма - гсм_ПоступлениеТовары.СуммаНДС
		             |								ИНАЧЕ гсм_ПоступлениеТовары.Сумма
		             |							КОНЕЦ
		             |					КОНЕЦ) КАК СуммаПоступленияРегл,
		             |				гсм_ПоступлениеТовары.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
		             |			ИЗ
		             |				Документ.гсм_Поступление.Товары КАК гсм_ПоступлениеТовары
		             |			ГДЕ
		             |				гсм_ПоступлениеТовары.Ссылка В
		             |						(ВЫБРАТЬ
		             |							ВТ_ГСМ_Поступление.Ссылка
		             |						ИЗ
		             |							ВТ_ГСМ_Поступление)
		             |			
		             |			СГРУППИРОВАТЬ ПО
		             |				гсм_ПоступлениеТовары.Ссылка,
		             |				гсм_ПоступлениеТовары.Номенклатура,
		             |				гсм_ПоступлениеТовары.Ссылка.ВалютаДокумента,
		             |				гсм_ПоступлениеТовары.Номенклатура.БазоваяЕдиницаИзмерения) КАК ПоступлениеТМЗ
		             |			ПО гсм_ГТДИмпортТовары.Номенклатура = ПоступлениеТМЗ.Номенклатура
		             |				И гсм_ГТДИмпортТовары.ДокументПартии = ПоступлениеТМЗ.Ссылка) КАК ГТДОбщий
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	Поступления.Номенклатура,
		             |	Поступления.Сумма,
		             |	Поступления.СуммаНДС,
		             |	Поступления.СуммаСборов,
		             |	Поступления.ДатаГТД,
		             |	Поступления.НомерГТД,
		             |	Поступления.Ссылка,
		             |	Поступления.ДоговорКонтрагента,
		             |	Поступления.Контрагент,
		             |	Поступления.Организация,
		             |	Поступления.Дата,
		             |	Поступления.Цена,
		             |	Поступления.Количество,
		             |	Поступления.ВалютаДокумента,
		             |	Поступления.Курс,
		             |	Поступления.СуммаПошлины,
		             |	Поступления.ПинКод,
		             |	Поступления.ЕдиницаИзмерения,
		             |	Поступления.Счет
		             |ПОМЕСТИТЬ ВТ_ПоступленияИЗТС
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		             |		ВЫБОР
		             |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
		             |				ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
		             |			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
		             |		КОНЕЦ КАК Сумма,
		             |		0 КАК СуммаНДС,
		             |		0 КАК СуммаСборов,
		             |		0 КАК ДатаГТД,
		             |		0 КАК НомерГТД,
		             |		ВТ_ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
		             |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
		             |		ВТ_ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
		             |		ВТ_ПоступлениеТоваровУслуг.Организация КАК Организация,
		             |		ВТ_ПоступлениеТоваровУслуг.Дата КАК Дата,
		             |		ПоступлениеТоваровУслугТовары.Цена КАК Цена,
		             |		ПоступлениеТоваровУслугТовары.Количество КАК Количество,
		             |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
		             |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1) КАК Курс,
		             |		0 КАК СуммаПошлины,
		             |		NULL КАК ПинКод,
		             |		ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		             |		ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК Счет
		             |	ИЗ
		             |		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
		             |			ПО ПоступлениеТоваровУслугТовары.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
		             |				И (ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт)
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		ПоступлениеТоваровУслугУслуги.Номенклатура,
		             |		ВЫБОР
		             |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
		             |				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
		             |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
		             |		КОНЕЦ,
		             |		0,
		             |		0,
		             |		0,
		             |		0,
		             |		ПоступлениеТоваровУслугУслуги.Ссылка,
		             |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
		             |		ВТ_ПоступлениеТоваровУслуг.Контрагент,
		             |		ВТ_ПоступлениеТоваровУслуг.Организация,
		             |		ВТ_ПоступлениеТоваровУслуг.Дата,
		             |		ПоступлениеТоваровУслугУслуги.Цена,
		             |		ПоступлениеТоваровУслугУслуги.Количество,
		             |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
		             |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1),
		             |		0,
		             |		NULL,
		             |		NULL,
		             |		ПоступлениеТоваровУслугУслуги.СчетЗатратБУ
		             |	ИЗ
		             |		Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
		             |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
		             |	ГДЕ
		             |		(ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт
		             |				ИЛИ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
		             |					(ВЫБРАТЬ
		             |						ВТ_НДСЗаНерезидента.ДокументПоступления,
		             |						ВТ_НДСЗаНерезидента.Номенклатура
		             |					ИЗ
		             |						ВТ_НДСЗаНерезидента))
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		ПоступлениеТоваровУслугОС.ОсновноеСредство,
		             |		ВЫБОР
		             |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
		             |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
		             |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
		             |		КОНЕЦ,
		             |		0,
		             |		0,
		             |		0,
		             |		0,
		             |		ПоступлениеТоваровУслугОС.Ссылка,
		             |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
		             |		ВТ_ПоступлениеТоваровУслуг.Контрагент,
		             |		ВТ_ПоступлениеТоваровУслуг.Организация,
		             |		ВТ_ПоступлениеТоваровУслуг.Дата,
		             |		ВЫБОР
		             |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
		             |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
		             |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
		             |		КОНЕЦ,
		             |		1,
		             |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
		             |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1),
		             |		0,
		             |		NULL,
		             |		NULL,
		             |		ПоступлениеТоваровУслугОС.СчетУчетаБУ
		             |	ИЗ
		             |		Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
		             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
		             |			ПО ПоступлениеТоваровУслугОС.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
		             |				И (ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт)
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		гсм_ПоступлениеТовары.Номенклатура,
		             |		ВЫБОР
		             |			КОГДА ВТ_ГСМ_Поступление.СуммаВключаетНДС
		             |				ТОГДА гсм_ПоступлениеТовары.Сумма - гсм_ПоступлениеТовары.СуммаНДС
		             |			ИНАЧЕ гсм_ПоступлениеТовары.Сумма
		             |		КОНЕЦ,
		             |		0,
		             |		0,
		             |		0,
		             |		0,
		             |		гсм_ПоступлениеТовары.Ссылка,
		             |		ВТ_ГСМ_Поступление.ДоговорКонтрагента,
		             |		ВТ_ГСМ_Поступление.Контрагент,
		             |		ВТ_ГСМ_Поступление.Организация,
		             |		ВТ_ГСМ_Поступление.Дата,
		             |		гсм_ПоступлениеТовары.Цена,
		             |		гсм_ПоступлениеТовары.Количество,
		             |		ВТ_ГСМ_Поступление.ВалютаДокумента,
		             |		ВТ_ГСМ_Поступление.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ГСМ_Поступление.КратностьВзаиморасчетов, 1),
		             |		0,
		             |		гсм_ПоступлениеТовары.ПинКод.Код,
		             |		гсм_ПоступлениеТовары.Номенклатура.БазоваяЕдиницаИзмерения,
		             |		гсм_ПоступлениеТовары.СчетУчетаБУ
		             |	ИЗ
		             |		Документ.гсм_Поступление.Товары КАК гсм_ПоступлениеТовары
		             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГСМ_Поступление КАК ВТ_ГСМ_Поступление
		             |			ПО гсм_ПоступлениеТовары.Ссылка = ВТ_ГСМ_Поступление.Ссылка
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		ПоступлениеНМАНМА.НематериальныйАктив,
		             |		ВЫБОР
		             |			КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
		             |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
		             |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
		             |		КОНЕЦ,
		             |		0,
		             |		0,
		             |		0,
		             |		0,
		             |		ВТ_ПоступлениеНМА.Ссылка,
		             |		ВТ_ПоступлениеНМА.ДоговорКонтрагента,
		             |		ВТ_ПоступлениеНМА.Контрагент,
		             |		ВТ_ПоступлениеНМА.Организация,
		             |		ВТ_ПоступлениеНМА.Дата,
		             |		ВЫБОР
		             |			КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
		             |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
		             |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
		             |		КОНЕЦ,
		             |		1,
		             |		ВТ_ПоступлениеНМА.ВалютаДокумента,
		             |		ВТ_ПоступлениеНМА.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеНМА.КратностьВзаиморасчетов, 1),
		             |		0,
		             |		NULL,
		             |		NULL,
		             |		ПоступлениеНМАНМА.СчетУчетаБУ
		             |	ИЗ
		             |		Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
		             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеНМА КАК ВТ_ПоступлениеНМА
		             |			ПО (ВТ_ПоступлениеНМА.Ссылка = ПоступлениеНМАНМА.Ссылка)
		             |	ГДЕ
		             |		(ПоступлениеНМАНМА.Ссылка, ПоступлениеНМАНМА.НематериальныйАктив) В
		             |				(ВЫБРАТЬ
		             |					ВТ_НДСЗаНерезидента.ДокументПоступления,
		             |					ВТ_НДСЗаНерезидента.Номенклатура
		             |				ИЗ
		             |					ВТ_НДСЗаНерезидента)) КАК Поступления
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Ссылка КАК Ссылка
		             |ПОМЕСТИТЬ ВТ_ЗаявлениеОВвозеТоваров
		             |ИЗ
		             |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов
		             |ГДЕ
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ДокументОснование В
		             |			(ВЫБРАТЬ
		             |				ПоступлениеТоваровУслуг.Ссылка
		             |			ИЗ
		             |				ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		             |		
		             |			ОБЪЕДИНИТЬ ВСЕ
		             |		
		             |			ВЫБРАТЬ
		             |				ВТ_ГСМ_Поступление.Ссылка
		             |			ИЗ
		             |				ВТ_ГСМ_Поступление КАК ВТ_ГСМ_Поступление)
		             |	И ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Проведен
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.ДокументОснование КАК ДокументОснование,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Номенклатура,
		             |	СУММА(ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.СуммаНДС) КАК СуммаНДС,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Номер,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Дата,
		             |	NULL КАК ЕдиницаИзмерения
		             |ПОМЕСТИТЬ НДСКУплате
		             |ИЗ
		             |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Товары КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары
		             |ГДЕ
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка В
		             |			(ВЫБРАТЬ
		             |				ВТ_ЗаявлениеОВвозеТоваров.Ссылка
		             |			ИЗ
		             |				ВТ_ЗаявлениеОВвозеТоваров)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.ДокументОснование,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Номенклатура,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Номер,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Дата
		             |
		             |ОБЪЕДИНИТЬ ВСЕ
		             |
		             |ВЫБРАТЬ
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ДокументОснование,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ОсновноеСредство,
		             |	СУММА(ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.СуммаНДС),
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Номер,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Дата,
		             |	МАКСИМУМ(ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ЕдиницаИзмерения)
		             |ИЗ
		             |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ОС КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС
		             |ГДЕ
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка В
		             |			(ВЫБРАТЬ
		             |				ВТ_ЗаявлениеОВвозеТоваров.Ссылка
		             |			ИЗ
		             |				ВТ_ЗаявлениеОВвозеТоваров)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ДокументОснование,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ОсновноеСредство,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Номер,
		             |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Дата
		             |
		             |ОБЪЕДИНИТЬ ВСЕ
		             |
		             |ВЫБРАТЬ
		             |	ВТ_НДСЗаНерезидента.ДокументПоступления,
		             |	ВТ_НДСЗаНерезидента.Номенклатура,
		             |	СУММА(ВТ_НДСЗаНерезидента.СуммаНДСПриход),
		             |	NULL,
		             |	NULL,
		             |	NULL
		             |ИЗ
		             |	ВТ_НДСЗаНерезидента КАК ВТ_НДСЗаНерезидента
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ВТ_НДСЗаНерезидента.ДокументПоступления,
		             |	ВТ_НДСЗаНерезидента.Номенклатура
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		             |	ВложенныйЗапрос.Сумма,
		             |	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
		             |	ВложенныйЗапрос.СуммаПошлины,
		             |	ВложенныйЗапрос.СуммаСбора,
		             |	ВложенныйЗапрос.Ссылка КАК Ссылка,
		             |	ВложенныйЗапрос.ДоговорКонтрагента,
		             |	ВложенныйЗапрос.Контрагент,
		             |	ВложенныйЗапрос.Организация,
		             |	ВложенныйЗапрос.Цена,
		             |	ВложенныйЗапрос.Количество,
		             |	ВложенныйЗапрос.НомерГТД,
		             |	ВложенныйЗапрос.ДатаГТД,
		             |	ВложенныйЗапрос.Валюта,
		             |	ВложенныйЗапрос.КурсВалюты,
		             |	моп_ОбъектыМониторинга.КодТНВЭД,
		             |	ВложенныйЗапрос.ЕдиницаИзмерения,
		             |	ВложенныйЗапрос.Счет,
		             |	ВложенныйЗапрос.СуммаАкциза,
		             |	ВложенныйЗапрос.СуммаНДСПоПрочимОперациям КАК СуммаНДСПоПрочимОперациям,
		             |	ЕСТЬNULL(ВложенныйЗапрос.ПинКод, моп_ОбъектыМониторинга.ПинКод) КАК ПинКод,
		             |	ВложенныйЗапрос.Дата
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ЗапросОбъединенный.Номенклатура КАК Номенклатура,
		             |		СУММА(ЗапросОбъединенный.Сумма) КАК Сумма,
		             |		СУММА(ЗапросОбъединенный.СуммаНДС) КАК СуммаНДС,
		             |		СУММА(ЗапросОбъединенный.СуммаПошлины) КАК СуммаПошлины,
		             |		СУММА(ЗапросОбъединенный.СуммаСборов) КАК СуммаСбора,
		             |		ЗапросОбъединенный.Ссылка КАК Ссылка,
		             |		МАКСИМУМ(ЗапросОбъединенный.ДоговорКонтрагента) КАК ДоговорКонтрагента,
		             |		МАКСИМУМ(ЗапросОбъединенный.Контрагент) КАК Контрагент,
		             |		МАКСИМУМ(ЗапросОбъединенный.Организация) КАК Организация,
		             |		МАКСИМУМ(ЗапросОбъединенный.Цена) КАК Цена,
		             |		СУММА(ЗапросОбъединенный.Количество) КАК Количество,
		             |		МАКСИМУМ(ЗапросОбъединенный.НомерГТД) КАК НомерГТД,
		             |		МАКСИМУМ(ЗапросОбъединенный.ДатаГТД) КАК ДатаГТД,
		             |		МАКСИМУМ(ЗапросОбъединенный.ВалютаДокумента) КАК Валюта,
		             |		МАКСИМУМ(ЗапросОбъединенный.Курс) КАК КурсВалюты,
		             |		ЗапросОбъединенный.ПинКод КАК ПинКод,
		             |		МАКСИМУМ(ЗапросОбъединенный.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		             |		МАКСИМУМ(ЗапросОбъединенный.Счет) КАК Счет,
		             |		СУММА(ЗапросОбъединенный.СуммаАкциза) КАК СуммаАкциза,
		             |		МАКСИМУМ(ЗапросОбъединенный.СуммаНДСПоПрочимОперациям) КАК СуммаНДСПоПрочимОперациям,
		             |		МАКСИМУМ(ЗапросОбъединенный.Дата) КАК Дата
		             |	ИЗ
		             |		(ВЫБРАТЬ
		             |			Поступления.Ссылка КАК Ссылка,
		             |			Поступления.Номенклатура КАК Номенклатура,
		             |			Поступления.Сумма КАК Сумма,
		             |			ВЫБОР
		             |				КОГДА Итоги.Сумма <> 0
		             |					ТОГДА Поступления.Сумма / Итоги.Сумма * НДСКУплате.СуммаНДС
		             |				ИНАЧЕ НДСКУплате.СуммаНДС
		             |			КОНЕЦ КАК СуммаНДС,
		             |			Поступления.СуммаПошлины КАК СуммаПошлины,
		             |			Поступления.СуммаСборов КАК СуммаСборов,
		             |			НДСКУплате.Дата КАК ДатаГТД,
		             |			НДСКУплате.Номер КАК НомерГТД,
		             |			Поступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
		             |			Поступления.Контрагент КАК Контрагент,
		             |			Поступления.Организация КАК Организация,
		             |			Поступления.Цена КАК Цена,
		             |			Поступления.Количество КАК Количество,
		             |			Поступления.ВалютаДокумента КАК ВалютаДокумента,
		             |			Поступления.Курс КАК Курс,
		             |			Поступления.ПинКод КАК ПинКод,
		             |			ВЫБОР
		             |				КОГДА Поступления.ЕдиницаИзмерения ЕСТЬ NULL 
		             |						ИЛИ Поступления.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
		             |					ТОГДА НДСКУплате.ЕдиницаИзмерения
		             |				ИНАЧЕ Поступления.ЕдиницаИзмерения
		             |			КОНЕЦ КАК ЕдиницаИзмерения,
		             |			Поступления.Счет КАК Счет,
		             |			0 КАК СуммаАкциза,
		             |			НДСКУплате.СуммаНДС КАК СуммаНДСПоПрочимОперациям,
		             |			Поступления.Дата КАК Дата
		             |		ИЗ
		             |			ВТ_ПоступленияИЗТС КАК Поступления
		             |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		             |					ВТ_Поступления.Номенклатура КАК Номенклатура,
		             |					СУММА(ВТ_Поступления.Сумма) КАК Сумма,
		             |					ВТ_Поступления.Ссылка КАК Ссылка
		             |				ИЗ
		             |					ВТ_ПоступленияИЗТС КАК ВТ_Поступления
		             |				
		             |				СГРУППИРОВАТЬ ПО
		             |					ВТ_Поступления.Номенклатура,
		             |					ВТ_Поступления.Ссылка) КАК Итоги
		             |				ПО Поступления.Ссылка = Итоги.Ссылка
		             |					И Поступления.Номенклатура = Итоги.Номенклатура
		             |				ЛЕВОЕ СОЕДИНЕНИЕ НДСКУплате КАК НДСКУплате
		             |				ПО Поступления.Номенклатура = НДСКУплате.Номенклатура
		             |					И Поступления.Ссылка = НДСКУплате.ДокументОснование
		             |		
		             |		ОБЪЕДИНИТЬ ВСЕ
		             |		
		             |		ВЫБРАТЬ
		             |			ГТД.ДокументПартии,
		             |			ГТД.Номенклатура,
		             |			0,
		             |			ГТД.СуммаНДСРегл,
		             |			ГТД.СуммаПошлиныРегл,
		             |			ГТД.СуммаВсехСборов,
		             |			ГТД.ДатаГТД,
		             |			ГТД.НомерГТД,
		             |			NULL,
		             |			NULL,
		             |			NULL,
		             |			0,
		             |			0,
		             |			NULL,
		             |			0,
		             |			ГТД.ПинКод,
		             |			NULL,
		             |			NULL,
		             |			ГТД.СуммаАкциза,
		             |			NULL,
		             |			NULL
		             |		ИЗ
		             |			ВТ_ГТД КАК ГТД) КАК ЗапросОбъединенный
		             |	
		             |	СГРУППИРОВАТЬ ПО
		             |		ЗапросОбъединенный.Номенклатура,
		             |		ЗапросОбъединенный.Ссылка,
		             |		ЗапросОбъединенный.ПинКод) КАК ВложенныйЗапрос
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
		             |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП
		             |ИТОГИ
		             |	СУММА(СуммаНДС),
		             |	МАКСИМУМ(СуммаНДСПоПрочимОперациям)
		             |ПО
		             |	Ссылка,
		             |	Номенклатура";
					 
					 ВыборкаПоСсылке = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					 
					 НаборЗаписей = РегистрыНакопления.моп_МониторингИмпорта.СоздатьНаборЗаписей();	
					 ТаблицаДвижений = НаборЗаписей.Выгрузить();
					 ТаблицаДвижений.Очистить();
					 
					 Пока ВыборкаПоСсылке.Следующий() Цикл
						 ВыборкаПоНоменклатуре = ВыборкаПоСсылке.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						 Пока ВыборкаПоНоменклатуре.Следующий() Цикл
							 Выборка = ВыборкаПоНоменклатуре.Выбрать();
							 СуммаКорректировкиПогрешности = ?(ВыборкаПоНоменклатуре.СуммаНДСПоПрочимОперациям = NULL, 0, ВыборкаПоНоменклатуре.СуммаНДСПоПрочимОперациям - ВыборкаПоНоменклатуре.СуммаНДС);
							 Пока Выборка.Следующий() Цикл
									 
								 Док = Выборка.Ссылка;
								 
								 Движение 					= ТаблицаДвижений.Добавить();
								 Движение.Счет				= Выборка.Счет;
								 Движение.Период 			= Выборка.Дата;		
								 Движение.Номенклатура 		= Выборка.Номенклатура;
								 Движение.ПинКод             = Выборка.ПинКод;
								 Движение.КодТНВЭД           = Выборка.КодТНВЭД;
								 Движение.СуммаБезНалогов 	= Выборка.Сумма;
								 Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
								 
								 Движение.СуммаНДС 			= Выборка.СуммаНДС;
								 Движение.СуммаПошлины 		= Выборка.СуммаПошлины;
								 Движение.СуммаСборов 		= Выборка.СуммаСбора;
								 Движение.СсылкаНаДокумент	= Выборка.Ссылка;
								 Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
								 Движение.Контрагент 		= Выборка.Контрагент;
								 Движение.Организация 		= Выборка.Организация;		
								 
								 Движение.Количество 		= Выборка.Количество;
								 Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);		
								 Движение.НомерГТД		 	= Выборка.НомерГТД;		
								 Движение.ДатаГТД		 	= Выборка.ДатаГТД;				
								 Движение.Акциз 				= Выборка.СуммаАкциза;
								 
								 Движение.Валюта 			= Выборка.Валюта;
								 Движение.КурсТенге 			= Выборка.КурсВалюты;
								 
							 КонецЦикла;
							 Если СуммаКорректировкиПогрешности <> 0 и Выборка.Количество() > 0 Тогда
							 Движение.СуммаНДС = Движение.СуммаНДС + СуммаКорректировкиПогрешности;
							 КонецЕсли;
						 КонецЦикла;
					 КонецЦикла;
					 
					 НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
					 НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
					 НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
					 НаборЗаписей.ВыполнитьДвижения();
					 НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу экспорта
// если дополнение встроено в конфигурацию "1С-Рейтинг: Нефтебаза"
//
Процедура ВыполнитьДвиженияПоМониторингуЭкспортаГСМ(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	//Делаем проверку на правильность обращения к перечислению
	//в конфигурации "Бухгалтерии для Казахстана" релиз 1.5.5.4 и ниже,
	//использовалось перечисление "ВидыОперацийРеализацииТоваровУслуг"
	//начиная с версии 1.5.6.11 используется перечисление "ВидыОперацийРеализацияТоваров"
	Если Метаданные.Перечисления.Найти("ВидыОперацийРеализацияТоваров") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацияТоваров"].ПередачаСтруктурномуПодразделению);
	ИначеЕсли  Метаданные.Перечисления.Найти("ВидыОперацийРеализацииТоваровУслуг") <> Неопределено Тогда
		Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления["ВидыОперацийРеализацииТоваровУслуг"].ПередачаСтруктурномуПодразделению);	
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеОС", Перечисления.ВидыОперацийПередачиОС.ПередачаСтруктурномуПодразделению);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеГСМ", Перечисления.гсм_ВидыОперацийРеализации.ПередачаСтруктурномуПодразделению);
	
	ТекущийРелиз = ОбщегоНазначения.ПолучитьНомерРелиза(Метаданные.Версия);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.СчетДоходовБУ,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.СУММА,
	               |	ВложенныйЗапрос.Валюта,
	               |	ВложенныйЗапрос.КурсВалюты,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.Организация,
	               |	ЕСТЬNULL(ВложенныйЗапрос.ПинКод, моп_ОбъектыМониторинга.ПинКод) КАК ПинКод,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	моп_СведенияПоЭкспортуТовары.СуммаПошлины,
	               |	моп_СведенияПоЭкспортуТовары.НомерГТД,
	               |	моп_СведенияПоЭкспортуТовары.ДатаГТД,
	               |	моп_СведенияПоЭкспортуТовары.ДатаИнвойса,
	               |	моп_СведенияПоЭкспортуТовары.НомерИнвойса,
	               |	моп_СведенияПоЭкспортуТовары.УсловияПоставки,
	               |	моп_СведенияПоЭкспортуТовары.МестоОтгрузки,
	               |	моп_СведенияПоЭкспортуТовары.ДатаПаспортаСделки,
	               |	моп_СведенияПоЭкспортуТовары.НомерПаспортаСделки,
	               |	моп_СведенияПоЭкспортуТовары.ДатаОплаты,
	               |	моп_СведенияПоЭкспортуТовары.СуммаСборов
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	               |		РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		РеализацияТоваровУслугТовары.Цена КАК Цена,
	               |		РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ КАК СУММА,
	               |		РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента КАК Валюта,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов / РеализацияТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ КАК КурсВалюты,
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата КАК Дата,
	               |		РеализацияТоваровУслугТовары.Ссылка.Ссылка КАК СсылкаНаДокумент,
	               |		РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	               |		NULL КАК ПинКод,
	               |		РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Номенклатура,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Контрагент,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Цена,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КурсВзаиморасчетов / АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация,
	               |		NULL,
	               |		АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	               |	ГДЕ
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация = &Организация
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаНМА.СчетДоходовБУ,
	               |		ПередачаНМА.НематериальныйАктив,
	               |		ПередачаНМА.Контрагент,
	               |		ПередачаНМА.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		ПередачаНМА.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА ПередачаНМА.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ ПередачаНМА.Ссылка.КурсВзаиморасчетов / ПередачаНМА.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		ПередачаНМА.Дата,
	               |		ПередачаНМА.Ссылка,
	               |		ПередачаНМА.Организация,
	               |		NULL,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаНМА КАК ПередачаНМА
	               |	ГДЕ
	               |		ПередачаНМА.Дата >= &НачДата
	               |		И ПередачаНМА.Дата <= &КонДата
	               |		И ПередачаНМА.Организация = &Организация
	               |		И ПередачаНМА.Проведен = ИСТИНА
	               |		И ПередачаНМА.ВалютаДокумента <> &ВалютаРегУчета
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаОСОС.СчетДоходовБУ,
	               |		ПередачаОСОС.ОсновноеСредство,
	               |		ПередачаОСОС.Ссылка.Контрагент,
	               |		ПередачаОСОС.Ссылка.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		ПередачаОСОС.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА ПередачаОСОС.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ ПередачаОСОС.Ссылка.КурсВзаиморасчетов / ПередачаОСОС.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		ПередачаОСОС.Ссылка.Дата,
	               |		ПередачаОСОС.Ссылка.Ссылка,
	               |		ПередачаОСОС.Ссылка.Организация,
	               |		NULL,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаОС.ОС КАК ПередачаОСОС
	               |	ГДЕ
	               |		ПередачаОСОС.Ссылка.Дата >= &НачДата
	               |		И ПередачаОСОС.Ссылка.Дата <= &КонДата
	               |		И ПередачаОСОС.Ссылка.Организация = &Организация
	               |		И ПередачаОСОС.Ссылка.Проведен = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И ПередачаОСОС.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеОС
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугУслуги.СчетДоходовБУ,
	               |		РеализацияТоваровУслугУслуги.Номенклатура,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугУслуги.Цена,
	               |		РеализацияТоваровУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов / РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Организация,
	               |		NULL,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеУслуги.Номенклатура,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеУслуги.Цена,
	               |		РеализацияУслугПоПереработкеУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Ссылка.КурсВзаиморасчетов / РеализацияУслугПоПереработкеУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Ссылка,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Организация,
	               |		NULL,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Проведен = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		гсм_РеализацияТовары.СчетДоходовБУ,
	               |		гсм_РеализацияТовары.Номенклатура,
	               |		гсм_РеализацияТовары.Ссылка.Контрагент,
	               |		гсм_РеализацияТовары.Ссылка.ДоговорКонтрагента,
	               |		гсм_РеализацияТовары.Цена,
	               |		гсм_РеализацияТовары.Количество,
	               |		ВЫБОР
	               |			КОГДА гсм_РеализацияТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА гсм_РеализацияТовары.Сумма - гсм_РеализацияТовары.СуммаНДС
	               |			ИНАЧЕ гсм_РеализацияТовары.Сумма
	               |		КОНЕЦ,
	               |		гсм_РеализацияТовары.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА гсм_РеализацияТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА гсм_РеализацияТовары.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ гсм_РеализацияТовары.Ссылка.КурсВзаиморасчетов / гсм_РеализацияТовары.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		гсм_РеализацияТовары.Ссылка.Дата,
	               |		гсм_РеализацияТовары.Ссылка.Ссылка,
	               |		гсм_РеализацияТовары.Ссылка.Организация,
	               |		гсм_РеализацияТовары.ПинКод.Код,
	               |		гсм_РеализацияТовары.Номенклатура.БазоваяЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.гсм_Реализация.Товары КАК гсм_РеализацияТовары
	               |	ГДЕ
	               |		гсм_РеализацияТовары.Ссылка.Дата >= &НачДата
	               |		И гсм_РеализацияТовары.Ссылка.Дата <= &КонДата
	               |		И гсм_РеализацияТовары.Ссылка.Организация = &Организация
	               |		И гсм_РеализацияТовары.Ссылка.Проведен = ИСТИНА
	               |		И гсм_РеализацияТовары.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И гсм_РеализацияТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеГСМ
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		гсм_РеализацияТоварыЧерезАЗС.СчетДоходовБУ,
	               |		гсм_РеализацияТоварыЧерезАЗС.Номенклатура,
	               |		гсм_РеализацияТоварыЧерезАЗС.Контрагент,
	               |		гсм_РеализацияТоварыЧерезАЗС.ДоговорКонтрагента,
	               |		гсм_РеализацияТоварыЧерезАЗС.Цена,
	               |		гсм_РеализацияТоварыЧерезАЗС.Количество,
	               |		гсм_РеализацияТоварыЧерезАЗС.Сумма,
	               |		гсм_РеализацияТоварыЧерезАЗС.ВалютаДокумента,
	               |		гсм_РеализацияТоварыЧерезАЗС.Курс,
	               |		гсм_РеализацияТоварыЧерезАЗС.Дата,
	               |		гсм_РеализацияТоварыЧерезАЗС.СсылкаНаДокумент,
	               |		гсм_РеализацияТоварыЧерезАЗС.Организация,
	               |		гсм_РеализацияТоварыЧерезАЗС.ПинКод,
	               |		гсм_РеализацияТоварыЧерезАЗС.Номенклатура.БазоваяЕдиницаИзмерения
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			гсм_РеализацияЧерезАЗСТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |			гсм_РеализацияЧерезАЗСТовары.Номенклатура КАК Номенклатура,
	               |			гсм_РеализацияЧерезАЗСКонтрагенты.Контрагент КАК Контрагент,
	               |			гсм_РеализацияЧерезАЗСКонтрагенты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			гсм_РеализацияЧерезАЗСТовары.Цена КАК Цена,
	               |			гсм_РеализацияЧерезАЗСТовары.Количество КАК Количество,
	               |			ВЫБОР
	               |				КОГДА гсм_РеализацияЧерезАЗСТовары.Ссылка.СуммаВключаетНДС
	               |					ТОГДА гсм_РеализацияЧерезАЗСТовары.Сумма - гсм_РеализацияЧерезАЗСТовары.СуммаНДС
	               |				ИНАЧЕ гсм_РеализацияЧерезАЗСТовары.Сумма
	               |			КОНЕЦ КАК Сумма,
	               |			гсм_РеализацияЧерезАЗСТовары.СтавкаНДС КАК СтавкаНДС,
	               |			гсм_РеализацияЧерезАЗСТовары.СуммаНДС КАК СуммаНДС,
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Дата КАК Дата,
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Ссылка КАК СсылкаНаДокумент,
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Организация КАК Организация,
	               |			гсм_РеализацияЧерезАЗСТовары.ПинКод.Код КАК ПинКод,
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	               |			ВЫБОР
	               |				КОГДА гсм_РеализацияЧерезАЗСТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |					ТОГДА гсм_РеализацияЧерезАЗСТовары.Ссылка.КурсВзаиморасчетов
	               |				ИНАЧЕ гсм_РеализацияЧерезАЗСТовары.Ссылка.КурсВзаиморасчетов / гсм_РеализацияЧерезАЗСТовары.Ссылка.КратностьВзаиморасчетов
	               |			КОНЕЦ КАК Курс
	               |		ИЗ
	               |			Документ.гсм_РеализацияЧерезАЗС.Товары КАК гсм_РеализацияЧерезАЗСТовары
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.гсм_РеализацияЧерезАЗС.Контрагенты КАК гсм_РеализацияЧерезАЗСКонтрагенты
	               |				ПО гсм_РеализацияЧерезАЗСТовары.Ссылка = гсм_РеализацияЧерезАЗСКонтрагенты.Ссылка
	               |					И гсм_РеализацияЧерезАЗСТовары.НомерКонтрагента = гсм_РеализацияЧерезАЗСКонтрагенты.НомерСтроки
	               |		ГДЕ
	               |			гсм_РеализацияЧерезАЗСТовары.Ссылка.Дата >= &НачДата
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.Дата <= &КонДата
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.Организация = &Организация
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.Проведен = ИСТИНА
	               |			И гсм_РеализацияЧерезАЗСТовары.Ссылка.ВалютаДокумента <> &ВалютаРегУчета) КАК гсм_РеализацияТоварыЧерезАЗС) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии КАК ДокументПартии,
	               |			моп_СведенияПоЭкспортуТовары.Номенклатура КАК Номенклатура,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА моп_СведенияПоЭкспортуТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегУчета
	               |						ТОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаПошлины, 0)
	               |					КОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаПошлины, 0) * ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КурсВзаиморасчетов, 0) / ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) КАК ЧИСЛО(15, 2))
	               |				КОНЕЦ) КАК СуммаПошлины,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерГТД КАК НомерГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаГТД КАК ДатаГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаИнвойса КАК ДатаИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерИнвойса КАК НомерИнвойса,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.МестоОтгрузки, 1, 250) КАК МестоОтгрузки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаПаспортаСделки КАК ДатаПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерПаспортаСделки КАК НомерПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаОплаты КАК ДатаОплаты,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.УсловияПоставки, 1, 250) КАК УсловияПоставки,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА моп_СведенияПоЭкспортуТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегУчета
	               |						ТОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаСборов, 0)
	               |					КОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаСборов, 0) * ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КурсВзаиморасчетов, 0) / ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) КАК ЧИСЛО(15, 2))
	               |				КОНЕЦ) КАК СуммаСборов
	               |		ИЗ
	               |			Документ.моп_СведенияПоЭкспорту.Товары КАК моп_СведенияПоЭкспортуТовары
	               |		ГДЕ
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						РеализацияТоваровУслуг.Ссылка КАК ССЫЛКА
	               |					ИЗ
	               |						Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |					ГДЕ
	               |						РеализацияТоваровУслуг.Дата >= &НачДата
	               |						И РеализацияТоваровУслуг.Дата <= &КонДата
	               |						И РеализацияТоваровУслуг.Организация = &Организация
	               |						И РеализацияТоваровУслуг.Проведен
	               |						И РеализацияТоваровУслуг.ВалютаДокумента <> &ВалютаРегУчета
	               |						И РеализацияТоваровУслуг.ВидОперации <> &ВидОперацииСтруктурные
	               |				
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |				
	               |					ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						гсм_Реализация.Ссылка КАК ССЫЛКА
	               |					ИЗ
	               |						Документ.гсм_Реализация КАК гсм_Реализация
	               |					ГДЕ
	               |						гсм_Реализация.Дата >= &НачДата
	               |						И гсм_Реализация.Дата <= &КонДата
	               |						И гсм_Реализация.Организация = &Организация
	               |						И гсм_Реализация.Проведен
	               |						И гсм_Реализация.ВалютаДокумента <> &ВалютаРегУчета
	               |						И гсм_Реализация.ВидОперации <> &ВидОперацииСтруктурные)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии,
	               |			моп_СведенияПоЭкспортуТовары.Номенклатура,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаОплаты,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.МестоОтгрузки, 1, 250),
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.УсловияПоставки, 1, 250)) КАК моп_СведенияПоЭкспортуТовары
	               |		ПО ВложенныйЗапрос.СсылкаНаДокумент = моп_СведенияПоЭкспортуТовары.ДокументПартии
	               |			И ВложенныйЗапрос.Номенклатура = моп_СведенияПоЭкспортуТовары.Номенклатура";					   			
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингЭкспорта.СоздатьНаборЗаписей();	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.СсылкаНаДокумент;
		
		СчетФактура = ОбщегоНазначения.НайтиПодчиненныйДокумент(Док, "СчетФактураВыданный");		
		Если ЗначениеЗаполнено(СчетФактура) Тогда								
			Если СчетФактура.Дополнительная тогда
				продолжить;
			КонецЕсли;		
		КонецЕсли;	
				
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Счет				= Выборка.СчетДоходовБУ;		
		Движение.Период 			= Выборка.Дата;		
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ПинКод             = Выборка.ПинКод;
		Движение.КодТНВЭД           = Выборка.КодТНВЭД;
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Движение.СуммаБезНалогов 	= Выборка.Сумма;
		Движение.СуммаПошлины			= Выборка.СуммаПошлины;
		Движение.СуммаСборов			= Выборка.СуммаСборов;				
		Движение.СсылкаНаДокумент	= Док;
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.Контрагент 		= Выборка.Контрагент;
		Движение.Организация 		= Выборка.Организация;				
		Движение.Количество 		= Выборка.Количество;
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);		
		Движение.Валюта 			= Выборка.Валюта;
		Движение.КурсТенге 			= Выборка.КурсВалюты;
		
		Движение.НомерГТД				= Выборка.НомерГТД;
		Движение.ДатаГТД				= Выборка.ДатаГТД;
		Движение.НомерИнвойса			= Выборка.НомерИнвойса;		
		Движение.ДатаИнвойса			= Выборка.ДатаИнвойса;
		Движение.УсловияПоставки		= Выборка.УсловияПоставки;
		Движение.МестоОтгрузки			= Выборка.МестоОтгрузки;
		Движение.ДатаПаспортаСделки		= Выборка.ДатаПаспортаСделки;
		Движение.НомерПаспортаСделки	= Выборка.НомерПаспортаСделки;
		Движение.ДатаОплаты				= Выборка.ДатаОплаты;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу реализации
// если дополнение встроено в конфигурацию "УПП"
//
Процедура ВыполнитьДвиженияПоМониторингуРеализацииУПП(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт	
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеОС", Перечисления.ВидыОперацийПередачиОС.ПередачаСтруктурномуПодразделению);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.СчетДоходовБУ,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.СтавкаНДС,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.ОснованиеВозврата,
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.СуммаАкциза,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА (НЕ ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL )
	               |				И ВложенныйЗапрос.Контрагент.Ссылка <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				И (ВложенныйЗапрос.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |					И (НЕ ВложенныйЗапрос.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус))
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL 
	               |				ИЛИ ВложенныйЗапрос.Контрагент.Ссылка = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВложенныйЗапрос.КонтрагентЯвляетсяЧастнымЛицом
	               |	КОНЕЦ КАК КонтрагентЯвляетсяЧастнымЛицом,
	               |	ВложенныйЗапрос.ВалютаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КратностьВзаиморасчетов, 0) КАК КратностьВзаиморасчетов,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КурсВзаиморасчетов, 0) КАК КурсВзаиморасчетов,
	               |	моп_ОбъектыМониторинга.ПинКод
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВозвратТоваровОтПокупателяТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |		ВозвратТоваровОтПокупателяТовары.Номенклатура КАК Номенклатура,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент КАК Контрагент,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВозвратТоваровОтПокупателяТовары.Цена КАК Цена,
	               |		ВозвратТоваровОтПокупателяТовары.Количество КАК Количество,
	               |		ВЫБОР
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |					И ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС - ВозвратТоваровОтПокупателяТовары.СуммаАкциза
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаНДС
	               |			КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА ВозвратТоваровОтПокупателяТовары.Сумма - ВозвратТоваровОтПокупателяТовары.СуммаАкциза
	               |			ИНАЧЕ ВозвратТоваровОтПокупателяТовары.Сумма
	               |		КОНЕЦ КАК Сумма,
	               |		ВозвратТоваровОтПокупателяТовары.СтавкаНДС КАК СтавкаНДС,
	               |		ВозвратТоваровОтПокупателяТовары.СуммаНДС КАК СуммаНДС,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Дата КАК Дата,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка КАК СсылкаНаДокумент,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.ДокументОснование КАК ОснованиеВозврата,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Организация КАК Организация,
	               |		ВозвратТоваровОтПокупателяТовары.СуммаАкциза КАК СуммаАкциза,
	               |		ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	               |		NULL КАК КонтрагентЯвляетсяЧастнымЛицом,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.КурсВзаиморасчетов КАК КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	               |	ГДЕ
	               |		ВозвратТоваровОтПокупателяТовары.Ссылка.Дата >= &НачДата
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Организация = &Организация
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Дата <= &КонДата
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен = ИСТИНА
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И ВозвратТоваровОтПокупателяТовары.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.СчетДоходовБУ,
	               |		РеализацияТоваровУслугТовары.Номенклатура,
	               |		РеализацияТоваровУслугТовары.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугТовары.Цена,
	               |		РеализацияТоваровУслугТовары.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |					И РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС - РеализацияТоваровУслугТовары.СуммаАкциза
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетАкциз
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаАкциза
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугТовары.СтавкаНДС,
	               |		РеализацияТоваровУслугТовары.СуммаНДС,
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата,
	               |		РеализацияТоваровУслугТовары.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияТоваровУслугТовары.Ссылка.Организация,
	               |		РеализацияТоваровУслугТовары.СуммаАкциза,
	               |		РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	               |		NULL,
	               |		РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента,
	               |		РеализацияТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов,
	               |		РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |		И РеализацияТоваровУслугТовары.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Номенклатура,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Контрагент,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Цена,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.СтавкаНДС,
	               |		АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка,
	               |		0,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация,
	               |		0,
	               |		АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	               |		NULL,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КратностьВзаиморасчетов,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	               |	ГДЕ
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация = &Организация
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаНМА.СчетДоходовБУ,
	               |		ПередачаНМА.НематериальныйАктив,
	               |		ПередачаНМА.Контрагент,
	               |		ПередачаНМА.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		ПередачаНМА.СтавкаНДС,
	               |		ПередачаНМА.СуммаНДС,
	               |		ПередачаНМА.Дата,
	               |		ПередачаНМА.Ссылка,
	               |		0,
	               |		ПередачаНМА.Организация,
	               |		0,
	               |		NULL,
	               |		NULL,
	               |		ПередачаНМА.ВалютаДокумента,
	               |		ПередачаНМА.КратностьВзаиморасчетов,
	               |		ПередачаНМА.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ПередачаНМА КАК ПередачаНМА
	               |	ГДЕ
	               |		ПередачаНМА.Дата >= &НачДата
	               |		И ПередачаНМА.Дата <= &КонДата
	               |		И ПередачаНМА.Организация = &Организация
	               |		И ПередачаНМА.Проведен = ИСТИНА
	               |		И ПередачаНМА.ВалютаДокумента = &ВалютаРегУчета
	               |		И ПередачаНМА.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаОСОС.СчетДоходовБУ,
	               |		ПередачаОСОС.ОсновноеСредство,
	               |		ПередачаОСОС.Ссылка.Контрагент,
	               |		ПередачаОСОС.Ссылка.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		ПередачаОСОС.СтавкаНДС,
	               |		ПередачаОСОС.СуммаНДС,
	               |		ПередачаОСОС.Ссылка.Дата,
	               |		ПередачаОСОС.Ссылка.Ссылка,
	               |		0,
	               |		ПередачаОСОС.Ссылка.Организация,
	               |		0,
	               |		NULL,
	               |		NULL,
	               |		ПередачаОСОС.Ссылка.ВалютаДокумента,
	               |		ПередачаОСОС.Ссылка.КратностьВзаиморасчетов,
	               |		ПередачаОСОС.Ссылка.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ПередачаОС.ОС КАК ПередачаОСОС
	               |	ГДЕ
	               |		ПередачаОСОС.Ссылка.Дата >= &НачДата
	               |		И ПередачаОСОС.Ссылка.Дата <= &КонДата
	               |		И ПередачаОСОС.Ссылка.Организация = &Организация
	               |		И ПередачаОСОС.Ссылка.Проведен = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И ПередачаОСОС.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеОС
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугУслуги.СчетДоходовБУ,
	               |		РеализацияТоваровУслугУслуги.Номенклатура,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугУслуги.Цена,
	               |		РеализацияТоваровУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.СтавкаНДС,
	               |		РеализацияТоваровУслугУслуги.СуммаНДС,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Организация,
	               |		0,
	               |		NULL,
	               |		NULL,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	               |		РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов,
	               |		РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеУслуги.Номенклатура,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеУслуги.Цена,
	               |		РеализацияУслугПоПереработкеУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.СтавкаНДС,
	               |		РеализацияУслугПоПереработкеУслуги.СуммаНДС,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Организация,
	               |		0,
	               |		NULL,
	               |		NULL,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.КратностьВзаиморасчетов,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеПродукция.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеПродукция.Номенклатура,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеПродукция.Цена,
	               |		РеализацияУслугПоПереработкеПродукция.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеПродукция.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеПродукция.Сумма - РеализацияУслугПоПереработкеПродукция.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеПродукция.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеПродукция.СтавкаНДС,
	               |		РеализацияУслугПоПереработкеПродукция.СуммаНДС,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Ссылка,
	               |		0,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Организация,
	               |		0,
	               |		NULL,
	               |		NULL,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.ВалютаДокумента,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.КратностьВзаиморасчетов,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Продукция КАК РеализацияУслугПоПереработкеПродукция
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.СчетДоходовБУ,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.СуммаВознаграждения - ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.СуммаВознаграждения
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.СуммаВознаграждения - ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.СуммаВознаграждения
	               |		КОНЕЦ,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.СтавкаНДСВознаграждения,
	               |		ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Ссылка,
	               |		0,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
	               |		0,
	               |		NULL,
	               |		NULL,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.КратностьВзаиморасчетов,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |	ГДЕ
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Дата >= &НачДата
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.Дата <= &КонДата
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.Организация = &Организация
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента = &ВалютаРегУчета
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.СпособРасчетаКомиссионногоВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.РазницаСуммПродажиИПокупки)
	               |		И ОтчетКомитентуОПродажахТовары.СуммаВознаграждения <> 0
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВложенныйЗапрос.СчетДоходовБУ,
	               |		ВложенныйЗапрос.Номенклатура,
	               |		NULL,
	               |		NULL,
	               |		ВложенныйЗапрос.Цена,
	               |		ВложенныйЗапрос.Количество,
	               |		ВложенныйЗапрос.Сумма,
	               |		ВложенныйЗапрос.СтавкаНДС,
	               |		ВложенныйЗапрос.СуммаНДС,
	               |		ВложенныйЗапрос.Дата,
	               |		ВложенныйЗапрос.Ссылка,
	               |		0,
	               |		ВложенныйЗапрос.Организация,
	               |		ВложенныйЗапрос.СуммаАкциза,
	               |		ВложенныйЗапрос.ЕдиницаИзмеренияЕдиницаПоКлассификатору,
	               |		ИСТИНА,
	               |		&ВалютаРегУчета,
	               |		NULL,
	               |		NULL
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ОтчетОРозничныхПродажахТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |			ОтчетОРозничныхПродажахТовары.Номенклатура КАК Номенклатура,
	               |			ОтчетОРозничныхПродажахТовары.Цена КАК Цена,
	               |			СУММА(ОтчетОРозничныхПродажахТовары.Количество) КАК Количество,
	               |			СУММА(ВЫБОР
	               |					КОГДА ОтчетОРозничныхПродажахТовары.Ссылка.СуммаВключаетНДС
	               |							И ОтчетОРозничныхПродажахТовары.Ссылка.СуммаВключаетАкциз
	               |						ТОГДА ОтчетОРозничныхПродажахТовары.Сумма - ОтчетОРозничныхПродажахТовары.СуммаНДС - ОтчетОРозничныхПродажахТовары.СуммаАкциза
	               |					КОГДА ОтчетОРозничныхПродажахТовары.Ссылка.СуммаВключаетНДС
	               |						ТОГДА ОтчетОРозничныхПродажахТовары.Сумма - ОтчетОРозничныхПродажахТовары.СуммаНДС
	               |					КОГДА ОтчетОРозничныхПродажахТовары.Ссылка.СуммаВключаетАкциз
	               |						ТОГДА ОтчетОРозничныхПродажахТовары.Сумма - ОтчетОРозничныхПродажахТовары.СуммаАкциза
	               |					ИНАЧЕ ОтчетОРозничныхПродажахТовары.Сумма
	               |				КОНЕЦ) КАК Сумма,
	               |			ОтчетОРозничныхПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	               |			СУММА(ОтчетОРозничныхПродажахТовары.СуммаНДС) КАК СуммаНДС,
	               |			ОтчетОРозничныхПродажахТовары.Ссылка.Дата КАК Дата,
	               |			ОтчетОРозничныхПродажахТовары.Ссылка КАК Ссылка,
	               |			ОтчетОРозничныхПродажахТовары.Ссылка.Организация КАК Организация,
	               |			СУММА(ОтчетОРозничныхПродажахТовары.СуммаАкциза) КАК СуммаАкциза,
	               |			ОтчетОРозничныхПродажахТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмеренияЕдиницаПоКлассификатору
	               |		ИЗ
	               |			Документ.ОтчетОРозничныхПродажах.Товары КАК ОтчетОРозничныхПродажахТовары
	               |		ГДЕ
	               |			ОтчетОРозничныхПродажахТовары.Ссылка.Дата >= &НачДата
	               |			И ОтчетОРозничныхПродажахТовары.Ссылка.Дата <= &КонДата
	               |			И ОтчетОРозничныхПродажахТовары.Ссылка.Организация = &Организация
	               |			И ОтчетОРозничныхПродажахТовары.Ссылка.Проведен = ИСТИНА
	               |			И ОтчетОРозничныхПродажахТовары.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ОтчетОРозничныхПродажахТовары.СчетДоходовБУ,
	               |			ОтчетОРозничныхПродажахТовары.Номенклатура,
	               |			ОтчетОРозничныхПродажахТовары.Цена,
	               |			ОтчетОРозничныхПродажахТовары.СтавкаНДС,
	               |			ОтчетОРозничныхПродажахТовары.Ссылка.Дата,
	               |			ОтчетОРозничныхПродажахТовары.Ссылка,
	               |			ОтчетОРозничныхПродажахТовары.Ссылка.Организация,
	               |			ОтчетОРозничныхПродажахТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП";					   			
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингРеализации.СоздатьНаборЗаписей();
	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	ИспользоватьДанныеИзДополнительныхСчетовФактур = моп_Общий.ИспользоватьДанныеИзДополнительныхСчетовФактур(ДанныеДокумента.Дата);
	Если ИспользоватьДанныеИзДополнительныхСчетовФактур = Неопределено Тогда
		ИспользоватьДанныеИзДополнительныхСчетовФактур = Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.СсылкаНаДокумент;
		
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;
		Движение.Счет 				= Выборка.СчетДоходовБУ;
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.КодТНВЭД           = Выборка.КодТНВЭД;
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Движение.КонтрагентЯвляетсяЧастнымЛицом = Выборка.КонтрагентЯвляетсяЧастнымЛицом;
		
		Движение.Контрагент 		= Выборка.Контрагент;	
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.СчетФактура 		= ОбщегоНазначения.НайтиПодчиненныйДокумент(Док, "СчетФактураВыданный");
		Движение.ПинКод				= Выборка.ПинКод;
		
		Если ЗначениеЗаполнено(Движение.СчетФактура) Тогда								
			Движение.СчетФактураЯвляетсяДополнительным = Движение.СчетФактура.Дополнительная;				
		КонецЕсли;	
		
		ДанныеКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Выборка.Дата);		
		
		Если ИспользоватьДанныеИзДополнительныхСчетовФактур и ЗначениеЗаполнено(Движение.СчетФактура) и Движение.СчетФактураЯвляетсяДополнительным Тогда
			ЗаполнитьДанныеИзДополнительногоСчетаФактуры(Движение.СчетФактура, Движение, Выборка, ДанныеКурсаВалюты, ВалютаРегламентированногоУчета, Истина);
		Иначе
		
		Движение.Количество 		= Выборка.Количество;
		
		Движение.СуммаБезНалогов 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);		
				
		Движение.Акциз 				= ?(Выборка.СуммаАкциза = NULL, 0 , Выборка.СуммаАкциза);
		
		Движение.СуммаНДС 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
	КонецЕсли;
	
		Движение.СтавкаНДС 			= Выборка.СтавкаНДС;	
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);

		Попытка									
			Если ЗначениеЗаполнено(Движение.СчетФактура) Тогда				
				Движение.СчетФактураКорректируемый = Движение.СчетФактура.ОсновнойСчетФактура;				
			КонецЕсли;			
		Исключение
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(Движение.СчетФактураКорректируемый) Тогда
			Если ЗначениеЗаполнено(Выборка.ОснованиеВозврата) Тогда
				Движение.СчетФактураКорректируемый = ОбщегоНазначения.НайтиПодчиненныйДокумент(Выборка.ОснованиеВозврата, "СчетФактураВыданный");
			КонецЕсли;			
		КонецЕсли; 
		
		Движение.СсылкаНаДокумент 	= Док;
		Движение.Организация 		= Выборка.Организация;
		
	КонецЦикла;		
	
	
	ВремяСред = ТекущаяДата();
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();	
	
КонецПроцедуры //ВыполнитьДвиженияПоМониторингуРеализацииУПП

// Выполняет движения по мониторингу покупок
// если дополнение встроено в конфигурацию "УПП"
//
Процедура ВыполнитьДвиженияПоМониторингуПокупокУПП(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВидОперацииИмпорт", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ОтСтруктурногоПодразделения);
	Запрос.УстановитьПараметр("ВидОперацииВнутреннееПеремещениеВНТТ", Перечисления.ВидыОперацийПоступлениеТоваровУслугВНТТ.ВнутреннееПеремещение);		
	Запрос.УстановитьПараметр("ВидСубконтоОС", ПланыВидовХарактеристик.ВидыСубконтоТиповые.ОсновныеСредства);
	Запрос.УстановитьПараметр("ВидСубконтоНоменклатура", ПланыВидовХарактеристик.ВидыСубконтоТиповые.Номенклатура);
	Запрос.УстановитьПараметр("ТипНоменклатурыУслуга", Перечисления.ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	               |	МАКСИМУМ(ВложенныйЗапрос.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ВложенныйЗапрос.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ВложенныйЗапрос.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ВложенныйЗапрос.Организация) КАК Организация
	               |ПОМЕСТИТЬ ВТ_ПоступлениеНМА
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеНМА.Ссылка КАК Ссылка,
	               |		ПоступлениеНМА.Дата КАК Дата,
	               |		ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПоступлениеНМА.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПоступлениеНМА.Контрагент КАК Контрагент,
	               |		ПоступлениеНМА.Организация КАК Организация
	               |	ИЗ
	               |		Документ.ПоступлениеНМА КАК ПоступлениеНМА
	               |	ГДЕ
	               |		ПоступлениеНМА.Дата >= &НачДата
	               |		И ПоступлениеНМА.Дата <= &КонДата
	               |		И ПоступлениеНМА.Организация = &Организация
	               |		И ПоступлениеНМА.Проведен
	               |		И ПоступлениеНМА.ОтражатьВБухгалтерскомУчете) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ВложенныйЗапрос.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ПоступлениеНМА)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Дата) КАК Дата,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.Организация) КАК Организация,
	               |	МАКСИМУМ(ПоступлениеТоваровУслуг.ДоговорКонтрагента) КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслуг
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |		ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |		ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |		ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |		ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |	ГДЕ
	               |		ПоступлениеТоваровУслуг.Дата >= &НачДата
	               |		И ПоступлениеТоваровУслуг.Дата <= &КонДата
	               |		И ПоступлениеТоваровУслуг.ВидОперации <> &ВидОперацииИмпорт
	               |		И ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	               |		И ПоступлениеТоваровУслуг.Организация = &Организация
	               |		И ПоступлениеТоваровУслуг.ВидОперации <> &ВидОперацииСтруктурные
	               |		И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете) КАК ПоступлениеТоваровУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ПоступлениеТоваровУслуг.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ПоступлениеТоваровУслуг)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслуг.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НДСЗаНерезидентаОбороты.ДокументПоступления КАК ДокументПоступления,
	               |	НДСЗаНерезидентаОбороты.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_НДСЗаНерезидента
	               |ИЗ
	               |	РегистрНакопления.НДСЗаНерезидента.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Налогоплательщик = &Организация
	               |				И ДокументПоступления В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеТоваровУслуг
	               |			
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |					ВЫБРАТЬ
	               |						ВТ_ПоступлениеНМА.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеНМА)) КАК НДСЗаНерезидентаОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументПоступления,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |	ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	               |	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК СчетУчетаБУ,
	               |	ПоступлениеТоваровУслугТовары.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугТовары
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	               |	ПоступлениеТоваровУслугУслуги.Цена КАК Цена,
	               |	ПоступлениеТоваровУслугУслуги.Количество КАК Количество,
	               |	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугУслуги.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугУслуги.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугУслуги.СчетЗатратБУ
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугУслуги
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |ГДЕ
	               |	ПоступлениеТоваровУслугУслуги.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг)
	               |	И (НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |				(ВЫБРАТЬ
	               |					ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |					ВТ_НДСЗаНерезидента.Номенклатура
	               |				ИЗ
	               |					ВТ_НДСЗаНерезидента))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугОС.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслугОС.ОсновноеСредство КАК ОсновноеСредство,
	               |	ПоступлениеТоваровУслугОС.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеТоваровУслугОС.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеТоваровУслугОС.СчетУчетаБУ КАК Счет,
	               |	ПоступлениеТоваровУслугОС.Сумма КАК Сумма,
	               |	ПоступлениеТоваровУслугОС.СчетУчетаБУ
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугОС
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |ГДЕ
	               |	ПоступлениеТоваровУслугОС.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	СУММА(ВложенныйЗапрос.СуммаПоступленияВсего) КАК СуммаПоступленияВсего
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугСуммаПоступлений
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |		СУММА(ПоступлениеТоваровУслугТовары.Сумма) КАК СуммаПоступленияВсего
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПоступлениеТоваровУслугТовары.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугУслуги.Ссылка,
	               |		СУММА(ПоступлениеТоваровУслугУслуги.Сумма)
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугУслуги КАК ПоступлениеТоваровУслугУслуги
	               |	ГДЕ
	               |		(НЕ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |					(ВЫБРАТЬ
	               |						ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |						ВТ_НДСЗаНерезидента.Номенклатура
	               |					ИЗ
	               |						ВТ_НДСЗаНерезидента))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПоступлениеТоваровУслугУслуги.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугОС.Ссылка,
	               |		СУММА(ПоступлениеТоваровУслугОС.Сумма)
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугОС КАК ПоступлениеТоваровУслугОС
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПоступлениеТоваровУслугОС.Ссылка) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеНМАНМА.НематериальныйАктив,
	               |	ПоступлениеНМАНМА.Сумма,
	               |	ПоступлениеНМАНМА.СтавкаНДС,
	               |	ПоступлениеНМАНМА.СуммаНДС,
	               |	ПоступлениеНМАНМА.СчетУчетаБУ,
	               |	ПоступлениеНМАНМА.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ПоступлениеНМАНМА
	               |ИЗ
	               |	Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
	               |ГДЕ
	               |	ПоступлениеНМАНМА.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ПоступлениеНМА.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеНМА)
	               |	И (НЕ (ПоступлениеНМАНМА.Ссылка, ПоступлениеНМАНМА.НематериальныйАктив) В
	               |				(ВЫБРАТЬ
	               |					ВТ_НДСЗаНерезидента.ДокументПоступления КАК Ссылка,
	               |					ВТ_НДСЗаНерезидента.Номенклатура
	               |				ИЗ
	               |					ВТ_НДСЗаНерезидента))
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ВложенныйЗапрос.Дата) КАК Дата,
	               |	МАКСИМУМ(ВложенныйЗапрос.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ВложенныйЗапрос.Организация) КАК Организация,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДокументОснование) КАК ДокументОснование,
	               |	МАКСИМУМ(ВложенныйЗапрос.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ВложенныйЗапрос.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ВложенныйЗапрос.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(ВложенныйЗапрос.ВалютаДокумента) КАК ВалютаДокумента
	               |ПОМЕСТИТЬ ВТ_ВозвратТоваровПоставщику
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
	               |		ВозвратТоваровПоставщику.Дата КАК Дата,
	               |		ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
	               |		ВозвратТоваровПоставщику.Организация КАК Организация,
	               |		ВозвратТоваровПоставщику.ДокументОснование КАК ДокументОснование,
	               |		ВозвратТоваровПоставщику.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ВозвратТоваровПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВозвратТоваровПоставщику.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ВозвратТоваровПоставщику.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ВозвратТоваровПоставщику.ВалютаДокумента КАК ВалютаДокумента
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	               |	ГДЕ
	               |		ВозвратТоваровПоставщику.Дата >= &НачДата
	               |		И ВозвратТоваровПоставщику.Дата <= &КонДата
	               |		И ВозвратТоваровПоставщику.Организация = &Организация
	               |		И ВозвратТоваровПоставщику.Проведен
	               |		И ВозвратТоваровПоставщику.ОтражатьВБухгалтерскомУчете) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ВложенныйЗапрос.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ВозвратТоваровПоставщику)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеДопРасходов.Ссылка КАК Ссылка,
	               |	&ВалютаРегУчета КАК ВалютаДокумента,
	               |	1 КАК КратностьВзаиморасчетов,
	               |	1 КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ПоступлениеДопРасходов.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ПоступлениеДопРасходов.Дата) КАК Дата,
	               |	МАКСИМУМ(ПоступлениеДопРасходов.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ПоступлениеДопРасходов.Организация) КАК Организация
	               |ПОМЕСТИТЬ ВТ_ПоступлениеДопРасходов
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеДопРасходов.Ссылка КАК Ссылка,
	               |		ПоступлениеДопРасходов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПоступлениеДопРасходов.Дата КАК Дата,
	               |		ПоступлениеДопРасходов.Контрагент КАК Контрагент,
	               |		ПоступлениеДопРасходов.Организация КАК Организация
	               |	ИЗ
	               |		Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	               |	ГДЕ
	               |		ПоступлениеДопРасходов.Дата >= &НачДата
	               |		И ПоступлениеДопРасходов.Дата <= &КонДата
	               |		И ПоступлениеДопРасходов.Организация = &Организация
	               |		И ПоступлениеДопРасходов.Проведен
	               |		И ПоступлениеДопРасходов.ОтражатьВБухгалтерскомУчете) КАК ПоступлениеДопРасходов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ПоступлениеДопРасходов.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ПоступлениеДопРасходов)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеДопРасходов.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОтчетКомиссионераОПродажах.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.Организация) КАК Организация,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.Дата) КАК Дата,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.УслугаПоВознаграждению) КАК УслугаПоВознаграждению,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.СчетУчетаЗатратБУ) КАК СчетУчетаЗатратБУ,
	               |	МАКСИМУМ(ОтчетКомиссионераОПродажах.СтавкаНДСВознаграждения) КАК СтавкаНДСВознаграждения
	               |ПОМЕСТИТЬ ВТ_ОтчетКомиссионераОПродажах
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ОтчетКомиссионераОПродажах.Ссылка КАК Ссылка,
	               |		ОтчетКомиссионераОПродажах.ВалютаДокумента КАК ВалютаДокумента,
	               |		ОтчетКомиссионераОПродажах.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ОтчетКомиссионераОПродажах.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ОтчетКомиссионераОПродажах.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ОтчетКомиссионераОПродажах.Контрагент КАК Контрагент,
	               |		ОтчетКомиссионераОПродажах.Организация КАК Организация,
	               |		ОтчетКомиссионераОПродажах.Дата КАК Дата,
	               |		ОтчетКомиссионераОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ОтчетКомиссионераОПродажах.УслугаПоВознаграждению КАК УслугаПоВознаграждению,
	               |		ОтчетКомиссионераОПродажах.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
	               |		ОтчетКомиссионераОПродажах.СчетУчетаЗатратБУ КАК СчетУчетаЗатратБУ,
	               |		ОтчетКомиссионераОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения
	               |	ИЗ
	               |		Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	               |	ГДЕ
	               |		ОтчетКомиссионераОПродажах.Дата >= &НачДата
	               |		И ОтчетКомиссионераОПродажах.Дата <= &КонДата
	               |		И ОтчетКомиссионераОПродажах.Организация = &Организация
	               |		И ОтчетКомиссионераОПродажах.Проведен
	               |		И ОтчетКомиссионераОПродажах.ОтражатьВБухгалтерскомУчете
	               |		И ОтчетКомиссионераОПродажах.СпособРасчетаКомиссионногоВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКомиссионногоВознаграждения.РазницаСуммПродажиИПокупки)
	               |		И ОтчетКомиссионераОПродажах.СуммаВознаграждения <> 0) КАК ОтчетКомиссионераОПродажах
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ОтчетКомиссионераОПродажах.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ОтчетКомиссионераОПродажах)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтчетКомиссионераОПродажах.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПолучениеУслугПоПереработке.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.Организация) КАК Организация,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.Дата) КАК Дата,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ПолучениеУслугПоПереработке.СчетЗатратБУ) КАК СчетЗатратБУ
	               |ПОМЕСТИТЬ ВТ_ПолучениеУслугПоПереработке
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПолучениеУслугПоПереработке.Ссылка КАК Ссылка,
	               |		ПолучениеУслугПоПереработке.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПолучениеУслугПоПереработке.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПолучениеУслугПоПереработке.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПолучениеУслугПоПереработке.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПолучениеУслугПоПереработке.Контрагент КАК Контрагент,
	               |		ПолучениеУслугПоПереработке.Организация КАК Организация,
	               |		ПолучениеУслугПоПереработке.Дата КАК Дата,
	               |		ПолучениеУслугПоПереработке.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ПолучениеУслугПоПереработке.СчетЗатратБУ КАК СчетЗатратБУ
	               |	ИЗ
	               |		Документ.ПолучениеУслугПоПереработке КАК ПолучениеУслугПоПереработке
	               |	ГДЕ
	               |		ПолучениеУслугПоПереработке.Дата >= &НачДата
	               |		И ПолучениеУслугПоПереработке.Дата <= &КонДата
	               |		И ПолучениеУслугПоПереработке.Организация = &Организация
	               |		И ПолучениеУслугПоПереработке.Проведен
	               |		И ПолучениеУслугПоПереработке.ОтражатьВБухгалтерскомУчете) КАК ПолучениеУслугПоПереработке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ПолучениеУслугПоПереработке.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ПолучениеУслугПоПереработке)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПолучениеУслугПоПереработке.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратТоваровПоставщикуИзНТТ.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.Организация) КАК Организация,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.Дата) КАК Дата,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.СуммаВключаетНДС) КАК СуммаВключаетНДС,
	               |	МАКСИМУМ(ВозвратТоваровПоставщикуИзНТТ.ДокументОснование) КАК ДокументОснование
	               |ПОМЕСТИТЬ ВТ_ВозвратТоваровПоставщикуИзНТТ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуИзНТТ.Ссылка КАК Ссылка,
	               |		ВозвратТоваровПоставщикуИзНТТ.ВалютаДокумента КАК ВалютаДокумента,
	               |		ВозвратТоваровПоставщикуИзНТТ.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ВозвратТоваровПоставщикуИзНТТ.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ВозвратТоваровПоставщикуИзНТТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВозвратТоваровПоставщикуИзНТТ.Контрагент КАК Контрагент,
	               |		ВозвратТоваровПоставщикуИзНТТ.Организация КАК Организация,
	               |		ВозвратТоваровПоставщикуИзНТТ.Дата КАК Дата,
	               |		ВозвратТоваровПоставщикуИзНТТ.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |		ВозвратТоваровПоставщикуИзНТТ.ДокументОснование КАК ДокументОснование
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщикуИзНТТ КАК ВозвратТоваровПоставщикуИзНТТ
	               |	ГДЕ
	               |		ВозвратТоваровПоставщикуИзНТТ.Дата >= &НачДата
	               |		И ВозвратТоваровПоставщикуИзНТТ.Дата <= &КонДата
	               |		И ВозвратТоваровПоставщикуИзНТТ.Организация = &Организация
	               |		И ВозвратТоваровПоставщикуИзНТТ.Проведен
	               |		И ВозвратТоваровПоставщикуИзНТТ.ОтражатьВБухгалтерскомУчете) КАК ВозвратТоваровПоставщикуИзНТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ВозвратТоваровПоставщикуИзНТТ.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ВозвратТоваровПоставщикуИзНТТ)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВозвратТоваровПоставщикуИзНТТ.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугВНТТ.Ссылка КАК Ссылка,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.ВалютаДокумента) КАК ВалютаДокумента,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.КратностьВзаиморасчетов) КАК КратностьВзаиморасчетов,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.КурсВзаиморасчетов) КАК КурсВзаиморасчетов,
	               |	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка) КАК СчетФактура,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.Контрагент) КАК Контрагент,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.Организация) КАК Организация,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.Дата) КАК Дата,
	               |	МАКСИМУМ(ПоступлениеТоваровУслугВНТТ.СуммаВключаетНДС) КАК СуммаВключаетНДС
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслугВНТТ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугВНТТ.Ссылка КАК Ссылка,
	               |		ПоступлениеТоваровУслугВНТТ.ВалютаДокумента КАК ВалютаДокумента,
	               |		ПоступлениеТоваровУслугВНТТ.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ПоступлениеТоваровУслугВНТТ.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |		ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ПоступлениеТоваровУслугВНТТ.Контрагент КАК Контрагент,
	               |		ПоступлениеТоваровУслугВНТТ.Организация КАК Организация,
	               |		ПоступлениеТоваровУслугВНТТ.Дата КАК Дата,
	               |		ПоступлениеТоваровУслугВНТТ.СуммаВключаетНДС КАК СуммаВключаетНДС
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслугВНТТ КАК ПоступлениеТоваровУслугВНТТ
	               |	ГДЕ
	               |		ПоступлениеТоваровУслугВНТТ.Дата >= &НачДата
	               |		И ПоступлениеТоваровУслугВНТТ.Дата <= &КонДата
	               |		И ПоступлениеТоваровУслугВНТТ.Организация = &Организация
	               |		И ПоступлениеТоваровУслугВНТТ.Проведен
	               |		И ПоступлениеТоваровУслугВНТТ.ОтражатьВБухгалтерскомУчете
	               |		И ПоступлениеТоваровУслугВНТТ.ВидОперации <> &ВидОперацииВнутреннееПеремещениеВНТТ) КАК ПоступлениеТоваровУслугВНТТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	               |		ПО (ПоступлениеТоваровУслугВНТТ.Ссылка = (ВЫРАЗИТЬ(СчетФактураПолученныйДокументыОснования.ДокументОснование КАК Документ.ПоступлениеТоваровУслугВНТТ)))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоступлениеТоваровУслугВНТТ.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АвансовыйОтчет.Ссылка КАК Ссылка,
	               |	АвансовыйОтчет.ВалютаДокумента,
	               |	АвансовыйОтчет.КратностьДокумента,
	               |	АвансовыйОтчет.КурсДокумента,
	               |	АвансовыйОтчет.Дата,
	               |	АвансовыйОтчет.СуммаВключаетНДС,
	               |	АвансовыйОтчет.Организация
	               |ПОМЕСТИТЬ ВТ_АвансовыйОтчет
	               |ИЗ
	               |	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	               |ГДЕ
	               |	АвансовыйОтчет.Дата >= &НачДата
	               |	И АвансовыйОтчет.Дата <= &КонДата
	               |	И АвансовыйОтчет.Организация = &Организация
	               |	И АвансовыйОтчет.Проведен
	               |	И АвансовыйОтчет.ОтражатьВБухгалтерскомУчете
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.СсылкаНаДокумент КАК СсылкаНаДокумент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.СтавкаНДС,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.Счет,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.ОснованиеВозврата,
	               |	ВложенныйЗапрос.Сумма КАК Сумма,
	               |	ЕСТЬNULL(ВложенныйЗапрос.СуммаИПН, 0) КАК СуммаИПН,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.ВалютаДокумента КАК ВалютаДокумента,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КратностьВзаиморасчетов, 0) КАК КратностьВзаиморасчетов,
	               |	ЕСТЬNULL(ВложенныйЗапрос.КурсВзаиморасчетов, 0) КАК КурсВзаиморасчетов,
	               |	ВложенныйЗапрос.СчетФактура,
	               |	моп_ОбъектыМониторинга.ПинКод,
	               |	ВЫБОР
	               |		КОГДА (НЕ ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL )
	               |				И ВложенныйЗапрос.Контрагент.Ссылка <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				И (ВложенныйЗапрос.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	               |					И (НЕ ВложенныйЗапрос.Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус))
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВложенныйЗапрос.Контрагент.Ссылка ЕСТЬ NULL 
	               |				ИЛИ ВложенныйЗапрос.Контрагент.Ссылка = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК КонтрагентЯвляетсяЧастнымЛицом
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугТовары.Ссылка КАК СсылкаНаДокумент,
	               |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |		ВТ_ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |		ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	               |		ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	               |		ПоступлениеТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	               |		ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК Счет,
	               |		ВТ_ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |		0 КАК ОснованиеВозврата,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |		КОНЕЦ КАК Сумма,
	               |		Налоги.СуммаИПНВсего * ПоступлениеТоваровУслугТовары.Сумма / Поступления.СуммаПоступленияВсего КАК СуммаИПН,
	               |		ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения,
	               |		ВТ_ПоступлениеТоваровУслуг.СчетФактура КАК СчетФактура,
	               |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугТовары КАК ПоступлениеТоваровУслугТовары
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК СуммаИПНВсего
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг)
	               |				И РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.Проведен
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугСуммаПоступлений КАК Поступления
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = Поступления.Ссылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |			ПО ПоступлениеТоваровУслугТовары.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугУслуги.Ссылка,
	               |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |		ВТ_ПоступлениеТоваровУслуг.Организация,
	               |		ПоступлениеТоваровУслугУслуги.Номенклатура,
	               |		ПоступлениеТоваровУслугУслуги.Цена,
	               |		ПоступлениеТоваровУслугУслуги.Количество,
	               |		ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	               |		ПоступлениеТоваровУслугУслуги.СуммаНДС,
	               |		ПоступлениеТоваровУслугУслуги.СчетЗатратБУ,
	               |		ПоступлениеТоваровУслугУслуги.Ссылка.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеТоваровУслугУслуги.Сумма / Поступления.СуммаПоступленияВсего,
	               |		NULL,
	               |		ВТ_ПоступлениеТоваровУслуг.СчетФактура,
	               |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугУслуги КАК ПоступлениеТоваровУслугУслуги
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугСуммаПоступлений КАК Поступления
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг)
	               |				И РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.Проведен
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |			ПО ПоступлениеТоваровУслугУслуги.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугОС.Ссылка.Ссылка,
	               |		ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |		ВТ_ПоступлениеТоваровУслуг.Организация,
	               |		ПоступлениеТоваровУслугОС.ОсновноеСредство,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ПоступлениеТоваровУслугОС.СтавкаНДС,
	               |		ПоступлениеТоваровУслугОС.СуммаНДС,
	               |		ПоступлениеТоваровУслугОС.СчетУчетаБУ,
	               |		ВТ_ПоступлениеТоваровУслуг.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеТоваровУслугОС.Сумма / Поступления.СуммаПоступленияВсего,
	               |		NULL,
	               |		ВТ_ПоступлениеТоваровУслуг.СчетФактура,
	               |		ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов
	               |	ИЗ
	               |		ВТ_ПоступлениеТоваровУслугОС КАК ПоступлениеТоваровУслугОС
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугСуммаПоступлений КАК Поступления
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеТоваровУслуг)
	               |				И РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.Проведен
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |			ПО ПоступлениеТоваровУслугОС.Ссылка = ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеДопРасходов.Ссылка,
	               |		ПоступлениеДопРасходов.ДоговорКонтрагента,
	               |		ПоступлениеДопРасходов.Контрагент,
	               |		ПоступлениеДопРасходов.Организация,
	               |		ТиповойДвиженияССубконто.СубконтоДт1,
	               |		ТиповойДвиженияССубконто.Сумма,
	               |		0,
	               |		НДСКВозмещению.СтавкаНДС,
	               |		ЕСТЬNULL(НДСКВозмещению.УплаченныйНДС, 0),
	               |		ТиповойДвиженияССубконто.СчетДт,
	               |		ПоступлениеДопРасходов.Дата,
	               |		0,
	               |		ТиповойДвиженияССубконто.Сумма,
	               |		NULL,
	               |		NULL,
	               |		ПоступлениеДопРасходов.СчетФактура,
	               |		ПоступлениеДопРасходов.ВалютаДокумента,
	               |		ПоступлениеДопРасходов.КратностьВзаиморасчетов,
	               |		ПоступлениеДопРасходов.КурсВзаиморасчетов
	               |	ИЗ
	               |		ВТ_ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ТиповойДвиженияССубконто.Регистратор КАК Регистратор,
	               |				ТиповойДвиженияССубконто.СчетДт КАК СчетДт,
	               |				ТиповойДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |				ТиповойДвиженияССубконто.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	               |				СУММА(ТиповойДвиженияССубконто.Сумма) КАК Сумма
	               |			ИЗ
	               |				РегистрБухгалтерии.Типовой.ДвиженияССубконто(
	               |						,
	               |						,
	               |						(ВидСубконтоДт1 = &ВидСубконтоОС
	               |							ИЛИ ВидСубконтоДт1 = &ВидСубконтоНоменклатура)
	               |							И ВЫРАЗИТЬ(Регистратор КАК Документ.ПоступлениеДопРасходов) В
	               |								(ВЫБРАТЬ
	               |									ВТ_ПоступлениеДопРасходов.Ссылка
	               |								ИЗ
	               |									ВТ_ПоступлениеДопРасходов)) КАК ТиповойДвиженияССубконто
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ТиповойДвиженияССубконто.ВидСубконтоДт1,
	               |				ТиповойДвиженияССубконто.Регистратор,
	               |				ТиповойДвиженияССубконто.СубконтоДт1,
	               |				ТиповойДвиженияССубконто.СчетДт) КАК ТиповойДвиженияССубконто
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					НДСКВозмещению.Регистратор КАК Регистратор,
	               |					НДСКВозмещению.СтавкаНДС КАК СтавкаНДС,
	               |					СУММА(НДСКВозмещению.УплаченныйНДС) КАК УплаченныйНДС,
	               |					НДСКВозмещению.ТМЗ КАК ТМЗ
	               |				ИЗ
	               |					РегистрНакопления.НДСКВозмещению КАК НДСКВозмещению
	               |				ГДЕ
	               |					ВЫРАЗИТЬ(НДСКВозмещению.Регистратор КАК Документ.ПоступлениеДопРасходов) В
	               |							(ВЫБРАТЬ
	               |								ВТ_ПоступлениеДопРасходов.Ссылка
	               |							ИЗ
	               |								ВТ_ПоступлениеДопРасходов)
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					НДСКВозмещению.Регистратор,
	               |					НДСКВозмещению.ТМЗ,
	               |					НДСКВозмещению.СтавкаНДС) КАК НДСКВозмещению
	               |				ПО ТиповойДвиженияССубконто.СубконтоДт1 = НДСКВозмещению.ТМЗ
	               |					И ТиповойДвиженияССубконто.Регистратор = НДСКВозмещению.Регистратор
	               |			ПО (ПоступлениеДопРасходов.Ссылка = (ВЫРАЗИТЬ(ТиповойДвиженияССубконто.Регистратор КАК Документ.ПоступлениеДопРасходов)))
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуТовары.Ссылка,
	               |		ВТ_ВозвратТоваровПоставщику.ДоговорКонтрагента,
	               |		ВТ_ВозвратТоваровПоставщику.Контрагент,
	               |		ВТ_ВозвратТоваровПоставщику.Организация,
	               |		ВозвратТоваровПоставщикуТовары.Номенклатура,
	               |		ВозвратТоваровПоставщикуТовары.Цена,
	               |		ВозвратТоваровПоставщикуТовары.Количество,
	               |		ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуТовары.СуммаНДС,
	               |		ВозвратТоваровПоставщикуТовары.СчетУчетаБУ,
	               |		ВТ_ВозвратТоваровПоставщику.Дата,
	               |		ВТ_ВозвратТоваровПоставщику.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуТовары.Сумма - ВозвратТоваровПоставщикуТовары.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуТовары.Сумма
	               |		КОНЕЦ,
	               |		NULL,
	               |		ВозвратТоваровПоставщикуТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	               |		ВТ_ВозвратТоваровПоставщику.СчетФактура,
	               |		ВТ_ВозвратТоваровПоставщику.ВалютаДокумента,
	               |		ВТ_ВозвратТоваровПоставщику.КратностьВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВозвратТоваровПоставщику КАК ВТ_ВозвратТоваровПоставщику
	               |			ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВТ_ВозвратТоваровПоставщику.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеНМАНМА.Ссылка,
	               |		ВТ_ПоступлениеНМА.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеНМА.Контрагент,
	               |		ВТ_ПоступлениеНМА.Организация,
	               |		ПоступлениеНМАНМА.НематериальныйАктив,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ПоступлениеНМАНМА.СтавкаНДС,
	               |		ПоступлениеНМАНМА.СуммаНДС,
	               |		ПоступлениеНМАНМА.СчетУчетаБУ,
	               |		ВТ_ПоступлениеНМА.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |			ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |		КОНЕЦ,
	               |		Налоги.Налог * ПоступлениеНМАНМА.Сумма / Поступления.Сумма,
	               |		NULL,
	               |		ВТ_ПоступлениеНМА.СчетФактура,
	               |		ВТ_ПоступлениеНМА.ВалютаДокумента,
	               |		ВТ_ПоступлениеНМА.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеНМА.КурсВзаиморасчетов
	               |	ИЗ
	               |		ВТ_ПоступлениеНМАНМА КАК ПоступлениеНМАНМА
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ПоступлениеНМАНМА.Ссылка КАК Ссылка,
	               |				СУММА(ПоступлениеНМАНМА.Сумма) КАК Сумма
	               |			ИЗ
	               |				ВТ_ПоступлениеНМАНМА КАК ПоступлениеНМАНМА
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ПоступлениеНМАНМА.Ссылка) КАК Поступления
	               |			ПО ПоступлениеНМАНМА.Ссылка = Поступления.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка,
	               |				СУММА(РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Налог) КАК Налог
	               |			ИЗ
	               |				Документ.РасчетНалоговПриПоступленииАктивовУслуг.ИсчисленныйИПН КАК РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН
	               |			ГДЕ
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование В
	               |						(ВЫБРАТЬ
	               |							ВТ_ПоступлениеНМА.Ссылка
	               |						ИЗ
	               |							ВТ_ПоступлениеНМА)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				РасчетНалоговПриПоступленииАктивовУслугИсчисленныйИПН.Ссылка.ДокументОснование.Ссылка) КАК Налоги
	               |			ПО ПоступлениеНМАНМА.Ссылка = Налоги.ДокументОснованиеСсылка
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеНМА КАК ВТ_ПоступлениеНМА
	               |			ПО ПоступлениеНМАНМА.Ссылка = ВТ_ПоступлениеНМА.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АвансовыйОтчетТовары.Ссылка,
	               |		АвансовыйОтчетТовары.СчетФактура.ДоговорКонтрагента,
	               |		АвансовыйОтчетТовары.Поставщик,
	               |		ВТ_АвансовыйОтчет.Организация,
	               |		АвансовыйОтчетТовары.Номенклатура,
	               |		АвансовыйОтчетТовары.Цена,
	               |		АвансовыйОтчетТовары.Количество,
	               |		АвансовыйОтчетТовары.СтавкаНДС,
	               |		АвансовыйОтчетТовары.СуммаНДС,
	               |		АвансовыйОтчетТовары.СчетУчетаБУ,
	               |		ВТ_АвансовыйОтчет.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_АвансовыйОтчет.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетТовары.Сумма - АвансовыйОтчетТовары.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетТовары.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		АвансовыйОтчетТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	               |		АвансовыйОтчетТовары.СчетФактура,
	               |		ВТ_АвансовыйОтчет.ВалютаДокумента,
	               |		ВТ_АвансовыйОтчет.КратностьДокумента,
	               |		ВТ_АвансовыйОтчет.КурсДокумента
	               |	ИЗ
	               |		Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АвансовыйОтчет КАК ВТ_АвансовыйОтчет
	               |			ПО АвансовыйОтчетТовары.Ссылка = ВТ_АвансовыйОтчет.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугВНТТТовары.Ссылка,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.Контрагент,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.Организация,
	               |		ПоступлениеТоваровУслугВНТТТовары.Номенклатура,
	               |		ПоступлениеТоваровУслугВНТТТовары.Цена,
	               |		ПоступлениеТоваровУслугВНТТТовары.Количество,
	               |		ПоступлениеТоваровУслугВНТТТовары.СтавкаНДС,
	               |		ПоступлениеТоваровУслугВНТТТовары.СуммаНДС,
	               |		ПоступлениеТоваровУслугВНТТТовары.СчетУчетаБУ,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПоступлениеТоваровУслугВНТТ.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугВНТТТовары.Сумма - ПоступлениеТоваровУслугВНТТТовары.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугВНТТТовары.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		ПоступлениеТоваровУслугВНТТТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.СчетФактура,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслугВНТТ.Товары КАК ПоступлениеТоваровУслугВНТТТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугВНТТ КАК ВТ_ПоступлениеТоваровУслугВНТТ
	               |			ПО ПоступлениеТоваровУслугВНТТТовары.Ссылка = ВТ_ПоступлениеТоваровУслугВНТТ.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПоступлениеТоваровУслугВНТТУслуги.Ссылка,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.ДоговорКонтрагента,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.Контрагент,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.Организация,
	               |		ПоступлениеТоваровУслугВНТТУслуги.Номенклатура,
	               |		ПоступлениеТоваровУслугВНТТУслуги.Цена,
	               |		ПоступлениеТоваровУслугВНТТУслуги.Количество,
	               |		ПоступлениеТоваровУслугВНТТУслуги.СтавкаНДС,
	               |		ПоступлениеТоваровУслугВНТТУслуги.СуммаНДС,
	               |		ПоступлениеТоваровУслугВНТТУслуги.СчетЗатратБУ,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ПоступлениеТоваровУслугВНТТУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПоступлениеТоваровУслугВНТТУслуги.Сумма - ПоступлениеТоваровУслугВНТТУслуги.СуммаНДС
	               |			ИНАЧЕ ПоступлениеТоваровУслугВНТТУслуги.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		NULL,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.СчетФактура,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.ВалютаДокумента,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.КратностьВзаиморасчетов,
	               |		ВТ_ПоступлениеТоваровУслугВНТТ.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ПоступлениеТоваровУслугВНТТ.Услуги КАК ПоступлениеТоваровУслугВНТТУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступлениеТоваровУслугВНТТ КАК ВТ_ПоступлениеТоваровУслугВНТТ
	               |			ПО ПоступлениеТоваровУслугВНТТУслуги.Ссылка = ВТ_ПоступлениеТоваровУслугВНТТ.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуИзНТТТовары.Ссылка,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.ДоговорКонтрагента,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.Контрагент,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.Организация,
	               |		ВозвратТоваровПоставщикуИзНТТТовары.Номенклатура,
	               |		ВозвратТоваровПоставщикуИзНТТТовары.Цена,
	               |		ВозвратТоваровПоставщикуИзНТТТовары.Количество,
	               |		ВозвратТоваровПоставщикуИзНТТТовары.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуИзНТТТовары.СуммаНДС,
	               |		ВозвратТоваровПоставщикуИзНТТТовары.СчетУчетаБУ,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.Дата,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВТ_ВозвратТоваровПоставщикуИзНТТ.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуИзНТТТовары.Сумма - ВозвратТоваровПоставщикуИзНТТТовары.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуИзНТТТовары.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		ВозвратТоваровПоставщикуИзНТТТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.СчетФактура,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.ВалютаДокумента,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.КратностьВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщикуИзНТТ.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщикуИзНТТ.Товары КАК ВозвратТоваровПоставщикуИзНТТТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВозвратТоваровПоставщикуИзНТТ КАК ВТ_ВозвратТоваровПоставщикуИзНТТ
	               |			ПО ВозвратТоваровПоставщикуИзНТТТовары.Ссылка = ВТ_ВозвратТоваровПоставщикуИзНТТ.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПолучениеУслугПоПереработкеТовары.Ссылка,
	               |		ВТ_ПолучениеУслугПоПереработке.ДоговорКонтрагента,
	               |		ВТ_ПолучениеУслугПоПереработке.Контрагент,
	               |		ВТ_ПолучениеУслугПоПереработке.Организация,
	               |		ПолучениеУслугПоПереработкеТовары.Номенклатура,
	               |		ПолучениеУслугПоПереработкеТовары.Цена,
	               |		ПолучениеУслугПоПереработкеТовары.Количество,
	               |		ПолучениеУслугПоПереработкеТовары.СтавкаНДС,
	               |		ПолучениеУслугПоПереработкеТовары.СуммаНДС,
	               |		ВТ_ПолучениеУслугПоПереработке.СчетЗатратБУ,
	               |		ВТ_ПолучениеУслугПоПереработке.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПолучениеУслугПоПереработке.СуммаВключаетНДС
	               |				ТОГДА ПолучениеУслугПоПереработкеТовары.Сумма - ПолучениеУслугПоПереработкеТовары.СуммаНДС
	               |			ИНАЧЕ ПолучениеУслугПоПереработкеТовары.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		ПолучениеУслугПоПереработкеТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору,
	               |		ВТ_ПолучениеУслугПоПереработке.СчетФактура,
	               |		ВТ_ПолучениеУслугПоПереработке.ВалютаДокумента,
	               |		ВТ_ПолучениеУслугПоПереработке.КратностьВзаиморасчетов,
	               |		ВТ_ПолучениеУслугПоПереработке.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ПолучениеУслугПоПереработке.Товары КАК ПолучениеУслугПоПереработкеТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПолучениеУслугПоПереработке КАК ВТ_ПолучениеУслугПоПереработке
	               |			ПО ПолучениеУслугПоПереработкеТовары.Ссылка = ВТ_ПолучениеУслугПоПереработке.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПолучениеУслугПоПереработкеУслуги.Ссылка,
	               |		ВТ_ПолучениеУслугПоПереработке.ДоговорКонтрагента,
	               |		ВТ_ПолучениеУслугПоПереработке.Контрагент,
	               |		ВТ_ПолучениеУслугПоПереработке.Организация,
	               |		ПолучениеУслугПоПереработкеУслуги.Номенклатура,
	               |		ПолучениеУслугПоПереработкеУслуги.Цена,
	               |		ПолучениеУслугПоПереработкеУслуги.Количество,
	               |		ПолучениеУслугПоПереработкеУслуги.СтавкаНДС,
	               |		ПолучениеУслугПоПереработкеУслуги.СуммаНДС,
	               |		ПолучениеУслугПоПереработкеУслуги.СчетЗатратБУ,
	               |		ВТ_ПолучениеУслугПоПереработке.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ПолучениеУслугПоПереработке.СуммаВключаетНДС
	               |				ТОГДА ПолучениеУслугПоПереработкеУслуги.Сумма - ПолучениеУслугПоПереработкеУслуги.СуммаНДС
	               |			ИНАЧЕ ПолучениеУслугПоПереработкеУслуги.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		NULL,
	               |		ВТ_ПолучениеУслугПоПереработке.СчетФактура,
	               |		ВТ_ПолучениеУслугПоПереработке.ВалютаДокумента,
	               |		ВТ_ПолучениеУслугПоПереработке.КратностьВзаиморасчетов,
	               |		ВТ_ПолучениеУслугПоПереработке.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ПолучениеУслугПоПереработке.Услуги КАК ПолучениеУслугПоПереработкеУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПолучениеУслугПоПереработке КАК ВТ_ПолучениеУслугПоПереработке
	               |			ПО ПолучениеУслугПоПереработкеУслуги.Ссылка = ВТ_ПолучениеУслугПоПереработке.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ОтчетКомиссионераОПродажахТовары.Ссылка,
	               |		ВТ_ОтчетКомиссионераОПродажах.ДоговорКонтрагента,
	               |		ВТ_ОтчетКомиссионераОПродажах.Контрагент,
	               |		ВТ_ОтчетКомиссионераОПродажах.Организация,
	               |		ВТ_ОтчетКомиссионераОПродажах.УслугаПоВознаграждению,
	               |		ВЫБОР
	               |			КОГДА ВТ_ОтчетКомиссионераОПродажах.СуммаВключаетНДС
	               |				ТОГДА ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения - ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения
	               |			ИНАЧЕ ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения
	               |		КОНЕЦ,
	               |		1,
	               |		ВТ_ОтчетКомиссионераОПродажах.СтавкаНДСВознаграждения,
	               |		ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения,
	               |		ВТ_ОтчетКомиссионераОПродажах.СчетУчетаЗатратБУ,
	               |		ВТ_ОтчетКомиссионераОПродажах.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_ОтчетКомиссионераОПродажах.СуммаВключаетНДС
	               |				ТОГДА ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения - ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения
	               |			ИНАЧЕ ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения
	               |		КОНЕЦ,
	               |		0,
	               |		NULL,
	               |		ВТ_ОтчетКомиссионераОПродажах.СчетФактура,
	               |		ВТ_ОтчетКомиссионераОПродажах.ВалютаДокумента,
	               |		ВТ_ОтчетКомиссионераОПродажах.КратностьВзаиморасчетов,
	               |		ВТ_ОтчетКомиссионераОПродажах.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ОтчетКомиссионераОПродажах.Товары КАК ОтчетКомиссионераОПродажахТовары
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтчетКомиссионераОПродажах КАК ВТ_ОтчетКомиссионераОПродажах
	               |			ПО ОтчетКомиссионераОПродажахТовары.Ссылка = ВТ_ОтчетКомиссионераОПродажах.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АвансовыйОтчетПрочее.Ссылка,
	               |		АвансовыйОтчетПрочее.СчетФактура.ДоговорКонтрагента,
	               |		АвансовыйОтчетПрочее.Поставщик,
	               |		ВТ_АвансовыйОтчет.Организация,
	               |		АвансовыйОтчетПрочее.Номенклатура,
	               |		ВЫБОР
	               |			КОГДА ВТ_АвансовыйОтчет.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетПрочее.Сумма - АвансовыйОтчетПрочее.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетПрочее.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		АвансовыйОтчетПрочее.СтавкаНДС,
	               |		АвансовыйОтчетПрочее.СуммаНДС,
	               |		АвансовыйОтчетПрочее.СчетЗатратБУ,
	               |		ВТ_АвансовыйОтчет.Дата,
	               |		0,
	               |		ВЫБОР
	               |			КОГДА ВТ_АвансовыйОтчет.СуммаВключаетНДС
	               |				ТОГДА АвансовыйОтчетПрочее.Сумма - АвансовыйОтчетПрочее.СуммаНДС
	               |			ИНАЧЕ АвансовыйОтчетПрочее.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		NULL,
	               |		АвансовыйОтчетПрочее.СчетФактура,
	               |		ВТ_АвансовыйОтчет.ВалютаДокумента,
	               |		ВТ_АвансовыйОтчет.КратностьДокумента,
	               |		ВТ_АвансовыйОтчет.КурсДокумента
	               |	ИЗ
	               |		Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчетПрочее
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АвансовыйОтчет КАК ВТ_АвансовыйОтчет
	               |			ПО АвансовыйОтчетПрочее.Ссылка = ВТ_АвансовыйОтчет.Ссылка
	               |	ГДЕ
	               |		АвансовыйОтчетПрочее.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |		И АвансовыйОтчетПрочее.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = &ТипНоменклатурыУслуга
				   |
				   |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВозвратТоваровПоставщикуУслуги.Ссылка,
	               |		ВТ_ВозвратТоваровПоставщику.ДоговорКонтрагента,
	               |		ВТ_ВозвратТоваровПоставщику.Контрагент,
	               |		ВТ_ВозвратТоваровПоставщику.Организация,
	               |		ВозвратТоваровПоставщикуУслуги.Номенклатура,
	               |		ВозвратТоваровПоставщикуУслуги.Цена,
	               |		ВозвратТоваровПоставщикуУслуги.Количество,
	               |		ВозвратТоваровПоставщикуУслуги.СтавкаНДС,
	               |		ВозвратТоваровПоставщикуУслуги.СуммаНДС,
	               |		ВозвратТоваровПоставщикуУслуги.СчетЗатратБУ,
	               |		ВТ_ВозвратТоваровПоставщику.Дата,
	               |		ВТ_ВозвратТоваровПоставщику.ДокументОснование,
	               |		ВЫБОР
	               |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
	               |				ТОГДА ВозвратТоваровПоставщикуУслуги.Сумма - ВозвратТоваровПоставщикуУслуги.СуммаНДС
	               |			ИНАЧЕ ВозвратТоваровПоставщикуУслуги.Сумма
	               |		КОНЕЦ,
	               |		0,
	               |		NULL,
	               |		ВТ_ВозвратТоваровПоставщику.СчетФактура,
	               |		ВТ_ВозвратТоваровПоставщику.ВалютаДокумента,
	               |		ВТ_ВозвратТоваровПоставщику.КратностьВзаиморасчетов,
	               |		ВТ_ВозвратТоваровПоставщику.КурсВзаиморасчетов
	               |	ИЗ
	               |		Документ.ВозвратТоваровПоставщику.Услуги КАК ВозвратТоваровПоставщикуУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВозвратТоваровПоставщику КАК ВТ_ВозвратТоваровПоставщику
	               |			ПО ВозвратТоваровПоставщикуУслуги.Ссылка = ВТ_ВозвратТоваровПоставщику.Ссылка ";					   			
				   
				   // Табличная часть "ОС" появилась в УПП в релизе 1.0.18
				   Если Метаданные.Документы.ВозвратТоваровПоставщику.ТабличныеЧасти.Найти("ОС") <> Неопределено Тогда
					   Запрос.Текст = Запрос.Текст + " ОБЪЕДИНИТЬ ВСЕ
					   |	
					   |	ВЫБРАТЬ
					   |		ВозвратТоваровПоставщикуОС.Ссылка,
					   |		ВТ_ВозвратТоваровПоставщику.ДоговорКонтрагента,
					   |		ВТ_ВозвратТоваровПоставщику.Контрагент,
					   |		ВТ_ВозвратТоваровПоставщику.Организация,
					   |		ВозвратТоваровПоставщикуОС.ОсновноеСредство,
					   |		ВЫБОР
					   |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
					   |				ТОГДА ВозвратТоваровПоставщикуОС.Сумма - ВозвратТоваровПоставщикуОС.СуммаНДС
					   |			ИНАЧЕ ВозвратТоваровПоставщикуОС.Сумма
					   |		КОНЕЦ,
					   |		1,
					   |		ВозвратТоваровПоставщикуОС.СтавкаНДС,
					   |		ВозвратТоваровПоставщикуОС.СуммаНДС,
					   |		ВозвратТоваровПоставщикуОС.СчетУчетаБУ,
					   |		ВТ_ВозвратТоваровПоставщику.Дата,
					   |		ВТ_ВозвратТоваровПоставщику.ДокументОснование,
					   |		ВЫБОР
					   |			КОГДА ВТ_ВозвратТоваровПоставщику.СуммаВключаетНДС
					   |				ТОГДА ВозвратТоваровПоставщикуОС.Сумма - ВозвратТоваровПоставщикуОС.СуммаНДС
					   |			ИНАЧЕ ВозвратТоваровПоставщикуОС.Сумма
					   |		КОНЕЦ,
					   |		0,
					   |		NULL,
					   |		ВТ_ВозвратТоваровПоставщику.СчетФактура,
					   |		ВТ_ВозвратТоваровПоставщику.ВалютаДокумента,
					   |		ВТ_ВозвратТоваровПоставщику.КратностьВзаиморасчетов,
					   |		ВТ_ВозвратТоваровПоставщику.КурсВзаиморасчетов
					   |	ИЗ
					   |		Документ.ВозвратТоваровПоставщику.ОС КАК ВозвратТоваровПоставщикуОС
					   |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВозвратТоваровПоставщику КАК ВТ_ВозвратТоваровПоставщику
					   |			ПО ВозвратТоваровПоставщикуОС.Ссылка = ВТ_ВозвратТоваровПоставщику.Ссылка ";
					   
				   КонецЕсли;
					   Запрос.Текст = Запрос.Текст + " ) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СсылкаНаДокумент,
	               |	Номенклатура,
	               |	Контрагент,
	               |	Сумма";					   			

	Выборка = Запрос.Выполнить().Выбрать();
		
	НаборЗаписей = РегистрыНакопления.моп_МониторингПокупок.СоздатьНаборЗаписей();

	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	ДоступенРеквизитОсновнойСчетФактура = ?(Метаданные.Документы.СчетФактураПолученный.Реквизиты.Найти("ОсновнойСчетФактура") = Неопределено, Ложь, Истина);

	ИспользоватьДанныеИзДополнительныхСчетовФактур = моп_Общий.ИспользоватьДанныеИзДополнительныхСчетовФактур(ДанныеДокумента.Дата);
	Если ИспользоватьДанныеИзДополнительныхСчетовФактур = Неопределено Тогда
		ИспользоватьДанныеИзДополнительныхСчетовФактур = Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.СсылкаНаДокумент;
		
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;
		Движение.Счет 				= Выборка.Счет;
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.КодТНВЭД     		= Выборка.КодТНВЭД;
		Движение.Контрагент 		= Выборка.Контрагент;	
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		Движение.СчетФактура 		= Выборка.СчетФактура;		
		Движение.ПинКод				= Выборка.ПинКод;
				
		Если ЗначениеЗаполнено(Движение.СчетФактура) Тогда				
			Движение.СчетФактураЯвляетсяДополнительным = Движение.СчетФактура.Дополнительная;
			Если ДоступенРеквизитОсновнойСчетФактура Тогда				
				Движение.СчетФактураКорректируемый = Движение.СчетФактура.ОсновнойСчетФактура;				
			КонецЕсли;						
		КонецЕсли;			
						
		ДанныеКурсаВалюты = ОбщегоНазначения.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Выборка.Дата);		
		
		Если ИспользоватьДанныеИзДополнительныхСчетовФактур и ЗначениеЗаполнено(Движение.СчетФактура) и Движение.СчетФактураЯвляетсяДополнительным Тогда
			ЗаполнитьДанныеИзДополнительногоСчетаФактуры(Движение.СчетФактура, Движение, Выборка, ДанныеКурсаВалюты, ВалютаРегламентированногоУчета);
		Иначе
			
			Движение.Количество 		= Выборка.Количество;
			
			Движение.СуммаБезНалогов 	= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, 
			Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
			Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
			Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
			
			Движение.Акциз 				= 0;
			
			Движение.СуммаНДС 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, 
			Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
			Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
			Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
			
		КонецЕсли;
		
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);
		Движение.СтавкаНДС 			= Выборка.СтавкаНДС;

		Если Не ЗначениеЗаполнено(Движение.СчетФактураКорректируемый) и ЗначениеЗаполнено(Выборка.ОснованиеВозврата) Тогда
				Движение.СчетФактураКорректируемый = ОбщегоНазначения.НайтиПодчиненныйДокумент(Выборка.ОснованиеВозврата, "СчетФактураПолученный");
		КонецЕсли; 
		
		Движение.СсылкаНаДокумент 	= Док;
		Движение.Организация 		= Выборка.Организация;
		
		Движение.СуммаИПН 			= ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(Выборка.СуммаИПН, 
		Выборка.ВалютаДокумента, ВалютаРегламентированногоУчета,
		Выборка.КурсВзаиморасчетов, ДанныеКурсаВалюты.Курс,
		Выборка.КратностьВзаиморасчетов, ДанныеКурсаВалюты.Кратность);				
		
		Движение.Организация 		= Выборка.Организация;
		Движение.КонтрагентЯвляетсяЧастнымЛицом = Выборка.КонтрагентЯвляетсяЧастнымЛицом;
			
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);	
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу импорта
//
Процедура ВыполнитьДвиженияПоМониторингуИмпортаУПП(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("Импорт", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Импорт);	
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеНМА.Ссылка КАК Ссылка,
	               |	ПоступлениеНМА.Дата КАК Дата,
	               |	ПоступлениеНМА.Контрагент КАК Контрагент,
	               |	ПоступлениеНМА.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ПоступлениеНМА.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ПоступлениеНМА.ВалютаДокумента КАК ВалютаДокумента,
	               |	ПоступлениеНМА.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ПоступлениеНМА.Организация КАК Организация,
	               |	ПоступлениеНМА.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ_ПоступлениеНМА
	               |ИЗ
	               |	Документ.ПоступлениеНМА КАК ПоступлениеНМА
	               |ГДЕ
	               |	ПоступлениеНМА.Проведен
	               |	И ПоступлениеНМА.Дата >= &НачДата
	               |	И ПоступлениеНМА.Дата <= &КонДата
	               |	И ПоступлениеНМА.Организация = &Организация
	               |	И ПоступлениеНМА.ОтражатьВБухгалтерскомУчете
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	               |	ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |	ПоступлениеТоваровУслуг.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	               |	ПоступлениеТоваровУслуг.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
	               |	ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |	ПоступлениеТоваровУслуг.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ПоступлениеТоваровУслуг.ВидОперации
	               |ПОМЕСТИТЬ ВТ_ПоступлениеТоваровУслуг
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	               |ГДЕ
	               |	ПоступлениеТоваровУслуг.Проведен = ИСТИНА
	               |	И ПоступлениеТоваровУслуг.Дата >= &НачДата
	               |	И ПоступлениеТоваровУслуг.Дата <= &КонДата
	               |	И ПоступлениеТоваровУслуг.Организация = &Организация
	               |	И ПоступлениеТоваровУслуг.ОтражатьВБухгалтерскомУчете
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НДСЗаНерезидентаОбороты.ДокументПоступления КАК ДокументПоступления,
	               |	НДСЗаНерезидентаОбороты.Номенклатура КАК Номенклатура,
	               |	НДСЗаНерезидентаОбороты.СуммаНДСПриход
	               |ПОМЕСТИТЬ ВТ_НДСЗаНерезидента
	               |ИЗ
	               |	РегистрНакопления.НДСЗаНерезидента.Обороты(
	               |			,
	               |			,
	               |			,
	               |			Налогоплательщик = &Организация
	               |				И ДокументПоступления В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеТоваровУслуг
	               |			
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |					ВЫБРАТЬ
	               |						ВТ_ПоступлениеНМА.Ссылка
	               |					ИЗ
	               |						ВТ_ПоступлениеНМА)) КАК НДСЗаНерезидентаОбороты
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДокументПоступления,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ЗаявлениеОВвозеТоваров
	               |ИЗ
	               |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов
	               |ГДЕ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ДокументОснование В
	               |			(ВЫБРАТЬ
	               |				ПоступлениеТоваровУслуг.Ссылка
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг)
	               |	И ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.ДокументОснование КАК ДокументОснование,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Номенклатура,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.СуммаНДС КАК СуммаНДС,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Номер КАК Номер,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка.Дата КАК Дата,
	               |	NULL КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ НДСКУплатеТС
	               |ИЗ
	               |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.Товары КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары
	               |ГДЕ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ЗаявлениеОВвозеТоваров.Ссылка
	               |			ИЗ
	               |				ВТ_ЗаявлениеОВвозеТоваров)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ДокументОснование,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ОсновноеСредство,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.СуммаНДС,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Номер,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка.Дата,
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.ЕдиницаИзмерения
	               |ИЗ
	               |	Документ.ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалогов.ОС КАК ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС
	               |ГДЕ
	               |	ЗаявлениеОВвозеТоваровИУплатеКосвенныхНалоговОС.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ЗаявлениеОВвозеТоваров.Ссылка
	               |			ИЗ
	               |				ВТ_ЗаявлениеОВвозеТоваров)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.СуммаНДС,
	               |	ВложенныйЗапрос.СуммаПошлины,
	               |	ВложенныйЗапрос.СуммаСбора,
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.НомерГТД,
	               |	ВложенныйЗапрос.ДатаГТД,
	               |	ВложенныйЗапрос.Валюта,
	               |	ВложенныйЗапрос.КурсВалюты,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	моп_ОбъектыМониторинга.ПинКод,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	ВложенныйЗапрос.Счет
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(ЗапросОбъединенный.Дата) КАК Дата,
	               |		ЗапросОбъединенный.Номенклатура КАК Номенклатура,
	               |		СУММА(ЗапросОбъединенный.Сумма) КАК Сумма,
	               |		СУММА(ЗапросОбъединенный.СуммаНДС) КАК СуммаНДС,
	               |		СУММА(ЗапросОбъединенный.СуммаПошлины) КАК СуммаПошлины,
	               |		СУММА(ЗапросОбъединенный.СуммаСборов) КАК СуммаСбора,
	               |		ЗапросОбъединенный.Ссылка КАК Ссылка,
	               |		МАКСИМУМ(ЗапросОбъединенный.ДоговорКонтрагента) КАК ДоговорКонтрагента,
	               |		МАКСИМУМ(ЗапросОбъединенный.Контрагент) КАК Контрагент,
	               |		МАКСИМУМ(ЗапросОбъединенный.Организация) КАК Организация,
	               |		МАКСИМУМ(ЗапросОбъединенный.Цена) КАК Цена,
	               |		СУММА(ЗапросОбъединенный.Количество) КАК Количество,
	               |		МАКСИМУМ(ЗапросОбъединенный.НомерГТД) КАК НомерГТД,
	               |		МАКСИМУМ(ЗапросОбъединенный.ДатаГТД) КАК ДатаГТД,
	               |		МАКСИМУМ(ЗапросОбъединенный.ВалютаДокумента) КАК Валюта,
	               |		МАКСИМУМ(ЗапросОбъединенный.Курс) КАК КурсВалюты,
	               |		МАКСИМУМ(ВЫБОР
	               |				КОГДА ЗапросОбъединенный.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	               |					ТОГДА ЗапросОбъединенный.ЕдиницаИзмерения.ЕдиницаПоКлассификатору
	               |				ИНАЧЕ ЗапросОбъединенный.ЕдиницаИзмерения
	               |			КОНЕЦ) КАК ЕдиницаИзмерения,
	               |		МАКСИМУМ(ЗапросОбъединенный.Счет) КАК Счет
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			Поступления.Ссылка КАК Ссылка,
	               |			Поступления.Номенклатура КАК Номенклатура,
	               |			Поступления.Сумма КАК Сумма,
	               |			Поступления.СуммаНДС КАК СуммаНДС,
	               |			Поступления.СуммаПошлины КАК СуммаПошлины,
	               |			Поступления.СуммаСборов КАК СуммаСборов,
	               |			NULL КАК ДатаГТД,
	               |			NULL КАК НомерГТД,
	               |			Поступления.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |			Поступления.Контрагент КАК Контрагент,
	               |			Поступления.Организация КАК Организация,
	               |			Поступления.Дата КАК Дата,
	               |			Поступления.Цена КАК Цена,
	               |			Поступления.Количество КАК Количество,
	               |			Поступления.ВалютаДокумента КАК ВалютаДокумента,
	               |			Поступления.Курс КАК Курс,
	               |			Поступления.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |			Поступления.Счет КАК Счет
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |				КОНЕЦ КАК Сумма,
	               |				0 КАК СуммаНДС,
	               |				0 КАК СуммаСборов,
	               |				0 КАК ДатаГТД,
	               |				0 КАК НомерГТД,
	               |				ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |				ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |				ВТ_ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	               |				ВТ_ПоступлениеТоваровУслуг.Организация КАК Организация,
	               |				ВТ_ПоступлениеТоваровУслуг.Дата КАК Дата,
	               |				ПоступлениеТоваровУслугТовары.Цена КАК Цена,
	               |				ПоступлениеТоваровУслугТовары.Количество КАК Количество,
	               |				ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента КАК ВалютаДокумента,
	               |				ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1) КАК Курс,
	               |				0 КАК СуммаПошлины,
	               |				ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |				ПоступлениеТоваровУслугТовары.СчетУчетаБУ КАК Счет
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |					ПО ВТ_ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	               |						И (ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт)
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ПоступлениеТоваровУслугУслуги.Номенклатура,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугУслуги.Сумма - ПоступлениеТоваровУслугУслуги.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугУслуги.Сумма
	               |				КОНЕЦ,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				ПоступлениеТоваровУслугУслуги.Ссылка,
	               |				ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |				ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |				ВТ_ПоступлениеТоваровУслуг.Организация,
	               |				ВТ_ПоступлениеТоваровУслуг.Дата,
	               |				ПоступлениеТоваровУслугУслуги.Цена,
	               |				ПоступлениеТоваровУслугУслуги.Количество,
	               |				ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |				ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1),
	               |				0,
	               |				NULL,
	               |				ПоступлениеТоваровУслугУслуги.СчетЗатратБУ
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	               |					ПО ВТ_ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугУслуги.Ссылка
	               |			ГДЕ
	               |				(ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт
	               |						ИЛИ (ПоступлениеТоваровУслугУслуги.Ссылка, ПоступлениеТоваровУслугУслуги.Номенклатура) В
	               |							(ВЫБРАТЬ
	               |								ВТ_НДСЗаНерезидента.ДокументПоступления,
	               |								ВТ_НДСЗаНерезидента.Номенклатура
	               |							ИЗ
	               |								ВТ_НДСЗаНерезидента))
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ПоступлениеТоваровУслугОС.ОсновноеСредство,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |				КОНЕЦ,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				ПоступлениеТоваровУслугОС.Ссылка,
	               |				ВТ_ПоступлениеТоваровУслуг.ДоговорКонтрагента,
	               |				ВТ_ПоступлениеТоваровУслуг.Контрагент,
	               |				ВТ_ПоступлениеТоваровУслуг.Организация,
	               |				ВТ_ПоступлениеТоваровУслуг.Дата,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеТоваровУслуг.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеТоваровУслугОС.Сумма - ПоступлениеТоваровУслугОС.СуммаНДС
	               |					ИНАЧЕ ПоступлениеТоваровУслугОС.Сумма
	               |				КОНЕЦ,
	               |				1,
	               |				ВТ_ПоступлениеТоваровУслуг.ВалютаДокумента,
	               |				ВТ_ПоступлениеТоваровУслуг.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеТоваровУслуг.КратностьВзаиморасчетов, 1),
	               |				0,
	               |				NULL,
	               |				ПоступлениеТоваровУслугОС.СчетУчетаБУ
	               |			ИЗ
	               |				ВТ_ПоступлениеТоваровУслуг КАК ВТ_ПоступлениеТоваровУслуг
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОС КАК ПоступлениеТоваровУслугОС
	               |					ПО ВТ_ПоступлениеТоваровУслуг.Ссылка = ПоступлениеТоваровУслугОС.Ссылка
	               |						И (ВТ_ПоступлениеТоваровУслуг.ВидОперации = &Импорт)
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ПоступлениеНМАНМА.НематериальныйАктив,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |					ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |				КОНЕЦ,
	               |				0,
	               |				0,
	               |				0,
	               |				0,
	               |				ПоступлениеНМАНМА.Ссылка,
	               |				ВТ_ПоступлениеНМА.ДоговорКонтрагента,
	               |				ВТ_ПоступлениеНМА.Контрагент,
	               |				ВТ_ПоступлениеНМА.Организация,
	               |				ВТ_ПоступлениеНМА.Дата,
	               |				ВЫБОР
	               |					КОГДА ВТ_ПоступлениеНМА.СуммаВключаетНДС
	               |						ТОГДА ПоступлениеНМАНМА.Сумма - ПоступлениеНМАНМА.СуммаНДС
	               |					ИНАЧЕ ПоступлениеНМАНМА.Сумма
	               |				КОНЕЦ,
	               |				1,
	               |				ВТ_ПоступлениеНМА.ВалютаДокумента,
	               |				ВТ_ПоступлениеНМА.КурсВзаиморасчетов / ЕСТЬNULL(ВТ_ПоступлениеНМА.КратностьВзаиморасчетов, 1),
	               |				0,
	               |				NULL,
	               |				ПоступлениеНМАНМА.СчетУчетаБУ
	               |			ИЗ
	               |				ВТ_ПоступлениеНМА КАК ВТ_ПоступлениеНМА
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНМА.НМА КАК ПоступлениеНМАНМА
	               |					ПО ВТ_ПоступлениеНМА.Ссылка = ПоступлениеНМАНМА.Ссылка
	               |			ГДЕ
	               |				(ПоступлениеНМАНМА.Ссылка, ПоступлениеНМАНМА.НематериальныйАктив) В
	               |						(ВЫБРАТЬ
	               |							ВТ_НДСЗаНерезидента.ДокументПоступления,
	               |							ВТ_НДСЗаНерезидента.Номенклатура
	               |						ИЗ
	               |							ВТ_НДСЗаНерезидента)) КАК Поступления
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ГТД.ДокументПартии,
	               |			ГТД.Номенклатура,
	               |			0,
	               |			ГТД.СуммаНДСРегл,
	               |			ГТД.СуммаПошлиныРегл,
	               |			ГТД.СуммаВсехСборов,
	               |			ГТД.ДатаГТД,
	               |			ГТД.НомерГТД,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			0,
	               |			0,
	               |			NULL,
	               |			0,
	               |			NULL,
	               |			NULL
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ГТДОбщий.СуммаПошлиныРегл КАК СуммаПошлиныРегл,
	               |				ГТДОбщий.СуммаСбора КАК СуммаСбора,
	               |				ГТДОбщий.СуммаВалютногоСбораРегл КАК СуммаВалютногоСбораРегл,
	               |				ГТДОбщий.СуммаНДСРегл КАК СуммаНДСРегл,
	               |				ГТДОбщий.Номенклатура КАК Номенклатура,
	               |				ГТДОбщий.НомерСтроки КАК НомерСтроки,
	               |				ГТДОбщий.НомерРаздела КАК НомерРаздела,
	               |				ГТДОбщий.ТаможеннаяСтоимость КАК ТаможеннаяСтоимость,
	               |				ГТДОбщий.СуммаПошлиныВВалюте КАК СуммаПошлиныВВалюте,
	               |				ГТДОбщий.СуммаСбораВВалюте КАК СуммаСбораВВалюте,
	               |				ГТДОбщий.ВалютаСбора КАК ВалютаСбора,
	               |				ГТДОбщий.Количество КАК Количество,
	               |				ГТДОбщий.ВалютаДокументаПоступления КАК ВалютаДокументаПоступления,
	               |				ГТДОбщий.СтавкаПошлины КАК СтавкаПошлины,
	               |				ГТДОбщий.ВалютаПошлины КАК ВалютаПошлины,
	               |				ГТДОбщий.СуммаНДСВВалюте КАК СуммаНДСВВалюте,
	               |				ГТДОбщий.ВалютаНДС КАК ВалютаНДС,
	               |				ГТДОбщий.СуммаПоступленияРегл КАК СуммаПоступленияРегл,
	               |				ГТДОбщий.СуммаПоступленияРегл + ГТДОбщий.СуммаПошлиныРегл + ГТДОбщий.СуммаВалютногоСбораРегл + ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаНДСВСтоимостиРегл КАК ОбщаяСуммаРегл,
	               |				ВЫБОР
	               |					КОГДА ГТДОбщий.Количество = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ (ГТДОбщий.СуммаПоступленияРегл + ГТДОбщий.СуммаПошлиныРегл + ГТДОбщий.СуммаВалютногоСбораРегл + ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаНДСВСтоимостиРегл) / ГТДОбщий.Количество
	               |				КОНЕЦ КАК ОбщаяЦенаРегл,
	               |				ГТДОбщий.ЦенаРегл КАК ЦенаРегл,
	               |				ГТДОбщий.ЦенаВал КАК ЦенаВал,
	               |				ГТДОбщий.ВалютаДокумента КАК ВалютаДокумента,
	               |				ГТДОбщий.КодНоменклатуры КАК КодНоменклатуры,
	               |				ГТДОбщий.ДокументПартии КАК ДокументПартии,
	               |				ГТДОбщий.СуммаСбора + ГТДОбщий.СуммаВалютногоСбораРегл КАК СуммаВсехСборов,
	               |				ГТДОбщий.ДатаГТД КАК ДатаГТД,
	               |				ГТДОбщий.НомерГТД КАК НомерГТД,
	               |				ГТДОбщий.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
	               |					ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
	               |					ГТДИмпортТовары.Номенклатура КАК Номенклатура,
	               |					ГТДИмпортТовары.ФактурнаяСтоимость КАК ТаможеннаяСтоимость,
	               |					ВЫБОР
	               |						КОГДА (НЕ ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента)
	               |							ТОГДА ГТДИмпортТовары.СуммаПошлины
	               |						ИНАЧЕ 0
	               |					КОНЕЦ КАК СуммаПошлиныВВалюте,
	               |					ГТДИмпортТовары.СуммаСбора КАК СуммаСбора,
	               |					ГТДИмпортТовары.СуммаСбораВал КАК СуммаСбораВВалюте,
	               |					ГТДИмпортРазделы.ДоговорВзаиморасчетовСбор.ВалютаВзаиморасчетов КАК ВалютаСбора,
	               |					ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) КАК Количество,
	               |					ПоступлениеТМЗ.ВалютаДокумента КАК ВалютаДокументаПоступления,
	               |					ГТДИмпортРазделы.СтавкаПошлины КАК СтавкаПошлины,
	               |					ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов КАК ВалютаПошлины,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |							ТОГДА 0
	               |						ИНАЧЕ ГТДИмпортТовары.СуммаНДС
	               |					КОНЕЦ КАК СуммаНДСВВалюте,
	               |					ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов КАК ВалютаНДС,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовПошлина.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |							ТОГДА ГТДИмпортТовары.СуммаПошлины
	               |						КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаПошлины * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |					КОНЕЦ КАК СуммаПошлиныРегл,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаСбораВал * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |					КОНЕЦ КАК СуммаВалютногоСбораРегл,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |							ТОГДА ГТДИмпортТовары.СуммаНДС
	               |						КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |							ТОГДА 0
	               |						ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаНДС * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |					КОНЕЦ КАК СуммаНДСРегл,
	               |					ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0) КАК СуммаПоступленияРегл,
	               |					ВЫБОР
	               |						КОГДА ГТДИмпортРазделы.Ссылка.НДСВключенВСтоимость
	               |							ТОГДА ВЫБОР
	               |									КОГДА ГТДИмпортРазделы.ДоговорВзаиморасчетовНДС.ВалютаВзаиморасчетов = ГТДИмпортРазделы.Ссылка.ВалютаДокумента
	               |										ТОГДА ГТДИмпортТовары.СуммаНДС
	               |									КОГДА ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов = 0
	               |										ТОГДА 0
	               |									ИНАЧЕ ВЫРАЗИТЬ(ГТДИмпортТовары.СуммаНДС * ГТДИмпортРазделы.Ссылка.КурсВзаиморасчетов / ГТДИмпортРазделы.Ссылка.КратностьВзаиморасчетов КАК ЧИСЛО(15, 2))
	               |								КОНЕЦ
	               |						ИНАЧЕ 0
	               |					КОНЕЦ КАК СуммаНДСВСтоимостиРегл,
	               |					ВЫРАЗИТЬ(ВЫБОР
	               |							КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
	               |								ТОГДА 0
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияВал, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
	               |						КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаВал,
	               |					ВЫРАЗИТЬ(ВЫБОР
	               |							КОГДА ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0) = 0
	               |								ТОГДА 0
	               |							ИНАЧЕ ЕСТЬNULL(ПоступлениеТМЗ.СуммаПоступленияРегл, 0) / ЕСТЬNULL(ПоступлениеТМЗ.Количество, 0)
	               |						КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаРегл,
	               |					ГТДИмпортРазделы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	               |					ГТДИмпортТовары.Номенклатура.Код КАК КодНоменклатуры,
	               |					ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
	               |					ГТДИмпортТовары.Ссылка.Дата КАК ДатаГТД,
	               |					ГТДИмпортТовары.Ссылка.НомерГТД КАК НомерГТД,
	               |					ГТДИмпортРазделы.Ссылка.Ссылка КАК Ссылка,
	               |					ПоступлениеТМЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |				ИЗ
	               |					(ВЫБРАТЬ
	               |						ГТДИмпортТовары.НомерСтроки КАК НомерСтроки,
	               |						ГТДИмпортТовары.НомерРаздела КАК НомерРаздела,
	               |						ГТДИмпортТовары.Номенклатура КАК Номенклатура,
	               |						ГТДИмпортТовары.Количество КАК Количество,
	               |						ГТДИмпортТовары.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
	               |						ГТДИмпортТовары.СуммаПошлины КАК СуммаПошлины,
	               |						ГТДИмпортТовары.СуммаСбора КАК СуммаСбора,
	               |						ГТДИмпортТовары.СуммаСбораВал КАК СуммаСбораВал,
	               |						ГТДИмпортТовары.ДокументПартии КАК ДокументПартии,
	               |						ГТДИмпортТовары.Ссылка КАК Ссылка,
	               |						ГТДИмпортТовары.СуммаНДС КАК СуммаНДС
	               |					ИЗ
	               |						Документ.ГТДИмпорт.Товары КАК ГТДИмпортТовары
	               |					ГДЕ
	               |						ГТДИмпортТовары.ДокументПартии В
	               |								(ВЫБРАТЬ
	               |									ПоступлениеТоваровУслуг.Ссылка
	               |								ИЗ
	               |									ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг)
	               |						И ГТДИмпортТовары.Ссылка.Проведен
	               |						И ГТДИмпортТовары.Ссылка.ОтражатьВБухгалтерскомУчете
	               |					
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |					
	               |					ВЫБРАТЬ
	               |						ГТДИмпортОС.НомерСтроки,
	               |						ГТДИмпортОС.НомерРаздела,
	               |						ГТДИмпортОС.ОсновноеСредство,
	               |						1,
	               |						ГТДИмпортОС.ФактурнаяСтоимость,
	               |						ГТДИмпортОС.СуммаПошлины,
	               |						ГТДИмпортОС.СуммаСбора,
	               |						ГТДИмпортОС.СуммаСбораВал,
	               |						ГТДИмпортОС.ДокументПартии,
	               |						ГТДИмпортОС.Ссылка,
	               |						ГТДИмпортОС.СуммаНДС
	               |					ИЗ
	               |						Документ.ГТДИмпорт.ОС КАК ГТДИмпортОС
	               |					ГДЕ
	               |						ГТДИмпортОС.ДокументПартии В
	               |								(ВЫБРАТЬ
	               |									ПоступлениеТоваровУслуг.Ссылка
	               |								ИЗ
	               |									ВТ_ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг)
	               |						И ГТДИмпортОС.Ссылка.Проведен
	               |						И ГТДИмпортОС.Ссылка.ОтражатьВБухгалтерскомУчете) КАК ГТДИмпортТовары
	               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГТДИмпорт.Разделы КАК ГТДИмпортРазделы
	               |						ПО ГТДИмпортТовары.Ссылка = ГТДИмпортРазделы.Ссылка
	               |							И ГТДИмпортТовары.НомерРаздела = ГТДИмпортРазделы.НомерСтроки
	               |						ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	               |							ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |							СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	               |							СУММА(ВЫБОР
	               |									КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |											И (НЕ ПоступлениеТоваровУслугТовары.Ссылка.НДСВключенВСтоимость)
	               |										ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |									ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |								КОНЕЦ) КАК СуммаПоступленияВал,
	               |							ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	               |							СУММА(ВЫБОР
	               |									КОГДА ПоступлениеТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |										ТОГДА 0
	               |									ИНАЧЕ ПоступлениеТоваровУслугТовары.Ссылка.КурсВзаиморасчетов / ПоступлениеТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов * ВЫБОР
	               |											КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |													И (НЕ ПоступлениеТоваровУслугТовары.Ссылка.НДСВключенВСтоимость)
	               |												ТОГДА ПоступлениеТоваровУслугТовары.Сумма - ПоступлениеТоваровУслугТовары.СуммаНДС
	               |											ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма
	               |										КОНЕЦ
	               |								КОНЕЦ) КАК СуммаПоступленияРегл,
	               |							ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |						ИЗ
	               |							Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |						ГДЕ
	               |							ПоступлениеТоваровУслугТовары.Ссылка В
	               |									(ВЫБРАТЬ
	               |										ВТ_ПоступлениеТоваровУслуг.Ссылка
	               |									ИЗ
	               |										ВТ_ПоступлениеТоваровУслуг)
	               |						
	               |						СГРУППИРОВАТЬ ПО
	               |							ПоступлениеТоваровУслугТовары.Ссылка,
	               |							ПоступлениеТоваровУслугТовары.Номенклатура,
	               |							ПоступлениеТоваровУслугТовары.Ссылка.ВалютаДокумента,
	               |							ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения) КАК ПоступлениеТМЗ
	               |						ПО ГТДИмпортТовары.ДокументПартии = ПоступлениеТМЗ.Ссылка
	               |							И ГТДИмпортТовары.Номенклатура = ПоступлениеТМЗ.Номенклатура) КАК ГТДОбщий) КАК ГТД
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			НДСКУплатеТС.ДокументОснование,
	               |			НДСКУплатеТС.Номенклатура,
	               |			NULL,
	               |			НДСКУплатеТС.СуммаНДС,
	               |			NULL,
	               |			NULL,
	               |			НДСКУплатеТС.Дата,
	               |			НДСКУплатеТС.Номер,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			НДСКУплатеТС.ЕдиницаИзмерения,
	               |			NULL
	               |		ИЗ
	               |			НДСКУплатеТС КАК НДСКУплатеТС
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ВТ_НДСЗаНерезидента.ДокументПоступления,
	               |			ВТ_НДСЗаНерезидента.Номенклатура,
	               |			NULL,
	               |			ВТ_НДСЗаНерезидента.СуммаНДСПриход,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL,
	               |			NULL
	               |		ИЗ
	               |			ВТ_НДСЗаНерезидента КАК ВТ_НДСЗаНерезидента) КАК ЗапросОбъединенный
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЗапросОбъединенный.Номенклатура,
	               |		ЗапросОбъединенный.Ссылка) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингИмпорта.СоздатьНаборЗаписей();	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка;
				
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Период 			= Выборка.Дата;		
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.ПинКод             = Выборка.ПинКод;
		Движение.КодТНВЭД           = Выборка.КодТНВЭД;
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Движение.СуммаБезНалогов 	= Выборка.Сумма;
		Движение.СуммаНДС 			= Выборка.СуммаНДС;
		Движение.СуммаПошлины 		= Выборка.СуммаПошлины;
		Движение.СуммаСборов 		= Выборка.СуммаСбора;
		Движение.СсылкаНаДокумент	= Выборка.Ссылка;
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.Контрагент 		= Выборка.Контрагент;
		Движение.Организация 		= Выборка.Организация;				
		Движение.Количество 		= Выборка.Количество;
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);		
		Движение.НомерГТД		 	= Выборка.НомерГТД;		
		Движение.ДатаГТД		 	= Выборка.ДатаГТД;
		Движение.Счет 				= Выборка.Счет;
		//Движение.НомерИнвойса	 	= "";
		//Движение.ДатаИнвойса	 	= "";		
		Движение.Акциз 				= 0;
		Движение.Валюта 			= Выборка.Валюта;
		Движение.КурсТенге 			= Выборка.КурсВалюты;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);		
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет движения по мониторингу экспорта
// если дополнение встроено в конфигурацию "УПП"
//
Процедура ВыполнитьДвиженияПоМониторингуЭкспортаУПП(ДанныеДокумента, НачДата, КонДата, ВалютаРегламентированногоУчета) Экспорт
		
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("НачДата", НачДата);
	Запрос.УстановитьПараметр("КонДата", КонДата);
	Запрос.УстановитьПараметр("Организация", ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурныеОС", Перечисления.ВидыОперацийПередачиОС.ПередачаСтруктурномуПодразделению);
	Запрос.УстановитьПараметр("ВидОперацииСтруктурные", Перечисления.ВидыОперацийРеализацияТоваров.ПередачаСтруктурномуПодразделению);
	
	ТекущийРелиз = ОбщегоНазначения.ПолучитьНомерРелиза(Метаданные.Версия);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.СчетДоходовБУ,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Контрагент,
	               |	ВложенныйЗапрос.ДоговорКонтрагента,
	               |	ВложенныйЗапрос.Цена,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.СУММА,
	               |	ВложенныйЗапрос.Валюта,
	               |	ВложенныйЗапрос.КурсВалюты,
	               |	ВложенныйЗапрос.Дата,
	               |	ВложенныйЗапрос.СсылкаНаДокумент,
	               |	ВложенныйЗапрос.Организация,
	               |	моп_ОбъектыМониторинга.КодТНВЭД,
	               |	ВложенныйЗапрос.ЕдиницаИзмерения,
	               |	моп_ОбъектыМониторинга.ПинКод,
	               |	моп_СведенияПоЭкспортуТовары.НомерГТД,
	               |	моп_СведенияПоЭкспортуТовары.ДатаГТД,
	               |	моп_СведенияПоЭкспортуТовары.ДатаИнвойса,
	               |	моп_СведенияПоЭкспортуТовары.НомерИнвойса,
	               |	моп_СведенияПоЭкспортуТовары.МестоОтгрузки,
	               |	моп_СведенияПоЭкспортуТовары.ДатаПаспортаСделки,
	               |	моп_СведенияПоЭкспортуТовары.НомерПаспортаСделки,
	               |	моп_СведенияПоЭкспортуТовары.ДатаОплаты,
	               |	моп_СведенияПоЭкспортуТовары.УсловияПоставки,
	               |	моп_СведенияПоЭкспортуТовары.СуммаСборов,
	               |	моп_СведенияПоЭкспортуТовары.СуммаПошлины
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		РеализацияТоваровУслугТовары.СчетДоходовБУ КАК СчетДоходовБУ,
	               |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	               |		РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	               |		РеализацияТоваровУслугТовары.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |		РеализацияТоваровУслугТовары.Цена КАК Цена,
	               |		РеализацияТоваровУслугТовары.Количество КАК Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугТовары.Сумма - РеализацияТоваровУслугТовары.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Сумма
	               |		КОНЕЦ КАК СУММА,
	               |		РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента КАК Валюта,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка.КурсВзаиморасчетов / РеализацияТоваровУслугТовары.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ КАК КурсВалюты,
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата КАК Дата,
	               |		РеализацияТоваровУслугТовары.Ссылка.Ссылка КАК СсылкаНаДокумент,
	               |		РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	               |		РеализацияТоваровУслугТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору КАК ЕдиницаИзмерения
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |	ГДЕ
	               |		РеализацияТоваровУслугТовары.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугТовары.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияТоваровУслугТовары.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |		И РеализацияТоваровУслугТовары.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		АктОбОказанииПроизводственныхУслугУслуги.СчетДоходовБУ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Номенклатура,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Контрагент,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Цена,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Сумма - АктОбОказанииПроизводственныхУслугУслуги.СуммаНДС
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КурсВзаиморасчетов / АктОбОказанииПроизводственныхУслугУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка,
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация,
	               |		АктОбОказанииПроизводственныхУслугУслуги.ЕдиницаИзмерения.ЕдиницаПоКлассификатору
	               |	ИЗ
	               |		Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК АктОбОказанииПроизводственныхУслугУслуги
	               |	ГДЕ
	               |		АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Организация = &Организация
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И АктОбОказанииПроизводственныхУслугУслуги.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаНМА.СчетДоходовБУ,
	               |		ПередачаНМА.НематериальныйАктив,
	               |		ПередачаНМА.Контрагент,
	               |		ПередачаНМА.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.СуммаВключаетНДС
	               |				ТОГДА ПередачаНМА.Сумма - ПередачаНМА.СуммаНДС
	               |			ИНАЧЕ ПередачаНМА.Сумма
	               |		КОНЕЦ,
	               |		ПередачаНМА.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА ПередачаНМА.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА ПередачаНМА.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ ПередачаНМА.Ссылка.КурсВзаиморасчетов / ПередачаНМА.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		ПередачаНМА.Дата,
	               |		ПередачаНМА.Ссылка,
	               |		ПередачаНМА.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаНМА КАК ПередачаНМА
	               |	ГДЕ
	               |		ПередачаНМА.Дата >= &НачДата
	               |		И ПередачаНМА.Дата <= &КонДата
	               |		И ПередачаНМА.Организация = &Организация
	               |		И ПередачаНМА.Проведен = ИСТИНА
	               |		И ПередачаНМА.ВалютаДокумента <> &ВалютаРегУчета
	               |		И ПередачаНМА.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПередачаОСОС.СчетДоходовБУ,
	               |		ПередачаОСОС.ОсновноеСредство,
	               |		ПередачаОСОС.Ссылка.Контрагент,
	               |		ПередачаОСОС.Ссылка.ДоговорКонтрагента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОСОС.Сумма - ПередачаОСОС.СуммаНДС
	               |			ИНАЧЕ ПередачаОСОС.Сумма
	               |		КОНЕЦ,
	               |		ПередачаОСОС.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА ПередачаОСОС.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА ПередачаОСОС.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ ПередачаОСОС.Ссылка.КурсВзаиморасчетов / ПередачаОСОС.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		ПередачаОСОС.Ссылка.Дата,
	               |		ПередачаОСОС.Ссылка.Ссылка,
	               |		ПередачаОСОС.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.ПередачаОС.ОС КАК ПередачаОСОС
	               |	ГДЕ
	               |		ПередачаОСОС.Ссылка.Дата >= &НачДата
	               |		И ПередачаОСОС.Ссылка.Дата <= &КонДата
	               |		И ПередачаОСОС.Ссылка.Организация = &Организация
	               |		И ПередачаОСОС.Ссылка.Проведен = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И ПередачаОСОС.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |		И ПередачаОСОС.Ссылка.ВидОперации <> &ВидОперацииСтруктурныеОС
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияТоваровУслугУслуги.СчетДоходовБУ,
	               |		РеализацияТоваровУслугУслуги.Номенклатура,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Контрагент,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияТоваровУслугУслуги.Цена,
	               |		РеализацияТоваровУслугУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияТоваровУслугУслуги.Сумма - РеализацияТоваровУслугУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияТоваровУслугУслуги.Ссылка.КурсВзаиморасчетов / РеализацияТоваровУслугУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Ссылка,
	               |		РеализацияТоваровУслугУслуги.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |	ГДЕ
	               |		РеализацияТоваровУслугУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияТоваровУслугУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |		И РеализацияТоваровУслугУслуги.Ссылка.ВидОперации <> &ВидОперацииСтруктурные
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.СчетДоходовБУ,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.УслугаПоВознаграждению,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.ДоговорКонтрагента,
	               |		ОтчетКомитентуОПродажахТовары.Цена,
	               |		1,
	               |		ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.СуммаВознаграждения - ОтчетКомитентуОПродажахТовары.СуммаНДСВознаграждения
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.СуммаВознаграждения
	               |		КОНЕЦ,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА ОтчетКомитентуОПродажахТовары.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Ссылка.КурсВзаиморасчетов / ОтчетКомитентуОПродажахТовары.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Ссылка,
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.ОтчетКомитентуОПродажах.Товары КАК ОтчетКомитентуОПродажахТовары
	               |	ГДЕ
	               |		ОтчетКомитентуОПродажахТовары.Ссылка.Дата >= &НачДата
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.Дата <= &КонДата
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.Организация = &Организация
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.Проведен = ИСТИНА
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И ОтчетКомитентуОПродажахТовары.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеУслуги.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеУслуги.Номенклатура,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеУслуги.Цена,
	               |		РеализацияУслугПоПереработкеУслуги.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Сумма - РеализацияУслугПоПереработкеУслуги.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияУслугПоПереработкеУслуги.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияУслугПоПереработкеУслуги.Ссылка.КурсВзаиморасчетов / РеализацияУслугПоПереработкеУслуги.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Ссылка,
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Услуги КАК РеализацияУслугПоПереработкеУслуги
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеУслуги.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияУслугПоПереработкеУслуги.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		РеализацияУслугПоПереработкеПродукция.СчетДоходовБУ,
	               |		РеализацияУслугПоПереработкеПродукция.Номенклатура,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Контрагент,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.ДоговорКонтрагента,
	               |		РеализацияУслугПоПереработкеПродукция.Цена,
	               |		РеализацияУслугПоПереработкеПродукция.Количество,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеПродукция.Ссылка.СуммаВключаетНДС
	               |				ТОГДА РеализацияУслугПоПереработкеПродукция.Сумма - РеализацияУслугПоПереработкеПродукция.СуммаНДС
	               |			ИНАЧЕ РеализацияУслугПоПереработкеПродукция.Сумма
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.ВалютаДокумента,
	               |		ВЫБОР
	               |			КОГДА РеализацияУслугПоПереработкеПродукция.Ссылка.КратностьВзаиморасчетов = 0
	               |				ТОГДА РеализацияУслугПоПереработкеПродукция.Ссылка.КурсВзаиморасчетов
	               |			ИНАЧЕ РеализацияУслугПоПереработкеПродукция.Ссылка.КурсВзаиморасчетов / РеализацияУслугПоПереработкеПродукция.Ссылка.КратностьВзаиморасчетов
	               |		КОНЕЦ,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Дата,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Ссылка,
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Организация,
	               |		NULL
	               |	ИЗ
	               |		Документ.РеализацияУслугПоПереработке.Продукция КАК РеализацияУслугПоПереработкеПродукция
	               |	ГДЕ
	               |		РеализацияУслугПоПереработкеПродукция.Ссылка.Дата >= &НачДата
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.Дата <= &КонДата
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.Организация = &Организация
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.ВалютаДокумента <> &ВалютаРегУчета
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.Проведен = ИСТИНА
	               |		И РеализацияУслугПоПереработкеПродукция.Ссылка.ОтражатьВБухгалтерскомУчете = ИСТИНА) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.моп_ОбъектыМониторинга КАК моп_ОбъектыМониторинга
	               |		ПО ВложенныйЗапрос.Номенклатура = моп_ОбъектыМониторинга.ОбъектМОП
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии КАК ДокументПартии,
	               |			моп_СведенияПоЭкспортуТовары.Номенклатура КАК Номенклатура,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА моп_СведенияПоЭкспортуТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегУчета
	               |						ТОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаПошлины, 0)
	               |					КОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаПошлины, 0) * ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КурсВзаиморасчетов, 0) / ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) КАК ЧИСЛО(15, 2))
	               |				КОНЕЦ) КАК СуммаПошлины,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерГТД КАК НомерГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаГТД КАК ДатаГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаИнвойса КАК ДатаИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерИнвойса КАК НомерИнвойса,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.МестоОтгрузки, 1, 250) КАК МестоОтгрузки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаПаспортаСделки КАК ДатаПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерПаспортаСделки КАК НомерПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаОплаты КАК ДатаОплаты,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.УсловияПоставки, 1, 250) КАК УсловияПоставки,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА моп_СведенияПоЭкспортуТовары.Ссылка.ВалютаВзаиморасчетов = &ВалютаРегУчета
	               |						ТОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаСборов, 0)
	               |					КОГДА ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) = 0
	               |						ТОГДА 0
	               |					ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.СуммаСборов, 0) * ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КурсВзаиморасчетов, 0) / ЕСТЬNULL(моп_СведенияПоЭкспортуТовары.Ссылка.КратностьВзаиморасчетов, 0) КАК ЧИСЛО(15, 2))
	               |				КОНЕЦ) КАК СуммаСборов
	               |		ИЗ
	               |			Документ.моп_СведенияПоЭкспорту.Товары КАК моп_СведенияПоЭкспортуТовары
	               |		ГДЕ
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии В
	               |					(ВЫБРАТЬ
	               |						РеализацияТоваровУслуг.Ссылка
	               |					ИЗ
	               |						Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |					ГДЕ
	               |						РеализацияТоваровУслуг.Дата >= &НачДата
	               |						И РеализацияТоваровУслуг.Дата <= &КонДата
	               |						И РеализацияТоваровУслуг.Организация = &Организация
	               |						И РеализацияТоваровУслуг.Проведен
	               |						И РеализацияТоваровУслуг.ВалютаДокумента <> &ВалютаРегУчета
	               |						И РеализацияТоваровУслуг.ВидОперации <> &ВидОперацииСтруктурные)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			моп_СведенияПоЭкспортуТовары.ДокументПартии,
	               |			моп_СведенияПоЭкспортуТовары.Номенклатура,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаГТД,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерИнвойса,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаПаспортаСделки,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.МестоОтгрузки, 1, 250),
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.НомерПаспортаСделки,
	               |			моп_СведенияПоЭкспортуТовары.Ссылка.ДатаОплаты,
	               |			ПОДСТРОКА(моп_СведенияПоЭкспортуТовары.Ссылка.УсловияПоставки, 1, 250)) КАК моп_СведенияПоЭкспортуТовары
	               |		ПО ВложенныйЗапрос.СсылкаНаДокумент = моп_СведенияПоЭкспортуТовары.ДокументПартии
	               |			И ВложенныйЗапрос.Номенклатура = моп_СведенияПоЭкспортуТовары.Номенклатура";					   			
		
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоВВыборке = Выборка.Количество();
	НомерТекущегоДокумента = 0;
	
	НаборЗаписей = РегистрыНакопления.моп_МониторингЭкспорта.СоздатьНаборЗаписей();
	
	ТаблицаДвижений = НаборЗаписей.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Док = Выборка.СсылкаНаДокумент;
		
		СчетФактура = ОбщегоНазначения.НайтиПодчиненныйДокумент(Док, "СчетФактураВыданный");		
		Если ЗначениеЗаполнено(СчетФактура) Тогда								
			Если СчетФактура.Дополнительная тогда
				продолжить;
			КонецЕсли;		
		КонецЕсли;	
		
		НомерТекущегоДокумента = НомерТекущегоДокумента + 1;
		
		Движение 					= ТаблицаДвижений.Добавить();
		Движение.Счет				= Выборка.СчетДоходовБУ;		
		Движение.Период 			= Выборка.Дата;		
		Движение.Номенклатура 		= Выборка.Номенклатура;
		Движение.КодТНВЭД           = Выборка.КодТНВЭД;
		Движение.ЕдиницаИзмерения   = Выборка.ЕдиницаИзмерения;
		
		Движение.СуммаБезНалогов 	= Выборка.Сумма;
		Движение.СсылкаНаДокумент	= Док;
		Движение.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
		Движение.Контрагент 		= Выборка.Контрагент;
		Движение.Организация 		= Выборка.Организация;				
		Движение.Количество 		= Выборка.Количество;
		Движение.Цена 				= ?(Движение.Количество = 0, 0, Движение.СуммаБезНалогов/Движение.Количество);		
		Движение.Валюта 			= Выборка.Валюта;
		Движение.КурсТенге 			= Выборка.КурсВалюты;
		Движение.ПинКод				= Выборка.ПинКод;
				
		Движение.СуммаПошлины			= Выборка.СуммаПошлины;
		Движение.СуммаСборов			= Выборка.СуммаСборов;		
		
		Движение.НомерГТД				= Выборка.НомерГТД;
		Движение.ДатаГТД				= Выборка.ДатаГТД;
		Движение.НомерИнвойса			= Выборка.НомерИнвойса;		
		Движение.ДатаИнвойса			= Выборка.ДатаИнвойса;
		Движение.УсловияПоставки		= Выборка.УсловияПоставки;
		Движение.МестоОтгрузки			= Выборка.МестоОтгрузки;
		Движение.ДатаПаспортаСделки		= Выборка.ДатаПаспортаСделки;
		Движение.НомерПаспортаСделки	= Выборка.НомерПаспортаСделки;
		Движение.ДатаОплаты				= Выборка.ДатаОплаты;
		
	КонецЦикла;		
	
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокумента.Ссылка);	
	НаборЗаписей.мПериод          = ДанныеДокумента.Дата;
	НаборЗаписей.мТаблицаДвижений = ТаблицаДвижений;	
	НаборЗаписей.ВыполнитьДвижения();
	НаборЗаписей.Записать();
	
КонецПроцедуры
