
&НаКлиенте
Процедура ПоискПоНаименованиюПриИзменении(Элемент)
	НастроитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоНаименованиюОчистка(Элемент, СтандартнаяОбработка)
	НастроитьОтбор();
КонецПроцедуры

&НаСервере
Процедура НастроитьОтбор()
	Список.Отбор.Элементы.Очистить();
	Если ПоискПоНаименованию<>"" Тогда
		НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Наименование");
		НовыйОтбор.ПравоеЗначение = ПоискПоНаименованию;
		НовыйОтбор.Использование = Истина;
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
