Перем ПрошлыйИзмененныйРодительОбъектаДоступа;  // хранит прошлый измененный родитель объекта доступа

//Процедура ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		ПрошлыйИзмененныйРодительОбъектаДоступа = ?(НЕ ЭтоНовый() И НЕ Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

//Процедура ПриЗаписи
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
