////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
//

Перем мПоддержкаРаботыСоСтруктурнымиПодразделениями;

// Хранит настройку учетной политики по налоговому учету - признак расчета СН
Перем мОрганизацияЯвляетсяПлательщикомСН Экспорт; 

// Хранит настройку учетной политики по налоговому учету - признак вкладчика ОППВ
Перем мОрганизацияЯвляетсяВкладчикомОППВ Экспорт; 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет автоматическое заполнение документа по данным документа и переданным параметрам.
// 
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Логическое - удалось ли выполнить автоматическое заполнение документа
//
Функция Автозаполнение(ПостроительЗапроса = Неопределено, СписокФизЛиц = Неопределено) Экспорт

	ГоловнаяОрганизация = ОбщегоНазначения.ГоловнаяОрганизация(Организация);
	
	Налогоплательщик		= ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(
																						?(мПоддержкаРаботыСоСтруктурнымиПодразделениями, ?(ПодразделениеОрганизации.ЯвляетсяСтруктурнымПодразделением, ПодразделениеОрганизации, Организация), Организация),
																						Организация,
																						глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц"),
																						Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("парамНачало" , ПериодРегистрации);
	Запрос.УстановитьПараметр("парамКонец" , КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОрганизация" , Организация);
	Запрос.УстановитьПараметр("парамГоловнаяОрганизация" , ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("парамПользователь" , Ответственный);
	Запрос.УстановитьПараметр("парамПодразделение" , ПодразделениеОрганизации);
	Запрос.УстановитьПараметр("Уволен", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("Принят", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	Запрос.УстановитьПараметр("парамПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("парамНалогВзнос", Перечисления.ВидыПлатежейВБюджетИФонды.Налог);
	Запрос.УстановитьПараметр("парамИсчисление", Перечисления.РасчетыСБюджетомФондамиВидСтроки.Исчисление);
	Запрос.УстановитьПараметр("парамВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	Запрос.УстановитьПараметр("парамСписокФизЛиц", СписокФизЛиц);
	Запрос.УстановитьПараметр("парамИнвалид", Перечисления.ОтношениеКИнвалидности.Инвалид);
	
	// узнаем учетную политику по налоговому учету
	мОрганизацияЯвляетсяПлательщикомСН = ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаСоциальногоНалога(Организация, ПериодРегистрации);
	мОрганизацияЯвляетсяВкладчикомОППВ = ПроцедурыНалоговогоУчета.ПолучитьПризнакВкладчикаПрофПенсионныхВзносов(Организация, ПериодРегистрации);

	РасчетСНдляИП = (Налогоплательщик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо);
		
	ПустоеПодразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	ПустойОтветственный = Справочники.Пользователи.ПустаяСсылка();
	
	// Проверим ответственного - является ли он расчетчиком вообще и для заданного 
	// подразделения (если оно задано)
	Если Ответственный <> ПустойОтветственный Тогда
		Если глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация].РасчетЗарплатыОрганизацииПоОтветственным Тогда
			Если ПодразделениеОрганизации = ПустоеПодразделение Тогда
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Расчетчики.ПодразделениеОрганизации
				|ИЗ
				|	РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамНачало) КАК Расчетчики
				|
				|ГДЕ
				|	Расчетчики.Пользователь = &парамПользователь";
				Если Запрос.Выполнить().Пустой() Тогда
					Сообщить("Ответственный за этот документ не является расчетчиком ни одного из подразделений организации");
					Возврат  Ложь;
				КонецЕсли;
			Иначе
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	Подразделения.Ссылка
				|ИЗ
				|	Справочник.ПодразделенияОрганизаций КАК Подразделения
				|
				|ГДЕ
				|	Подразделения.Ссылка В ИЕРАРХИИ(&парамПодразделение) И
				|	(Подразделения.Ссылка В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ 	Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамНачало) КАК Расчетчики ГДЕ 	Расчетчики.Пользователь = &парамПользователь ))";
				Если Запрос.Выполнить().Пустой() Тогда
					Сообщить("Ответственный за этот документ не является расчетчиком для выбранного подразделения");
					Возврат  Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	 КонецЕсли;
	
	Если ПодразделениеОрганизации = ПустоеПодразделение И Ответственный = ПустойОтветственный Тогда
		ПоВсемПодразделениямОрганизации = Истина;
		УсловиеНаПодразделение = "СписокФизЛиц.ПодразделениеОрганизации.Владелец = &парамОрганизация";
	ИначеЕсли ПодразделениеОрганизации = ПустоеПодразделение Тогда
		Если глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация].РасчетЗарплатыОрганизацииПоОтветственным Тогда
			ПоВсемПодразделениямОрганизации = Ложь;
			УсловиеНаПодразделение = "СписокФизЛиц.ПодразделениеОрганизации В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Расчетчики.ПодразделениеОрганизации ИЗ РегистрСведений.РасчетчикиЗарплатыОрганизаций.СрезПоследних(&парамНачало) Расчетчики ГДЕ Расчетчики.Пользователь = &парамПользователь)";
		Иначе
			ПоВсемПодразделениямОрганизации = Истина;
			УсловиеНаПодразделение = "СписокФизЛиц.ПодразделениеОрганизации.Владелец = &парамОрганизация";
		КонецЕсли;
	Иначе
		ПоВсемПодразделениямОрганизации = Ложь;
		УсловиеНаПодразделение = "СписокФизЛиц.ПодразделениеОрганизации В ИЕРАРХИИ (&парамПодразделение)";
	КонецЕсли;
	
	//СписокРаботниковТекст
	//Описание:
	//	Выбирает список работников, отвечающих условиям отбора, числящихся на начало месяца и принятых за месяц,
	//  а также переведенных в середине месяца из других обособленных подразделений
	СписокРаботниковТекст = "
	|		// срез работников на начало месяца
	|		ВЫБРАТЬ
	|			СписокФизЛиц.Сотрудник.Физлицо КАК Физлицо
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|					&парамНачало, 
	|					Организация = &парамГоловнаяОрганизация 
	|					" + ?(СписокФизЛиц <> Неопределено, "И Сотрудник.ФизЛицо В (&парамСписокФизЛиц)", "") + ") КАК СписокФизЛиц
	|		ГДЕ
	|			СписокФизЛиц.ОбособленноеПодразделение = &парамОрганизация
	|			И СписокФизЛиц.Организация = &парамГоловнаяОрганизация
	|			И СписокФизЛиц.ПричинаИзмененияСостояния <> &Уволен
	|		"+?(ПоВсемПодразделениямОрганизации, "", "И "+УсловиеНаПодразделение)+"
	|		
	|		ОБЪЕДИНИТЬ
	|
	|		// движения работников за месяц
	|		ВЫБРАТЬ
	|			СписокФизЛиц.Сотрудник.Физлицо
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК СписокФизЛиц
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|									ТекущееНазначение.Регистратор,
	|									ТекущееНазначение.НомерСтроки,
	|									МАКСИМУМ(ПредыдущееНазначение.Период) КАК ДатаПредыдущегоНазначения
	|								ИЗ
	|									РегистрСведений.РаботникиОрганизаций КАК ТекущееНазначение
	|									ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПредыдущееНазначение
	|										ПО ТекущееНазначение.Сотрудник = ПредыдущееНазначение.Сотрудник
	|											И ПредыдущееНазначение.Организация = &парамГоловнаяОрганизация
	|											И ПредыдущееНазначение.Период < ТекущееНазначение.Период
	|								ГДЕ
	|									ТекущееНазначение.Период > &парамНачало
	|									И ТекущееНазначение.Период <= &парамКонец
	|									И ТекущееНазначение.Организация = &парамГоловнаяОрганизация
	|									И ТекущееНазначение.ОбособленноеПодразделение = &парамОрганизация
	|									" + ?(СписокФизЛиц <> Неопределено, "И ТекущееНазначение.Сотрудник.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|								СГРУППИРОВАТЬ ПО
	|									ТекущееНазначение.Регистратор,
	|									ТекущееНазначение.НомерСтроки) КАК ДатыПредыдущихНазначений
	|				ПО СписокФизЛиц.Регистратор = ДатыПредыдущихНазначений.Регистратор
	|					И СписокФизЛиц.НомерСтроки = ДатыПредыдущихНазначений.НомерСтроки
	|					
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК ПредыдущиеНазначения
	|				ПО СписокФизЛиц.Сотрудник = ПредыдущиеНазначения.Сотрудник
	|					И ПредыдущиеНазначения.Организация = &парамГоловнаяОрганизация
	|					И ДатыПредыдущихНазначений.ДатаПредыдущегоНазначения = ПредыдущиеНазначения.Период
	|		
	|		ГДЕ
	|			СписокФизЛиц.Период > &парамНачало
	|			И СписокФизЛиц.Период <= &парамКонец
	|			И СписокФизЛиц.Организация = &парамГоловнаяОрганизация
	|			И (СписокФизЛиц.ПричинаИзмененияСостояния = &Принят
	|					ИЛИ СписокФизЛиц.ОбособленноеПодразделение <> ПредыдущиеНазначения.ОбособленноеПодразделение)
	|			И СписокФизЛиц.ОбособленноеПодразделение = &парамОрганизация
	|			" + ?(ПоВсемПодразделениямОрганизации, "", "И "+УсловиеНаПодразделение) + "
	|			" + ?(СписокФизЛиц <> Неопределено, "И СписокФизЛиц.Сотрудник.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|
	|		ОБЪЕДИНИТЬ
	|
	|		ВЫБРАТЬ
	|			СписокФизЛиц.Сотрудник.Физлицо
	|		ИЗ
	|			РегистрСведений.ДоговорникиОрганизаций КАК СписокФизЛиц
	|
	|		ГДЕ
	|			СписокФизЛиц.ДатаОкончания >= &парамНачало И
	|			СписокФизЛиц.ДатаНачала <= &парамКонец И
	|			СписокФизЛиц.Организация = &парамОрганизация
	|			" + ?(ПоВсемПодразделениямОрганизации, "", "И "+УсловиеНаПодразделение) + "
	|			" + ?(СписокФизЛиц <> Неопределено, " И СписокФизЛиц.Сотрудник.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|";

	Если ПостроительЗапроса <> Неопределено Тогда

		// Установим параметры запроса
		ПостроительЗапроса.Параметры.Вставить("парамНачало" , ПериодРегистрации);
		ПостроительЗапроса.Параметры.Вставить("парамКонец" , КонецМесяца(ПериодРегистрации));
		ПостроительЗапроса.Параметры.Вставить("парамОрганизация" , Организация);
		ПостроительЗапроса.Параметры.Вставить("парамГоловнаяОрганизация" , ГоловнаяОрганизация);
		ПостроительЗапроса.Параметры.Вставить("парамПользователь" , Ответственный);
		ПостроительЗапроса.Параметры.Вставить("парамПодразделение" , ПодразделениеОрганизации);
		ПостроительЗапроса.Параметры.Вставить("Уволен", Перечисления.ПричиныИзмененияСостояния.Увольнение);
		ПостроительЗапроса.Параметры.Вставить("Принят", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
		ПостроительЗапроса.Параметры.Вставить("парамПриход", ВидДвиженияНакопления.Приход);
		ПостроительЗапроса.Параметры.Вставить("парамНалогВзнос", Перечисления.ВидыПлатежейВБюджетИФонды.Налог);
		ПостроительЗапроса.Параметры.Вставить("парамИсчисление", Перечисления.РасчетыСБюджетомФондамиВидСтроки.Исчисление);
		ПостроительЗапроса.Параметры.Вставить("парамВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
		ПостроительЗапроса.Параметры.Вставить("парамСписокФизЛиц", СписокФизЛиц);
		ПостроительЗапроса.Параметры.Вставить("парамИнвалид", Перечисления.ОтношениеКИнвалидности.Инвалид);
		
		ИсходныйТекстПостроителя = ПостроительЗапроса.Текст;
		СписокРаботниковТекст = СтрЗаменить(ИсходныйТекстПостроителя,"РАЗРЕШЕННЫЕ","");
		СписокРаботниковТекст = Лев(СписокРаботниковТекст, Найти(СписокРаботниковТекст,"УПОРЯДОЧИТЬ") - 1);
		
	КонецЕсли;

	// Еще берем людей, которые не являются работниками или договорниками, но
	// за месяц расчета имеют налогооблагаемый доход, и по которым еще не был рассчитан 
	// налог в периоде регистрации
	СписокРаботниковТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизации.ФизЛицо
	|ПОМЕСТИТЬ ВТ_СписокРаботников
	|ИЗ
	|	(" + СписокРаботниковТекст + ") КАК РаботникиОрганизации
	|
	|" + ?(СписокФизЛиц <> Неопределено, " ГДЕ РаботникиОрганизации.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	СНСведенияОДоходах.ФизЛицо
	|ИЗ
	|	РегистрНакопления.СНСведенияОДоходах КАК СНСведенияОДоходах 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&парамКонец, 
	|				Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизации
	|		ПО СНСведенияОДоходах.ФизЛицо = РаботникиОрганизации.Сотрудник.ФизЛицо
	|			И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
	|           И (ВЫБОР 
	|				КОГДА (РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|					И РаботникиОрганизации.Период > &парамНачало)
	|					ИЛИ РаботникиОрганизации.ПричинаИзмененияСостояния <> &Уволен
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|							ДоговорникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо
	|						ИЗ
	|							РегистрСведений.ДоговорникиОрганизаций КАК ДоговорникиОрганизации
	|						ГДЕ
	|							ДоговорникиОрганизации.ДатаОкончания >= &парамНачало И
	|							ДоговорникиОрганизации.ДатаНачала <= &парамКонец И
	|							ДоговорникиОрганизации.Организация = &парамОрганизация) КАК ДоговорникиОрганизации
	|		ПО СНСведенияОДоходах.ФизЛицо = ДоговорникиОрганизации.ФизЛицо		
	|				
	|ГДЕ
	|	СНСведенияОДоходах.ПериодРегистрации = &парамНачало И
	|	СНСведенияОДоходах.Организация = &парамОрганизация И
	|	РаботникиОрганизации.Сотрудник ЕСТЬ NULL И
	|	ДоговорникиОрганизации.ФизЛицо ЕСТЬ NULL
	|	" + ?(СписокФизЛиц <> Неопределено, "И СНСведенияОДоходах.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	СОСведенияОДоходах.ФизЛицо 
	|ИЗ
	|	РегистрНакопления.СОСведенияОДоходах КАК СОСведенияОДоходах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&парамКонец, 
	|				Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизации
	|		ПО СОСведенияОДоходах.ФизЛицо = РаботникиОрганизации.Сотрудник.ФизЛицо
	|			И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
	|           И (ВЫБОР 
	|				КОГДА (РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|					И РаботникиОрганизации.Период > &парамНачало)
	|					ИЛИ РаботникиОрганизации.ПричинаИзмененияСостояния <> &Уволен
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|							ДоговорникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо
	|						ИЗ
	|							РегистрСведений.ДоговорникиОрганизаций КАК ДоговорникиОрганизации
	|						ГДЕ
	|							ДоговорникиОрганизации.ДатаОкончания >= &парамНачало И
	|							ДоговорникиОрганизации.ДатаНачала <= &парамКонец И
	|							ДоговорникиОрганизации.Организация = &парамОрганизация) КАК ДоговорникиОрганизации
	|		ПО СОСведенияОДоходах.ФизЛицо = ДоговорникиОрганизации.ФизЛицо						
	|
	|ГДЕ
	|	СОСведенияОДоходах.ПериодРегистрации = &парамНачало И
	|	СОСведенияОДоходах.Организация = &парамОрганизация И
	//-=-=
	//Ограничено получение сведений по контрагентам в рамках реализации СО за ГПХ 
	|	СОСведенияОДоходах.ФизЛицо ССЫЛКА Справочник.ФизическиеЛица И
	//-=-=
	|	РаботникиОрганизации.Сотрудник ЕСТЬ NULL И
	|	ДоговорникиОрганизации.ФизЛицо ЕСТЬ NULL
	|	" + ?(СписокФизЛиц <> Неопределено, "И СОСведенияОДоходах.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	ОППВСведенияОДоходах.ФизЛицо 
	|ИЗ
	|	РегистрНакопления.ОППВСведенияОДоходах КАК ОППВСведенияОДоходах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&парамКонец, 
	|				Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизации
	|		ПО ОППВСведенияОДоходах.ФизЛицо = РаботникиОрганизации.Сотрудник.ФизЛицо
	|			И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
	|           И (ВЫБОР 
	|				КОГДА (РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|					И РаботникиОрганизации.Период >= &парамНачало)
	|					ИЛИ РаботникиОрганизации.ПричинаИзмененияСостояния <> &Уволен
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|
	|ГДЕ
	|	ОППВСведенияОДоходах.ПериодРегистрации = &парамНачало И
	|	ОППВСведенияОДоходах.Организация = &парамОрганизация И
	|	РаботникиОрганизации.Сотрудник ЕСТЬ NULL
	
	|	" + ?(СписокФизЛиц <> Неопределено, "И ОППВСведенияОДоходах.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|
	|ОБЪЕДИНИТЬ 
	|
	|ВЫБРАТЬ
	|	ООСМССведенияОДоходах.ФизЛицо 
	|ИЗ
	|	РегистрНакопления.ООСМССведенияОДоходах КАК ООСМССведенияОДоходах
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&парамКонец, 
	|				Организация = &парамГоловнаяОрганизация) КАК РаботникиОрганизации
	|		ПО ООСМССведенияОДоходах.ФизЛицо = РаботникиОрганизации.Сотрудник.ФизЛицо
	|			И РаботникиОрганизации.ОбособленноеПодразделение = &парамОрганизация
	|           И (ВЫБОР 
	|				КОГДА (РаботникиОрганизации.ПричинаИзмененияСостояния = &Уволен
	|					И РаботникиОрганизации.Период > &парамНачало)
	|					ИЛИ РаботникиОрганизации.ПричинаИзмененияСостояния <> &Уволен
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|							ДоговорникиОрганизации.Сотрудник.ФизЛицо КАК ФизЛицо
	|						ИЗ
	|							РегистрСведений.ДоговорникиОрганизаций КАК ДоговорникиОрганизации
	|						ГДЕ
	|							ДоговорникиОрганизации.ДатаОкончания >= &парамНачало И
	|							ДоговорникиОрганизации.ДатаНачала <= &парамКонец И
	|							ДоговорникиОрганизации.Организация = &парамОрганизация) КАК ДоговорникиОрганизации
	|		ПО ООСМССведенияОДоходах.ФизЛицо = ДоговорникиОрганизации.ФизЛицо						
	|
	|ГДЕ
	|	ООСМССведенияОДоходах.ПериодРегистрации = &парамНачало И
	|	ООСМССведенияОДоходах.Организация = &парамОрганизация И
	|	РаботникиОрганизации.Сотрудник ЕСТЬ NULL И
	|	ДоговорникиОрганизации.ФизЛицо ЕСТЬ NULL
	|	" + ?(СписокФизЛиц <> Неопределено, "И ООСМССведенияОДоходах.ФизЛицо В (&парамСписокФизЛиц)", "") + "
	|";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = СписокРаботниковТекст;
		Запрос.Выполнить();
		СписокРаботниковТекст = "ВТ_СписокРаботников";
	Иначе		
		СписокРаботниковТекст = СтрЗаменить(СписокРаботниковТекст,"РАЗРЕШЕННЫЕ","");
		СписокРаботниковТекст = "(" + СтрЗаменить(СписокРаботниковТекст,"ПОМЕСТИТЬ ВТ_СписокРаботников","") + ")";
	КонецЕсли;

	Если мОрганизацияЯвляетсяПлательщикомСН Тогда

		Если РасчетСНдляИП Тогда
			
			// заполнение табличной части "ИсчисленныйСН" для ИП, если налоговый режим не на основе упрощенной декларации
			ИсчисленныйСНТекст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
			|	Работники.ФизЛицо,
			|	&парамНачало КАК МесяцНалоговогоПериода
			|ИЗ
			|	" + СписокРаботниковТекст + " КАК Работники
			|
			|";
		Иначе 

			// заполнение табличной части "ИсчисленныйСН"  для юр. лиц
			ИсчисленныйСНТекст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
			|	Работники.ФизЛицо,
			|	&парамНачало КАК МесяцНалоговогоПериода
			|ИЗ
			|	РегистрНакопления.СНСведенияОДоходах КАК СНСведенияОДоходах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокРаботниковТекст + " КАК Работники
			|		ПО СНСведенияОДоходах.ФизЛицо = Работники.ФизЛицо
			//-=-=
			|			И Работники.ФизЛицо ССЫЛКА Справочник.ФизическиеЛица
			//-=-=
			|
			|ГДЕ
			|	СНСведенияОДоходах.ПериодРегистрации = &парамНачало И
			|	СНСведенияОДоходах.Организация = &парамОрганизация
			|";
		КонецЕсли;
				
		Если ПостроительЗапроса = Неопределено Тогда
			Запрос.Текст = ИсчисленныйСНТекст;
			ТЗИсчисленныйСН = Запрос.Выполнить().Выгрузить();
		Иначе
			ПостроительЗапроса.Текст = ИсчисленныйСНТекст;
			ПостроительЗапроса.Выполнить();
			ТЗИсчисленныйСН = ПостроительЗапроса.Результат.Выгрузить();
		КонецЕсли;
		
		// переносим в табличную часть документа, не затирая существующие строки
		Для Каждого СтрокаТЗ Из ТЗИсчисленныйСН Цикл
			НоваяСтрока = ИсчисленныйСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
	
	КонецЕсли;
	
	// заполнение табличной части "ИсчисленныеСО"
	
	// ФизлицаБезСоциальногоСтрахования
	//	Поля:
	//		Физлицо
	//
	//	Описание:
	//	список физлиц не подлежащих социальному страхованию
	ФизлицаБезСоциальногоСтрахованияТекст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ГражданствоФизЛиц.ФизЛицо
	|ПОМЕСТИТЬ ВТ_ФизлицаБезСоциальногоСтрахования
	|ИЗ
	|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|				&парамКонец,
	|				" + ?(СписокФизЛиц <> Неопределено, "ФизЛицо В (&парамСписокФизЛиц)", "") + ") КАК ГражданствоФизЛиц
	|
	|ГДЕ
	|	(ГражданствоФизЛиц.НеПодлежитСоциальномуСтрахованию)";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ФизлицаБезСоциальногоСтрахованияТекст;
		Запрос.Выполнить();
		ФизлицаБезСоциальногоСтрахованияТекст = "ВТ_ФизлицаБезСоциальногоСтрахования";
	Иначе		
		ФизлицаБезСоциальногоСтрахованияТекст = СтрЗаменить(ФизлицаБезСоциальногоСтрахованияТекст,"РАЗРЕШЕННЫЕ","");
		ФизлицаБезСоциальногоСтрахованияТекст = "(" + СтрЗаменить(ФизлицаБезСоциальногоСтрахованияТекст,"ПОМЕСТИТЬ ВТ_ФизлицаБезСоциальногоСтрахования","") + ")";
	КонецЕсли;
	
	// ФизлицаПенсионеры
	//	Поля:
	//		Физлицо
	//
	//	Описание:
	//	список физлиц достигших пенсионный возраст
	ФизлицаПенсионерыТекст = "
    |ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	СведенияОПенсионномОбеспеченииФизЛиц.ФизЛицо
	|ПОМЕСТИТЬ ВТ_ФизлицаПенсионеры
	|ИЗ
	|	РегистрСведений.СведенияОПенсионномОбеспеченииФизЛиц.СрезПоследних(
	|				&парамКонец,
	|				" + ?(СписокФизЛиц <> Неопределено, "ФизЛицо В (&парамСписокФизЛиц)", "") + ") КАК СведенияОПенсионномОбеспеченииФизЛиц
	|
	|ГДЕ
	|	(СведенияОПенсионномОбеспеченииФизЛиц.Пенсионер)";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ФизлицаПенсионерыТекст;
		Запрос.Выполнить();
		ФизлицаПенсионерыТекст = "ВТ_ФизлицаПенсионеры";
	Иначе		
		ФизлицаПенсионерыТекст = СтрЗаменить(ФизлицаПенсионерыТекст,"РАЗРЕШЕННЫЕ","");
		ФизлицаПенсионерыТекст = "(" + СтрЗаменить(ФизлицаПенсионерыТекст,"ПОМЕСТИТЬ ВТ_ФизлицаПенсионеры","") + ")";
	КонецЕсли;

	ИсчисленныеСОТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Работники.ФизЛицо,
	|	&парамНачало КАК МесяцНалоговогоПериода
	|ИЗ
	|	РегистрНакопления.СОСведенияОДоходах КАК СОСведенияОДоходах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокРаботниковТекст + " КАК Работники
	|		ПО СОСведенияОДоходах.ФизЛицо = Работники.ФизЛицо
	|
	|ГДЕ
	|	СОСведенияОДоходах.ПериодРегистрации = &парамНачало И
	|	СОСведенияОДоходах.Организация = &парамОрганизация И
	|	СОСведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаПенсионерыТекст + " КАК ФизлицаПенсионеры) И
	|	СОСведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаБезСоциальногоСтрахованияТекст + " КАК ФизлицаБезСоциальногоСтрахования)
	|";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ИсчисленныеСОТекст;
		ТЗИсчисленныеСО = Запрос.Выполнить().Выгрузить();
	Иначе
		ПостроительЗапроса.Текст = ИсчисленныеСОТекст;
		ПостроительЗапроса.Выполнить();
		ТЗИсчисленныеСО = ПостроительЗапроса.Результат.Выгрузить();
	КонецЕсли;
	
	// переносим в табличную часть документа, не затирая существующие строки
	Для Каждого СтрокаТЗ Из ТЗИсчисленныеСО Цикл
		НоваяСтрока = ИсчисленныеСО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	// заполнение табличной части "ИсчисленныйОППВ"
	
	// ФизлицаБезПраваНаПенсию
	//	Поля:
	//		Физлицо
	//
	//	Описание:
	//	список физлиц не имеющих право на пенсионное обеспечение
	ФизлицаБезПраваНаПенсиюТекст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ГражданствоФизЛиц.ФизЛицо
	|ПОМЕСТИТЬ ВТ_ФизлицаБезПраваНаПенсию
	|ИЗ
	|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|				&парамКонец,
	|				" + ?(СписокФизЛиц <> Неопределено, "ФизЛицо В (&парамСписокФизЛиц)", "") + ") КАК ГражданствоФизЛиц
	|
	|ГДЕ
	|	(ГражданствоФизЛиц.НеИмеетПравоНаПенсию)";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ФизлицаБезПраваНаПенсиюТекст;
		Запрос.Выполнить();                                         		
		ФизлицаБезПраваНаПенсиюТекст = "ВТ_ФизлицаБезПраваНаПенсию";
	Иначе		
		ФизлицаБезПраваНаПенсиюТекст = СтрЗаменить(ФизлицаБезПраваНаПенсиюТекст,"РАЗРЕШЕННЫЕ","");
		ФизлицаБезПраваНаПенсиюТекст = "(" + СтрЗаменить(ФизлицаБезПраваНаПенсиюТекст,"ПОМЕСТИТЬ ВТ_ФизлицаБезПраваНаПенсию","") + ")";
	КонецЕсли;
	
	Если мОрганизацияЯвляетсяВкладчикомОППВ Тогда
		
		ИсчисленныйОППВТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	Работники.ФизЛицо,
		|	&парамНачало КАК МесяцНалоговогоПериода
		|ИЗ
		|	РегистрНакопления.ОППВСведенияОДоходах КАК ОППВСведенияОДоходах
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокРаботниковТекст + " КАК Работники
		|		ПО ОППВСведенияОДоходах.ФизЛицо = Работники.ФизЛицо
		|
		|ГДЕ
		|	ОППВСведенияОДоходах.ПериодРегистрации = &парамНачало И
		|	ОППВСведенияОДоходах.Организация = &парамОрганизация И
		|	ОППВСведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаПенсионерыТекст + " КАК ФизлицаПенсионеры) И
		|	ОППВСведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаБезПраваНаПенсиюТекст + " КАК ФизлицаБезПраваНаПенсию)
		|";
		
		Если ПостроительЗапроса = Неопределено Тогда
			Запрос.Текст = ИсчисленныйОППВТекст;
			ТЗИсчисленныйОППВ = Запрос.Выполнить().Выгрузить();
		Иначе
			ПостроительЗапроса.Текст = ИсчисленныйОППВТекст;
			ПостроительЗапроса.Выполнить();
			ТЗИсчисленныйОППВ = ПостроительЗапроса.Результат.Выгрузить();
		КонецЕсли;
		
		// переносим в табличную часть документа, не затирая существующие строки
		Для Каждого СтрокаТЗ Из ТЗИсчисленныйОППВ Цикл
			НоваяСтрока = ИсчисленныйОППВ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		КонецЦикла;
		
	КонецЕсли; 	
	
	// заполнение табличной части "ИсчисленныйОПВР"
	
	ИсчисленныйОПВРТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Работники.ФизЛицо,
	|	&парамНачало КАК МесяцНалоговогоПериода
	|ИЗ
	|	РегистрНакопления.ОПВРСведенияОДоходах КАК ОПВРСведенияОДоходах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокРаботниковТекст + " КАК Работники
	|		ПО ОПВРСведенияОДоходах.ФизЛицо = Работники.ФизЛицо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО ОПВРСведенияОДоходах.ФизЛицо = ФизическиеЛица.Ссылка
	|			И (ФизическиеЛица.ДатаРождения >= ДАТАВРЕМЯ(1975, 1, 1)
	|			ИЛИ ФизическиеЛица.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ГДЕ
	|	ОПВРСведенияОДоходах.ПериодРегистрации = &парамНачало И
	|	ОПВРСведенияОДоходах.Организация = &парамОрганизация И
	|	ОПВРСведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаПенсионерыТекст + " КАК ФизлицаПенсионеры) И
	|	ОПВРСведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаБезПраваНаПенсиюТекст + " КАК ФизлицаБезПраваНаПенсию)
	|";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ИсчисленныйОПВРТекст;
		ТЗИсчисленныйОПВР = Запрос.Выполнить().Выгрузить();
	Иначе
		ПостроительЗапроса.Текст = ИсчисленныйОПВРТекст;
		ПостроительЗапроса.Выполнить();
		ТЗИсчисленныйОПВР = ПостроительЗапроса.Результат.Выгрузить();
	КонецЕсли;
	
	// переносим в табличную часть документа, не затирая существующие строки
	Для Каждого СтрокаТЗ Из ТЗИсчисленныйОПВР Цикл
		НоваяСтрока = ИсчисленныйОПВР.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	// заполнение табличной части "ИсчисленныеООСМС"
	
	// ФизлицаБезМедицинскогоСоциальногоСтрахования
	//	Поля:
	//		Физлицо
	//
	//	Описание:
	//	список физлиц не подлежащих социальному страхованию
	ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ГражданствоФизЛиц.ФизЛицо
	|ПОМЕСТИТЬ ВТ_ФизлицаБезМедицинскогоСоциальногоСтрахования
	|ИЗ
	|	РегистрСведений.ГражданствоФизЛиц.СрезПоследних(
	|				&парамКонец,
	|				" + ?(СписокФизЛиц <> Неопределено, "ФизЛицо В (&парамСписокФизЛиц)", "") + ") КАК ГражданствоФизЛиц
	|
	|ГДЕ
	|	(ГражданствоФизЛиц.НеПодлежитСоциальномуМедицинскомуСтрахованию)";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст;
		Запрос.Выполнить();
		ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст = "ВТ_ФизлицаБезМедицинскогоСоциальногоСтрахования";
	Иначе		
		ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст = СтрЗаменить(ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст,"РАЗРЕШЕННЫЕ","");
		ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст = "(" + СтрЗаменить(ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст,"ПОМЕСТИТЬ ВТ_ФизлицаБезМедицинскогоСоциальногоСтрахования","") + ")";
	КонецЕсли;
	
	// ФизлицаИнвалиды
	//	Поля:
	//		Физлицо
	//
	//	Описание:
	//	список физлиц-инвалидов
	ФизлицаИнвалидыТекст = "
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СведенияОбИнвалидностиФизлиц.ФизЛицо
	|ПОМЕСТИТЬ ВТ_ФизлицаИнвалиды
	|ИЗ
	|	РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&парамКонец,
	|				" + ?(СписокФизЛиц <> Неопределено, "ФизЛицо В (&парамСписокФизЛиц)", "") + ") КАК СведенияОбИнвалидностиФизлиц
	|
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.ОтношениеКИнвалидности = &парамИнвалид
	|	И (СведенияОбИнвалидностиФизлиц.СрокДействияСправки = ДАТАВРЕМЯ(1,1,1) ИЛИ КОНЕЦПЕРИОДА(СведенияОбИнвалидностиФизлиц.СрокДействияСправки, ДЕНЬ) >= &парамКонец)
	|";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ФизлицаИнвалидыТекст;
		Запрос.Выполнить();
		ФизлицаИнвалидыТекст = "ВТ_ФизлицаИнвалиды";
	Иначе		
		ФизлицаИнвалидыТекст = СтрЗаменить(ФизлицаИнвалидыТекст,"РАЗРЕШЕННЫЕ","");
		ФизлицаИнвалидыТекст = "(" + СтрЗаменить(ФизлицаИнвалидыТекст,"ПОМЕСТИТЬ ВТ_ФизлицаИнвалиды","") + ")";
	КонецЕсли;
	
	// ФизлицаУчастникиВОВ
	//	Поля:
	//		Физлицо
	//
	//	Описание:
	//	список физлиц участников и инвалидов ВОВ
	ФизлицаУчастникиВОВТекст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияОФизлицахУчастникахВОВ.ФизЛицо
	|ПОМЕСТИТЬ ВТ_ФизлицаУчастникиВОВ
	|ИЗ
	|	РегистрСведений.СведенияОФизлицахУчастникахВОВ.СрезПоследних(&парамКонец,
	|				" + ?(СписокФизЛиц <> Неопределено, "ФизЛицо В (&парамСписокФизЛиц)", "") + ") КАК СведенияОФизлицахУчастникахВОВ
	|
	|ГДЕ
	|	СведенияОФизлицахУчастникахВОВ.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииФизлицУчастниковВОВ.УчастникВОВ)
	|	ИЛИ СведенияОФизлицахУчастникахВОВ.Статус = ЗНАЧЕНИЕ(Перечисление.КатегорииФизлицУчастниковВОВ.ИнвалидВОВ)
	|";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ФизлицаУчастникиВОВТекст;
		Запрос.Выполнить();
		ФизлицаУчастникиВОВТекст = "ВТ_ФизлицаУчастникиВОВ";
	Иначе		
		ФизлицаУчастникиВОВТекст = СтрЗаменить(ФизлицаУчастникиВОВТекст,"РАЗРЕШЕННЫЕ","");
		ФизлицаУчастникиВОВТекст = "(" + СтрЗаменить(ФизлицаУчастникиВОВТекст,"ПОМЕСТИТЬ ВТ_ФизлицаУчастникиВОВ","") + ")";
	КонецЕсли;

	ИсчисленныеООСМСТекст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Работники.ФизЛицо,
	|	&парамНачало КАК МесяцНалоговогоПериода
	|ИЗ
	|	РегистрНакопления.ООСМССведенияОДоходах КАК ООСМССведенияОДоходах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + СписокРаботниковТекст + " КАК Работники
	|		ПО ООСМССведенияОДоходах.ФизЛицо = Работники.ФизЛицо
	|
	|ГДЕ
	|	ООСМССведенияОДоходах.ПериодРегистрации = &парамНачало И
	|	ООСМССведенияОДоходах.Организация = &парамОрганизация И
	|	ООСМССведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаБезМедицинскогоСоциальногоСтрахованияТекст + " КАК ФизлицаБезМедицинскогоСоциальногоСтрахования) И
	|	ООСМССведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаИнвалидыТекст + " КАК ФизлицаИнвалиды) И
	|	ООСМССведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаПенсионерыТекст + " КАК ФизлицаПенсионеры) И
	|	ООСМССведенияОДоходах.ФизЛицо НЕ В (ВЫБРАТЬ ФизЛицо ИЗ " + ФизлицаУчастникиВОВТекст + " КАК ФизлицаУчастникиВОВ)
	|";
	
	Если ПостроительЗапроса = Неопределено Тогда
		Запрос.Текст = ИсчисленныеООСМСТекст;
		ТЗИсчисленныеООСМС = Запрос.Выполнить().Выгрузить();
	Иначе
		ПостроительЗапроса.Текст = ИсчисленныеООСМСТекст;
		ПостроительЗапроса.Выполнить();
		ТЗИсчисленныеООСМС = ПостроительЗапроса.Результат.Выгрузить();
	КонецЕсли;
	
	// переносим в табличную часть документа, не затирая существующие строки
	Для Каждого СтрокаТЗ Из ТЗИсчисленныеООСМС Цикл
		НоваяСтрока = ИсчисленныеОтчисленияОСМС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // Автозаполнение()

// Процедура рассчитывает ресурсы всех наборов записей и заполняет 
// реквизиты Результат всех табличных частей документа.
//
Процедура Рассчитать(Физлицо = Неопределено, РассчитатьСНиСО = Истина, РассчитатьОППВ = Истина, РассчитатьООСМС = Истина, РассчитатьОПВР = Истина, КомментироватьРасчет = Ложь) Экспорт
	
	Отказ = Ложь;
	
	НачатьТранзакцию();
	
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	// позиционируем выборку
	ВыборкаПоШапкеДокумента.Следующий();
	
	ИсчислениеНалоговСтруктурныхЕдиниц = глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц");

	Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ВыборкаПоШапкеДокумента.Организация, 
																		ВыборкаПоШапкеДокумента.Организация, 
																		ИсчислениеНалоговСтруктурныхЕдиниц, 
																		Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	Иначе
		Налогоплательщик = ВыборкаПоШапкеДокумента.Организация;
	КонецЕсли;
	
	// узнаем учетную политику по налоговому учету
	мОрганизацияЯвляетсяПлательщикомСН = ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаСоциальногоНалога(Организация, ПериодРегистрации);
	мОрганизацияЯвляетсяВкладчикомОППВ = ВыборкаПоШапкеДокумента.ОрганизацияЯвляетсяВкладчикомОППВ;
	
	// Определим структуру дополнительных параметров 
	ДополнительныеПараметрыЗапроса = Новый Структура();
	ДополнительныеПараметрыЗапроса.Вставить("парамФизЛицо", ФизЛицо);
	ДополнительныеПараметрыЗапроса.Вставить("парамОрганизация", ВыборкаПоШапкеДокумента.Организация);
	ДополнительныеПараметрыЗапроса.Вставить("парамГоловнаяОрганизация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);

	Если РассчитатьОППВ Тогда
		// ОППВ
		Если мОрганизацияЯвляетсяВкладчикомОППВ Тогда
			
			//Очистим движения
			НаборОППВРасчетыСФондами = РегистрыНакопления.ОППВРасчетыСФондами.СоздатьНаборЗаписей();
			НаборОППВРасчетыСФондами.Отбор.Регистратор.Значение = Ссылка;
			НаборОППВРасчетыСФондами.Записать();// сначала удалим существующие движения
			
			// Составим текст запроса для выбора списка физлиц, по которым надо считать ОППВ
			СписокФизлицТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Работники.Физлицо КАК Физлицо
			|ИЗ
			|	Документ.РасчетСНиСО.ИсчисленныйОППВ КАК Работники
			|
			|ГДЕ
			|	Работники.Ссылка = &парамРегистратор
			|	" + ?(ФизЛицо <> Неопределено, "И Работники.ФизЛицо В (&парамФизЛицо)", "");
			
			ДанныеОППВ = ПроведениеРасчетовПолныеПрава.ПолучитьДанныеДляРасчетаОППВ(Неопределено, ВыборкаПоШапкеДокумента.ПериодРегистрации, Налогоплательщик, ВыборкаПоШапкеДокумента.Ссылка, СписокФизлицТекст, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, ДополнительныеПараметрыЗапроса);
			Если ДанныеОППВ <> НеОпределено Тогда
				ПроведениеРасчетов.ЗаполнитьНаборЗаписейПоДаннымОППВ(ИсчисленныйОППВ, ПериодРегистрации, НаборОППВРасчетыСФондами, ДанныеОППВ, Налогоплательщик, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, , КомментироватьРасчет, ФизЛицо, НЕ ВыборкаПоШапкеДокумента.РаспределятьНалогиПоСтруктурнымЕдиницам);
			КонецЕсли;
			
			// Удаляем движения
			НаборОППВРасчетыСФондами.Очистить();
			НаборОППВРасчетыСФондами.Записать();
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если РассчитатьОПВР Тогда
		// ОПВР
		
		//Очистим движения
		НаборОПВРРасчетыСФондами = РегистрыНакопления.ОПВРРасчетыСФондами.СоздатьНаборЗаписей();
		НаборОПВРРасчетыСФондами.Отбор.Регистратор.Значение = Ссылка;
		НаборОПВРРасчетыСФондами.Записать();// сначала удалим существующие движения
		
		// Составим текст запроса для выбора списка физлиц, по которым надо считать ОПВР
		СписокФизлицТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныйОПВР КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &парамРегистратор
		|	" + ?(ФизЛицо <> Неопределено, "И Работники.ФизЛицо В (&парамФизЛицо)", "");
		
		ДанныеОПВР = ПроведениеРасчетовПолныеПрава.ПолучитьДанныеДляРасчетаОПВР(Неопределено, ВыборкаПоШапкеДокумента.ПериодРегистрации, Налогоплательщик, ВыборкаПоШапкеДокумента.Ссылка, СписокФизлицТекст, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, ДополнительныеПараметрыЗапроса);
		Если ДанныеОПВР <> НеОпределено Тогда
			ПроведениеРасчетов.ЗаполнитьНаборЗаписейПоДаннымОПВР(ИсчисленныйОПВР, ПериодРегистрации, НаборОПВРРасчетыСФондами, ДанныеОПВР, Налогоплательщик, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, , КомментироватьРасчет, ФизЛицо, НЕ ВыборкаПоШапкеДокумента.РаспределятьНалогиПоСтруктурнымЕдиницам);
		КонецЕсли;
		
		// Удаляем движения
		НаборОПВРРасчетыСФондами.Очистить();
		НаборОПВРРасчетыСФондами.Записать();
		
	КонецЕсли;
	
	Если РассчитатьСНиСО Тогда
		// СО
		//Очистим движения
		НаборСОРасчетыСФондами = РегистрыНакопления.СОРасчетыСФондами.СоздатьНаборЗаписей();
		НаборСОРасчетыСФондами.Отбор.Регистратор.Значение = Ссылка;
		НаборСОРасчетыСФондами.Записать();// сначала удалим существующие движения
		
		// Составим текст запроса для выбора списка физлиц, по которым надо считать СО
		СписокФизлицТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныеСО КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &парамРегистратор
		|	" + ?(ФизЛицо <> Неопределено, "И Работники.ФизЛицо В (&парамФизЛицо)", "");
		
		ДанныеСО = ПроведениеРасчетовПолныеПрава.ПолучитьДанныеДляРасчетаСО(Неопределено, ВыборкаПоШапкеДокумента.ПериодРегистрации, Налогоплательщик, ВыборкаПоШапкеДокумента.Ссылка, СписокФизлицТекст, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, ДополнительныеПараметрыЗапроса);
		Если ДанныеСО <> НеОпределено Тогда
			ПроведениеРасчетов.ЗаполнитьНаборЗаписейПоДаннымСО(ИсчисленныеСО, ПериодРегистрации, НаборСОРасчетыСФондами, ДанныеСО, Налогоплательщик, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, , КомментироватьРасчет, ФизЛицо, НЕ ВыборкаПоШапкеДокумента.РаспределятьНалогиПоСтруктурнымЕдиницам);
		КонецЕсли;
		
		НаборСОРасчетыСФондами.Записать();
		
		// СН
		Если мОрганизацияЯвляетсяПлательщикомСН Тогда
			
			// Составим текст запроса для выбора списка физлиц, по которым надо считать СН
			СписокФизлицТекст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Работники.Физлицо КАК Физлицо
			|ИЗ
			|	Документ.РасчетСНиСО.ИсчисленныйСН КАК Работники
			|
			|ГДЕ
			|	Работники.Ссылка = &парамРегистратор
			|	" + ?(ФизЛицо <> Неопределено, "И Работники.ФизЛицо В (&парамФизЛицо)", "");
			
			// получение результата СН по регрессивной шкале ставок
			ДанныеСН = ПроведениеРасчетовПолныеПрава.ПолучитьДанныеДляРасчетаСН(Неопределено, ПериодРегистрации,  Налогоплательщик, ВыборкаПоШапкеДокумента.ГоловнаяОрганизация, Ссылка, СписокФизлицТекст, ДополнительныеПараметрыЗапроса);
			Если ДанныеСН <> НеОпределено Тогда
				ПроведениеРасчетов.ЗаполнитьТабличнуюЧастьПоДаннымСН(ИсчисленныйСН, ПериодРегистрации, ДанныеСН, Налогоплательщик, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, , КомментироватьРасчет, ФизЛицо, НЕ ВыборкаПоШапкеДокумента.РаспределятьНалогиПоСтруктурнымЕдиницам);
			КонецЕсли;
			
		КонецЕсли;
		
		// Удаляем движения
		НаборСОРасчетыСФондами.Очистить();
		НаборСОРасчетыСФондами.Записать();
		
	КонецЕсли;

	Если РассчитатьООСМС Тогда
		// ООСМС
		//Очистим движения
		НаборООСМСРасчетыСФондами = РегистрыНакопления.ООСМСРасчетыСФондами.СоздатьНаборЗаписей();
		НаборООСМСРасчетыСФондами.Отбор.Регистратор.Значение = Ссылка;
		НаборООСМСРасчетыСФондами.Записать();// сначала удалим существующие движения
		
		// Составим текст запроса для выбора списка физлиц, по которым надо считать ООСМС
		СписокФизлицТекст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Работники.Физлицо КАК Физлицо
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныеОтчисленияОСМС КАК Работники
		|
		|ГДЕ
		|	Работники.Ссылка = &парамРегистратор
		|	" + ?(ФизЛицо <> Неопределено, "И Работники.ФизЛицо В (&парамФизЛицо)", "");
		
		ДанныеООСМС = ПроведениеРасчетовПолныеПрава.ПолучитьДанныеДляРасчетаООСМС(Неопределено, ВыборкаПоШапкеДокумента.ПериодРегистрации, Налогоплательщик, ВыборкаПоШапкеДокумента.Ссылка, СписокФизлицТекст, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, ДополнительныеПараметрыЗапроса);
		Если ДанныеООСМС <> НеОпределено Тогда
			ПроведениеРасчетов.ЗаполнитьНаборЗаписейПоДаннымООСМС(ИсчисленныеОтчисленияОСМС, ПериодРегистрации, НаборСОРасчетыСФондами, ДанныеООСМС, Налогоплательщик, ВыборкаПоШапкеДокумента.Организация, ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, ,КомментироватьРасчет, ФизЛицо, НЕ ВыборкаПоШапкеДокумента.РаспределятьНалогиПоСтруктурнымЕдиницам);
		КонецЕсли;
		
		// Удаляем движения
		НаборООСМСРасчетыСФондами.Очистить();
		НаборООСМСРасчетыСФондами.Записать();
		
	КонецЕсли;

	// Завершаем транзакцию
	ЗафиксироватьТранзакцию();	
	
КонецПроцедуры  // Рассчитать()

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеПользователями.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;
	
	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	//так как нет печатных форм у документа, по умолчанию
	ТабДокумент = Неопределено;
	
	Если ТабДокумент = Неопределено Тогда
		Возврат
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект));

КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура();

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа.
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ПериодРегистрации" , ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация" , Организация);

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Дата, 
	|	ДанныеДокумента.Организация, 
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) 
	|			ТОГДА ДанныеДокумента.Организация
	|		ИНАЧЕ ДанныеДокумента.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ДанныеДокумента.Ответственный, 
	|	ДанныеДокумента.ПериодРегистрации, 
	| 	ДанныеДокумента.Ссылка,
	|	ЕСТЬNULL(УчетнаяПолитикаНУ.ОтражениеПоПериодуРегистрации, ЛОЖЬ) КАК ОтражениеПоПериодуРегистрации,
	|	ЕСТЬNULL(УчетнаяПолитикаНУ.РаспределятьНалогиПоСтруктурнымЕдиницам, ЛОЖЬ) КАК РаспределятьНалогиПоСтруктурнымЕдиницам,
	|	ЕСТЬNULL(УчетнаяПолитикаНУ.РаспределятьНалогиПоПодразделениямОрганизаций, ЛОЖЬ) КАК РаспределятьНалогиПоПодразделениямОрганизаций,
	|	ЕСТЬNULL(УчетнаяПолитикаНУ.ОрганизацияЯвляетсяВкладчикомОППВ, ЛОЖЬ) КАК ОрганизацияЯвляетсяВкладчикомОППВ
	|Из 
	|	Документ." + Метаданные().Имя + " КАК ДанныеДокумента
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних(
	|			&ПериодРегистрации, 
	|			Организация = &Организация) КАК УчетнаяПолитикаНУ
	|		ПО ИСТИНА
	|Где 
	|	ДанныеДокумента.Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по всем табличным частям документа.
//
Функция СформироватьЗапросПоТабличнымЧастям(ВыборкаПоШапкеДокумента)
    МестоРаботыТекст="";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ВыборкаПоШапкеДокумента.Ссылка);	
	Запрос.УстановитьПараметр("Организация", ВыборкаПоШапкеДокумента.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ВыборкаПоШапкеДокумента.ПериодРегистрации);

	ПолеПериод = ?(ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, "&ПериодРегистрации", "МесяцНалоговогоПериода");
	
	Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		
		ПериодыФизЛицаТекст = "
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныйСН
		|ГДЕ
		|	Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ // выбираем только различные
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныеСО
		|ГДЕ
		|	Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ // выбираем только различные
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныеОтчисленияОСМС
		|ГДЕ
		|	Ссылка = &ДокументСсылка" + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|
		|ОБЪЕДИНИТЬ // выбираем только различные
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныйОППВ
		|ГДЕ
		|	Ссылка = &ДокументСсылка
		|
		|ОБЪЕДИНИТЬ // выбираем только различные
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныйОПВР
		|ГДЕ
		|	Ссылка = &ДокументСсылка", "");
		
		МестоРаботыТекст = ПроведениеРасчетов.СформироватьТекстЗапросаСтруктурныеЕдиницы(ПериодыФизЛицаТекст, ВыборкаПоШапкеДокумента.Организация, Запрос, Истина);
		МестоРаботыТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ *  
							|	ПОМЕСТИТЬ МестоРаботыВТ
							|	ИЗ ("+МестоРаботыТекст+") КАК МестаРабот;";
		МестоРаботыВТ="МестоРаботыВТ";
	
	КонецЕсли;
	
	Запрос.Текст =МестоРаботыТекст+ "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтрокиТЧ.ВидСтрокиЗапроса,
	|	СтрокиТЧ.НомерСтроки,
	|	СтрокиТЧ.ФизЛицо,
	|	СтрокиТЧ.МесяцНалоговогоПериода,
	|	СтрокиТЧ.Налог,
	|	СтрокиТЧ.Отчисление,
	|	СтрокиТЧ.Взнос,
	|	СтрокиТЧ.ОблагаемаяБаза";
	
	Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		Запрос.Текст = Запрос.Текст + ", 
		|	ВЫБОР
		|		КОГДА НЕ (МестоРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестоРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ &Организация
		|	КОНЕЦ КАК СтруктурнаяЕдиница";
	Иначе
		Запрос.Текст = Запрос.Текст + ", 
		|	&Организация КАК СтруктурнаяЕдиница";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|	
	|ИЗ
	|	(ВЫБРАТЬ
	|		""ИсчисленныйСН"" КАК ВидСтрокиЗапроса,
	|		СтрокиТЧ.НомерСтроки,
	|		" + ПолеПериод + " КАК Период,
	|		СтрокиТЧ.ФизЛицо,
	|		СтрокиТЧ.МесяцНалоговогоПериода,
	|		СтрокиТЧ.Налог,
	|		0 КАК Отчисление,
	|		0 КАК Взнос,
	|		СтрокиТЧ.ОблагаемаяБаза КАК ОблагаемаяБаза
	|	ИЗ
	|		Документ.РасчетСНиСО.ИсчисленныйСН КАК СтрокиТЧ
	|	ГДЕ
	|		СтрокиТЧ.Ссылка = &ДокументСсылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		""ИсчисленныеСО"" КАК ВидСтрокиЗапроса,
	|		СтрокиТЧ.НомерСтроки,
	|		" + ПолеПериод + " КАК Период,
	|		СтрокиТЧ.ФизЛицо,
	|		СтрокиТЧ.МесяцНалоговогоПериода,
	|		0 КАК Налог,
	|		СтрокиТЧ.Отчисление КАК Отчисление,
	|		0 КАК Взнос,
	|		СтрокиТЧ.ОблагаемаяБаза КАК ОблагаемаяБаза
	|	ИЗ
	|		Документ.РасчетСНиСО.ИсчисленныеСО КАК СтрокиТЧ
	|	ГДЕ
	|		СтрокиТЧ.Ссылка = &ДокументСсылка" + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		""ИсчисленныйОППВ"" КАК ВидСтрокиЗапроса,
	|		СтрокиТЧ.НомерСтроки,
	|		" + ПолеПериод + " КАК Период,
	|		СтрокиТЧ.ФизЛицо,
	|		СтрокиТЧ.МесяцНалоговогоПериода,
	|		0 КАК Налог,
	|		0 КАК Отчисление,
	|		СтрокиТЧ.Взнос КАК Взнос,
	|		СтрокиТЧ.ОблагаемаяБаза КАК ОблагаемаяБаза
	|	ИЗ
	|		Документ.РасчетСНиСО.ИсчисленныйОППВ КАК СтрокиТЧ
	|	ГДЕ
	|		СтрокиТЧ.Ссылка = &ДокументСсылка", "") + "
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		""ИсчисленныеОтчисленияОСМС"" КАК ВидСтрокиЗапроса,
	|		СтрокиТЧ.НомерСтроки,
	|		" + ПолеПериод + " КАК Период,
	|		СтрокиТЧ.ФизЛицо,
	|		СтрокиТЧ.МесяцНалоговогоПериода,
	|		0 КАК Налог,
	|		СтрокиТЧ.Отчисление КАК Отчисление,
	|		0 КАК Взнос,
	|		СтрокиТЧ.ОблагаемаяБаза КАК ОблагаемаяБаза
	|	ИЗ
	|		Документ.РасчетСНиСО.ИсчисленныеОтчисленияОСМС КАК СтрокиТЧ
	|	ГДЕ
	|		СтрокиТЧ.Ссылка = &ДокументСсылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		""ИсчисленныйОПВР"" КАК ВидСтрокиЗапроса,
	|		СтрокиТЧ.НомерСтроки,
	|		" + ПолеПериод + " КАК Период,
	|		СтрокиТЧ.ФизЛицо,
	|		СтрокиТЧ.МесяцНалоговогоПериода,
	|		0 КАК Налог,
	|		0 КАК Отчисление,
	|		СтрокиТЧ.Взнос КАК Взнос,
	|		СтрокиТЧ.ОблагаемаяБаза КАК ОблагаемаяБаза
	|	ИЗ
	|		Документ.РасчетСНиСО.ИсчисленныйОПВР КАК СтрокиТЧ
	|	ГДЕ
	|		СтрокиТЧ.Ссылка = &ДокументСсылка ) КАК СтрокиТЧ";
	
	Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		Запрос.Текст = Запрос.Текст + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ " + МестоРаботыВТ + " КАК МестоРаботы
		|		ПО СтрокиТЧ.ФизЛицо = МестоРаботы.ФизЛицо
		|			И СтрокиТЧ.Период = МестоРаботы.Период";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|УПОРЯДОЧИТЬ ПО
	|	СтрокиТЧ.ВидСтрокиЗапроса,
	|	СтрокиТЧ.НомерСтроки
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоТабличнымЧастям()

// Распределяет результаты расчетов по структурным единицам и подразделениям.
//
Функция РаспределитьРезультатыПоСтруктурнымЕдиницам(ВыборкаПоШапкеДокумента)
	
	РаспределятьНалогиПоПодразделениямОрганизаций = ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСсылка", Ссылка);
	Запрос.УстановитьПараметр("парамПериодРегистрации", ВыборкаПоШапкеДокумента.ПериодРегистрации);
	Запрос.УстановитьПараметр("парамНачало", НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
	Запрос.УстановитьПараметр("парамОкончание", КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации));
	
	Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		ИсчислениеНалоговСтруктурныхЕдиниц = глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц");
		Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ВыборкаПоШапкеДокумента.Организация, 
																		ВыборкаПоШапкеДокумента.Организация, 
																		ИсчислениеНалоговСтруктурныхЕдиниц, 
																		Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	Иначе
		Налогоплательщик = ВыборкаПоШапкеДокумента.Организация;
	КонецЕсли;
	Запрос.УстановитьПараметр("парамНалогоплательщик", Налогоплательщик);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Табличные части
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсчисленныйСН.Ссылка,
		|	ИсчисленныйСН.НомерСтроки,
		|	ИсчисленныйСН.ФизЛицо,
		|	ИсчисленныйСН.Налог,
		|	ИсчисленныйСН.МесяцНалоговогоПериода,
		|	ИсчисленныйСН.ОблагаемаяБаза,
		|	ИсчисленныйСН.Ссылка.ПериодРегистрации,
		|	ИсчисленныйСН.Ссылка.Организация
		|ПОМЕСТИТЬ ВТ_ТабличнаяЧастьСН
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныйСН КАК ИсчисленныйСН
		|ГДЕ
		|	ИсчисленныйСН.Ссылка = &парамСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсчисленныеСО.Ссылка,
		|	ИсчисленныеСО.НомерСтроки,
		|	ИсчисленныеСО.ФизЛицо,
		|	ИсчисленныеСО.Отчисление,
		|	ИсчисленныеСО.МесяцНалоговогоПериода,
		|	ИсчисленныеСО.ОблагаемаяБаза,
		|	ИсчисленныеСО.Ссылка.ПериодРегистрации,
		|	ИсчисленныеСО.Ссылка.Организация
		|ПОМЕСТИТЬ ВТ_ТабличнаяЧастьСО
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныеСО КАК ИсчисленныеСО
		|ГДЕ
		|	ИсчисленныеСО.Ссылка = &парамСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсчисленныеОтчисленияОСМС.Ссылка,
		|	ИсчисленныеОтчисленияОСМС.НомерСтроки,
		|	ИсчисленныеОтчисленияОСМС.ФизЛицо,
		|	ИсчисленныеОтчисленияОСМС.Отчисление,
		|	ИсчисленныеОтчисленияОСМС.МесяцНалоговогоПериода,
		|	ИсчисленныеОтчисленияОСМС.ОблагаемаяБаза,
		|	ИсчисленныеОтчисленияОСМС.Ссылка.ПериодРегистрации,
		|	ИсчисленныеОтчисленияОСМС.Ссылка.Организация
		|ПОМЕСТИТЬ ВТ_ТабличнаяЧастьООСМС
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныеОтчисленияОСМС КАК ИсчисленныеОтчисленияОСМС
		|ГДЕ
		|	ИсчисленныеОтчисленияОСМС.Ссылка = &парамСсылка
		|;
		|" + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсчисленныйОППВ.Ссылка,
		|	ИсчисленныйОППВ.НомерСтроки,
		|	ИсчисленныйОППВ.ФизЛицо,
		|	ИсчисленныйОППВ.Взнос,
		|	ИсчисленныйОППВ.МесяцНалоговогоПериода,
		|	ИсчисленныйОППВ.ОблагаемаяБаза,
		|	ИсчисленныйОППВ.Ссылка.ПериодРегистрации,
		|	ИсчисленныйОППВ.Ссылка.Организация
		|ПОМЕСТИТЬ ВТ_ТабличнаяЧастьОППВ
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныйОППВ КАК ИсчисленныйОППВ
		|ГДЕ
		|	ИсчисленныйОППВ.Ссылка = &парамСсылка
		|;
		|", "") + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсчисленныйОПВР.Ссылка,
		|	ИсчисленныйОПВР.НомерСтроки,
		|	ИсчисленныйОПВР.ФизЛицо,
		|	ИсчисленныйОПВР.Взнос,
		|	ИсчисленныйОПВР.МесяцНалоговогоПериода,
		|	ИсчисленныйОПВР.ОблагаемаяБаза,
		|	ИсчисленныйОПВР.Ссылка.ПериодРегистрации,
		|	ИсчисленныйОПВР.Ссылка.Организация
		|ПОМЕСТИТЬ ВТ_ТабличнаяЧастьОПВР
		|ИЗ
		|	Документ.РасчетСНиСО.ИсчисленныйОПВР КАК ИсчисленныйОПВР
		|ГДЕ
		|	ИсчисленныйОПВР.Ссылка = &парамСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьСН.ФизЛицо
		|ПОМЕСТИТЬ ВТ_СписокФизЛиц
		|ИЗ
		|	ВТ_ТабличнаяЧастьСН КАК ТабличнаяЧастьСН
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ)
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьСО.ФизЛицо
		|ИЗ
		|	ВТ_ТабличнаяЧастьСО КАК ТабличнаяЧастьСО
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ)
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьООСМС.ФизЛицо
		|ИЗ
		|	ВТ_ТабличнаяЧастьООСМС КАК ТабличнаяЧастьООСМС" + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ)
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьОППВ.ФизЛицо
		|ИЗ
		|	ВТ_ТабличнаяЧастьОППВ КАК ТабличнаяЧастьОППВ", "") + "
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ)
		|
		|ВЫБРАТЬ
		|	ТабличнаяЧастьОПВР.ФизЛицо
		|ИЗ
		|	ВТ_ТабличнаяЧастьОПВР КАК ТабличнаяЧастьОПВР";
		
	Запрос.Выполнить();
	СписокФизЛицТекст = "ВТ_СписокФизЛиц";
	
	ПолеПериод = ?(ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации, "ПериодРегистрации", "МесяцНалоговогоПериода");
	
	// Для корректного распределения в случае доначисления учтем все ранее начисленные суммы
	
	РанееИсчисленныеНалогиОтчисленияТекст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РанееИсчисленныеСО.НомерСтроки,
		|	РанееИсчисленныеСО.ФизЛицо,
		|	РанееИсчисленныеСО.МесяцНалоговогоПериода,
		|	РанееИсчисленныеСО.ПериодРегистрации,
		|	РанееИсчисленныеСО.Организация,
		|	РанееИсчисленныеСО.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	РанееИсчисленныеСО.ПодразделениеОрганизации,", "") + "
		|	СУММА(РанееИсчисленныеСО.Отчисление) КАК Отчисление,
		|	СУММА(РанееИсчисленныеСО.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_РанееИсчисленныеСО
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧастьСО.НомерСтроки КАК НомерСтроки,
		|		СОРасчетыСФондами.ФизЛицо КАК ФизЛицо,
		|		СОРасчетыСФондами.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		НАЧАЛОПЕРИОДА(СОРасчетыСФондами.Период, МЕСЯЦ) КАК ПериодРегистрации,
		|		ТабличнаяЧастьСО.Организация КАК Организация,
		|		СОРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		СОРасчетыСФондами.ПодразделениеОрганизации КАК ПодразделениеОрганизации,", "") + "
		|		СОРасчетыСФондами.Отчисление КАК Отчисление,
		|		0 КАК ОблагаемаяБаза
		|	ИЗ
		|		РегистрНакопления.СОРасчетыСФондами КАК СОРасчетыСФондами
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьСО КАК ТабличнаяЧастьСО
		|			ПО СОРасчетыСФондами.ФизЛицо = ТабличнаяЧастьСО.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(СОРасчетыСФондами.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСО.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(СОРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСО." + ПолеПериод + ", МЕСЯЦ))
		|				И СОРасчетыСФондами.Налогоплательщик = &парамНалогоплательщик
		|				И СОРасчетыСФондами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И СОРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)			
		|				И СОРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьСО.НомерСтроки,
		|		СОСведенияОДоходах.ФизЛицо,
		|		СОСведенияОДоходах.Период,
		|		СОСведенияОДоходах.ПериодРегистрации,
		|		ТабличнаяЧастьСО.Организация,
		|		СОСведенияОДоходах.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		СОСведенияОДоходах.ПодразделениеОрганизации,", "") + "
		|		0,
		|		СОСведенияОДоходах.ОблагаемаяБазаОборот
		|	ИЗ
		|		РегистрНакопления.СОСведенияОДоходах.Обороты( , , Месяц,
		|				Налогоплательщик = &парамНалогоплательщик
		|					И ПериодРегистрации = &парамПериодРегистрации
		|					И СпособНалогообложения = ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СОСведенияОДоходах
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьСО КАК ТабличнаяЧастьСО
		|			ПО СОСведенияОДоходах.ФизЛицо = ТабличнаяЧастьСО.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(СОСведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСО.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(СОСведенияОДоходах.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСО." + ПолеПериод + ", МЕСЯЦ))) КАК РанееИсчисленныеСО
		|
		|СГРУППИРОВАТЬ ПО
		|	РанееИсчисленныеСО.НомерСтроки,
		|	РанееИсчисленныеСО.ФизЛицо,
		|	РанееИсчисленныеСО.МесяцНалоговогоПериода,
		|	РанееИсчисленныеСО.ПериодРегистрации,
		|	РанееИсчисленныеСО.Организация,
		|	РанееИсчисленныеСО.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	РанееИсчисленныеСО.ПодразделениеОрганизации", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РанееИсчисленныйСН.НомерСтроки,
		|	РанееИсчисленныйСН.ФизЛицо,
		|	РанееИсчисленныйСН.МесяцНалоговогоПериода,
		|	РанееИсчисленныйСН.ПериодРегистрации,
		|	РанееИсчисленныйСН.Организация,
		|	РанееИсчисленныйСН.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	РанееИсчисленныйСН.ПодразделениеОрганизации,", "") + "
		|	СУММА(РанееИсчисленныйСН.Налог) КАК Налог,
		|	СУММА(РанееИсчисленныйСН.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_РанееИсчисленныйСН
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧастьСН.НомерСтроки КАК НомерСтроки,
		|		СНИсчисленный.ФизЛицо КАК ФизЛицо,
		|		СНИсчисленный.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		СНИсчисленный.Период КАК ПериодРегистрации,
		|		ТабличнаяЧастьСН.Организация КАК Организация,
		|		СНИсчисленный.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		СНИсчисленный.ПодразделениеОрганизации КАК ПодразделениеОрганизации,", "") + "
		|		СНИсчисленный.НалогОборот КАК Налог,
		|		0 КАК ОблагаемаяБаза
		|	ИЗ
		|		РегистрНакопления.СНИсчисленный.Обороты(&парамНачало, &парамОкончание, Месяц, Налогоплательщик = &парамНалогоплательщик) КАК СНИсчисленный
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьСН КАК ТабличнаяЧастьСН
		|			ПО СНИсчисленный.ФизЛицо = ТабличнаяЧастьСН.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(СНИсчисленный.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСН.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(СНИсчисленный.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСН." + ПолеПериод + ", МЕСЯЦ))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьСН.НомерСтроки,
		|		СНСведенияОДоходах.ФизЛицо,
		|		СНСведенияОДоходах.Период,
		|		СНСведенияОДоходах.ПериодРегистрации,
		|		ТабличнаяЧастьСН.Организация,
		|		СНСведенияОДоходах.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		СНСведенияОДоходах.ПодразделениеОрганизации,", "") + "
		|		0,
		|		СНСведенияОДоходах.ОблагаемаяБазаОборот
		|	ИЗ
		|		РегистрНакопления.СНСведенияОДоходах.Обороты( , , Месяц,
		|				Налогоплательщик = &парамНалогоплательщик
		|					И ПериодРегистрации = &парамПериодРегистрации
		|					И СпособНалогообложения = ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК СНСведенияОДоходах
		|
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьСН КАК ТабличнаяЧастьСН
		|			ПО СНСведенияОДоходах.ФизЛицо = ТабличнаяЧастьСН.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(СНСведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСН.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(СНСведенияОДоходах.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьСН." + ПолеПериод + ", МЕСЯЦ))) КАК РанееИсчисленныйСН
		|
		|СГРУППИРОВАТЬ ПО
		|	РанееИсчисленныйСН.НомерСтроки,
		|	РанееИсчисленныйСН.ФизЛицо,
		|	РанееИсчисленныйСН.МесяцНалоговогоПериода,
		|	РанееИсчисленныйСН.ПериодРегистрации,
		|	РанееИсчисленныйСН.Организация,
		|	РанееИсчисленныйСН.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	РанееИсчисленныйСН.ПодразделениеОрганизации", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РанееИсчисленныеОтчисленияОСМС.НомерСтроки,
		|	РанееИсчисленныеОтчисленияОСМС.ФизЛицо,
		|	РанееИсчисленныеОтчисленияОСМС.МесяцНалоговогоПериода,
		|	РанееИсчисленныеОтчисленияОСМС.ПериодРегистрации,
		|	РанееИсчисленныеОтчисленияОСМС.Организация,
		|	РанееИсчисленныеОтчисленияОСМС.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	РанееИсчисленныеОтчисленияОСМС.ПодразделениеОрганизации,", "") + "
		|	СУММА(РанееИсчисленныеОтчисленияОСМС.Отчисление) КАК Отчисление,
		|	СУММА(РанееИсчисленныеОтчисленияОСМС.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_РанееИсчисленныеОтчисленияОСМС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧастьООСМС.НомерСтроки КАК НомерСтроки,
		|		ООСМСРасчетыСФондами.ФизЛицо КАК ФизЛицо,
		|		ООСМСРасчетыСФондами.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		НАЧАЛОПЕРИОДА(ООСМСРасчетыСФондами.Период, МЕСЯЦ) КАК ПериодРегистрации,
		|		ТабличнаяЧастьООСМС.Организация КАК Организация,
		|		ООСМСРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		ООСМСРасчетыСФондами.ПодразделениеОрганизации КАК ПодразделениеОрганизации,", "") + "
		|		ООСМСРасчетыСФондами.Отчисление КАК Отчисление,
		|		0 КАК ОблагаемаяБаза
		|	ИЗ
		|		РегистрНакопления.ООСМСРасчетыСФондами КАК ООСМСРасчетыСФондами
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьООСМС КАК ТабличнаяЧастьООСМС
		|			ПО ООСМСРасчетыСФондами.ФизЛицо = ТабличнаяЧастьООСМС.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(ООСМСРасчетыСФондами.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьООСМС.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(ООСМСРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьООСМС." + ПолеПериод + ", МЕСЯЦ))
		|				И ООСМСРасчетыСФондами.Налогоплательщик = &парамНалогоплательщик
		|				И ООСМСРасчетыСФондами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ООСМСРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)			
		|				И ООСМСРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьООСМС.НомерСтроки,
		|		ООСМССведенияОДоходах.ФизЛицо,
		|		ООСМССведенияОДоходах.Период,
		|		ООСМССведенияОДоходах.ПериодРегистрации,
		|		ООСМССведенияОДоходах.Организация,
		|		ООСМССведенияОДоходах.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		ООСМССведенияОДоходах.ПодразделениеОрганизации,", "") + "
		|		0,
		|		ООСМССведенияОДоходах.ОблагаемаяБазаОборот
		|	ИЗ
		|		РегистрНакопления.ООСМССведенияОДоходах.Обороты( , , Месяц,
		|				Налогоплательщик = &парамНалогоплательщик
		|					И ПериодРегистрации = &парамПериодРегистрации
		|					И СпособНалогообложения = ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом)) КАК ООСМССведенияОДоходах
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьООСМС КАК ТабличнаяЧастьООСМС
		|			ПО ООСМССведенияОДоходах.ФизЛицо = ТабличнаяЧастьООСМС.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(ООСМССведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьООСМС.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(ООСМССведенияОДоходах.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьООСМС." + ПолеПериод + ", МЕСЯЦ))) КАК РанееИсчисленныеОтчисленияОСМС
		|
		|СГРУППИРОВАТЬ ПО
		|	РанееИсчисленныеОтчисленияОСМС.НомерСтроки,
		|	РанееИсчисленныеОтчисленияОСМС.ФизЛицо,
		|	РанееИсчисленныеОтчисленияОСМС.МесяцНалоговогоПериода,
		|	РанееИсчисленныеОтчисленияОСМС.ПериодРегистрации,
		|	РанееИсчисленныеОтчисленияОСМС.Организация,
		|	РанееИсчисленныеОтчисленияОСМС.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	РанееИсчисленныеОтчисленияОСМС.ПодразделениеОрганизации", "") + "
		|;
		|
		|" + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РанееИсчисленныйОППВ.НомерСтроки,
		|	РанееИсчисленныйОППВ.ФизЛицо,
		|	РанееИсчисленныйОППВ.МесяцНалоговогоПериода,
		|	РанееИсчисленныйОППВ.ПериодРегистрации,
		|	РанееИсчисленныйОППВ.Организация,
		|	РанееИсчисленныйОППВ.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	РанееИсчисленныйОППВ.ПодразделениеОрганизации,", "") + "
		|	СУММА(РанееИсчисленныйОППВ.Взнос) КАК Взнос,
		|	СУММА(РанееИсчисленныйОППВ.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_РанееИсчисленныйОППВ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧастьОППВ.НомерСтроки КАК НомерСтроки,
		|		ОППВРасчетыСФондами.ФизЛицо КАК ФизЛицо,
		|		ОППВРасчетыСФондами.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		НАЧАЛОПЕРИОДА(ОППВРасчетыСФондами.Период, МЕСЯЦ) КАК ПериодРегистрации,
		|		ТабличнаяЧастьОППВ.Организация КАК Организация,
		|		ОППВРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		ОППВРасчетыСФондами.ПодразделениеОрганизации КАК ПодразделениеОрганизации,", "") + "
		|		ОППВРасчетыСФондами.Взнос КАК Взнос,
		|		0 КАК ОблагаемаяБаза
		|	ИЗ
		|		РегистрНакопления.ОППВРасчетыСФондами КАК ОППВРасчетыСФондами
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьОППВ КАК ТабличнаяЧастьОППВ
		|			ПО ОППВРасчетыСФондами.ФизЛицо = ТабличнаяЧастьОППВ.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(ОППВРасчетыСФондами.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОППВ.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(ОППВРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОППВ." + ПолеПериод + ", МЕСЯЦ))
		|				И ОППВРасчетыСФондами.Налогоплательщик = &парамНалогоплательщик
		|				И ОППВРасчетыСФондами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ОППВРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)
		|				И ОППВРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьОППВ.НомерСтроки,
		|		ОППВСведенияОДоходах.ФизЛицо,
		|		ОППВСведенияОДоходах.Период,
		|		ОППВСведенияОДоходах.ПериодРегистрации,
		|		ТабличнаяЧастьОППВ.Организация,
		|		ОППВСведенияОДоходах.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		ОППВСведенияОДоходах.ПодразделениеОрганизации,", "") + "
		|		0,
		|		ОППВСведенияОДоходах.ОблагаемаяБазаОборот
		|	ИЗ
		|		РегистрНакопления.ОППВСведенияОДоходах.Обороты( , , Месяц,
		|				Налогоплательщик = &парамНалогоплательщик
		|					И ПериодРегистрации = &парамПериодРегистрации
		|					И СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)) КАК ОППВСведенияОДоходах
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьОППВ КАК ТабличнаяЧастьОППВ
		|			ПО ОППВСведенияОДоходах.ФизЛицо = ТабличнаяЧастьОППВ.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(ОППВСведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОППВ.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(ОППВСведенияОДоходах.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОППВ." + ПолеПериод + ", МЕСЯЦ))) КАК РанееИсчисленныйОППВ
		|
		|СГРУППИРОВАТЬ ПО
		|	РанееИсчисленныйОППВ.НомерСтроки,
		|	РанееИсчисленныйОППВ.ФизЛицо,
		|	РанееИсчисленныйОППВ.МесяцНалоговогоПериода,
		|	РанееИсчисленныйОППВ.ПериодРегистрации,
		|	РанееИсчисленныйОППВ.Организация,
		|	РанееИсчисленныйОППВ.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	РанееИсчисленныйОППВ.ПодразделениеОрганизации", "") + "
		|;
		|", "") + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РанееИсчисленныйОПВР.НомерСтроки,
		|	РанееИсчисленныйОПВР.ФизЛицо,
		|	РанееИсчисленныйОПВР.МесяцНалоговогоПериода,
		|	РанееИсчисленныйОПВР.ПериодРегистрации,
		|	РанееИсчисленныйОПВР.Организация,
		|	РанееИсчисленныйОПВР.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	РанееИсчисленныйОПВР.ПодразделениеОрганизации,", "") + "
		|	СУММА(РанееИсчисленныйОПВР.Взнос) КАК Взнос,
		|	СУММА(РанееИсчисленныйОПВР.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_РанееИсчисленныйОПВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧастьОПВР.НомерСтроки КАК НомерСтроки,
		|		ОПВРРасчетыСФондами.ФизЛицо КАК ФизЛицо,
		|		ОПВРРасчетыСФондами.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		НАЧАЛОПЕРИОДА(ОПВРРасчетыСФондами.Период, МЕСЯЦ) КАК ПериодРегистрации,
		|		ТабличнаяЧастьОПВР.Организация КАК Организация,
		|		ОПВРРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		ОПВРРасчетыСФондами.ПодразделениеОрганизации КАК ПодразделениеОрганизации,", "") + "
		|		ОПВРРасчетыСФондами.Взнос КАК Взнос,
		|		0 КАК ОблагаемаяБаза
		|	ИЗ
		|		РегистрНакопления.ОПВРРасчетыСФондами КАК ОПВРРасчетыСФондами
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьОПВР КАК ТабличнаяЧастьОПВР
		|			ПО ОПВРРасчетыСФондами.ФизЛицо = ТабличнаяЧастьОПВР.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(ОПВРРасчетыСФондами.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОПВР.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(ОПВРРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОПВР." + ПолеПериод + ", МЕСЯЦ))
		|				И ОПВРРасчетыСФондами.Налогоплательщик = &парамНалогоплательщик
		|				И ОПВРРасчетыСФондами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И ОПВРРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)
		|				И ОПВРРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьОПВР.НомерСтроки,
		|		ОПВРСведенияОДоходах.ФизЛицо,
		|		ОПВРСведенияОДоходах.Период,
		|		ОПВРСведенияОДоходах.ПериодРегистрации,
		|		ТабличнаяЧастьОПВР.Организация,
		|		ОПВРСведенияОДоходах.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|		ОПВРСведенияОДоходах.ПодразделениеОрганизации,", "") + "
		|		0,
		|		ОПВРСведенияОДоходах.ОблагаемаяБазаОборот
		|	ИЗ
		|		РегистрНакопления.ОПВРСведенияОДоходах.Обороты( , , Месяц,
		|				Налогоплательщик = &парамНалогоплательщик
		|					И ПериодРегистрации = &парамПериодРегистрации
		|					И СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)) КАК ОПВРСведенияОДоходах
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабличнаяЧастьОПВР КАК ТабличнаяЧастьОПВР
		|			ПО ОПВРСведенияОДоходах.ФизЛицо = ТабличнаяЧастьОПВР.ФизЛицо
		|				И (НАЧАЛОПЕРИОДА(ОПВРСведенияОДоходах.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОПВР.ПериодРегистрации, МЕСЯЦ))
		|				И (НАЧАЛОПЕРИОДА(ОПВРСведенияОДоходах.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ТабличнаяЧастьОПВР." + ПолеПериод + ", МЕСЯЦ))) КАК РанееИсчисленныйОПВР
		|
		|СГРУППИРОВАТЬ ПО
		|	РанееИсчисленныйОПВР.НомерСтроки,
		|	РанееИсчисленныйОПВР.ФизЛицо,
		|	РанееИсчисленныйОПВР.МесяцНалоговогоПериода,
		|	РанееИсчисленныйОПВР.ПериодРегистрации,
		|	РанееИсчисленныйОПВР.Организация,
		|	РанееИсчисленныйОПВР.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	РанееИсчисленныйОПВР.ПодразделениеОрганизации", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСО.НомерСтроки,
		|	ИсчисленныеСО.ФизЛицо,
		|	ИсчисленныеСО.МесяцНалоговогоПериода,
		|	ИсчисленныеСО.ПериодРегистрации,
		|	ИсчисленныеСО.Организация,
		|	СУММА(ИсчисленныеСО.Отчисление) КАК Отчисление,
		|	СУММА(ИсчисленныеСО.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ИсчисленныеСО
		|ИЗ
		|	(ВЫБРАТЬ
		|		РанееИсчисленныеСО.НомерСтроки КАК НомерСтроки,
		|		РанееИсчисленныеСО.ФизЛицо КАК ФизЛицо,
		|		РанееИсчисленныеСО.Отчисление КАК Отчисление,
		|		РанееИсчисленныеСО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		РанееИсчисленныеСО.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|		РанееИсчисленныеСО.ПериодРегистрации КАК ПериодРегистрации,
		|		РанееИсчисленныеСО.Организация КАК Организация
		|	ИЗ
		|		ВТ_РанееИсчисленныеСО КАК РанееИсчисленныеСО
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьСО.НомерСтроки,
		|		ТабличнаяЧастьСО.ФизЛицо,
		|		ТабличнаяЧастьСО.Отчисление,
		|		ТабличнаяЧастьСО.МесяцНалоговогоПериода,
		|		ТабличнаяЧастьСО.ОблагаемаяБаза,
		|		ТабличнаяЧастьСО.ПериодРегистрации,
		|		ТабличнаяЧастьСО.Организация
		|	ИЗ
		|		ВТ_ТабличнаяЧастьСО КАК ТабличнаяЧастьСО) КАК ИсчисленныеСО
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсчисленныеСО.НомерСтроки,
		|	ИсчисленныеСО.ФизЛицо,
		|	ИсчисленныеСО.МесяцНалоговогоПериода,
		|	ИсчисленныеСО.ПериодРегистрации,
		|	ИсчисленныеСО.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеСН.НомерСтроки,
		|	ИсчисленныеСН.ФизЛицо,
		|	ИсчисленныеСН.МесяцНалоговогоПериода,
		|	ИсчисленныеСН.ПериодРегистрации,
		|	ИсчисленныеСН.Организация,
		|	СУММА(ИсчисленныеСН.Налог) КАК Налог,
		|	СУММА(ИсчисленныеСН.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ИсчисленныеСН
		|ИЗ
		|	(ВЫБРАТЬ
		|		РанееИсчисленныйСН.НомерСтроки КАК НомерСтроки,
		|		РанееИсчисленныйСН.ФизЛицо КАК ФизЛицо,
		|		РанееИсчисленныйСН.Налог КАК Налог,
		|		РанееИсчисленныйСН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		РанееИсчисленныйСН.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|		РанееИсчисленныйСН.ПериодРегистрации КАК ПериодРегистрации,
		|		РанееИсчисленныйСН.Организация КАК Организация
		|	ИЗ
		|		ВТ_РанееИсчисленныйСН КАК РанееИсчисленныйСН
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьСН.НомерСтроки,
		|		ТабличнаяЧастьСН.ФизЛицо,
		|		ТабличнаяЧастьСН.Налог,
		|		ТабличнаяЧастьСН.МесяцНалоговогоПериода,
		|		ТабличнаяЧастьСН.ОблагаемаяБаза,
		|		ТабличнаяЧастьСН.ПериодРегистрации,
		|		ТабличнаяЧастьСН.Организация
		|	ИЗ
		|		ВТ_ТабличнаяЧастьСН КАК ТабличнаяЧастьСН) КАК ИсчисленныеСН
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсчисленныеСН.НомерСтроки,
		|	ИсчисленныеСН.ФизЛицо,
		|	ИсчисленныеСН.МесяцНалоговогоПериода,
		|	ИсчисленныеСН.ПериодРегистрации,
		|	ИсчисленныеСН.Организация
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныеОтчисленияОСМС.НомерСтроки,
		|	ИсчисленныеОтчисленияОСМС.ФизЛицо,
		|	ИсчисленныеОтчисленияОСМС.МесяцНалоговогоПериода,
		|	ИсчисленныеОтчисленияОСМС.ПериодРегистрации,
		|	ИсчисленныеОтчисленияОСМС.Организация,
		|	СУММА(ИсчисленныеОтчисленияОСМС.Отчисление) КАК Отчисление,
		|	СУММА(ИсчисленныеОтчисленияОСМС.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ИсчисленныеОтчисленияОСМС
		|ИЗ
		|	(ВЫБРАТЬ
		|		РанееИсчисленныеОтчисленияОСМС.НомерСтроки КАК НомерСтроки,
		|		РанееИсчисленныеОтчисленияОСМС.ФизЛицо КАК ФизЛицо,
		|		РанееИсчисленныеОтчисленияОСМС.Отчисление КАК Отчисление,
		|		РанееИсчисленныеОтчисленияОСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		РанееИсчисленныеОтчисленияОСМС.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|		РанееИсчисленныеОтчисленияОСМС.ПериодРегистрации КАК ПериодРегистрации,
		|		РанееИсчисленныеОтчисленияОСМС.Организация КАК Организация
		|	ИЗ
		|		ВТ_РанееИсчисленныеОтчисленияОСМС КАК РанееИсчисленныеОтчисленияОСМС
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьООСМС.НомерСтроки,
		|		ТабличнаяЧастьООСМС.ФизЛицо,
		|		ТабличнаяЧастьООСМС.Отчисление,
		|		ТабличнаяЧастьООСМС.МесяцНалоговогоПериода,
		|		ТабличнаяЧастьООСМС.ОблагаемаяБаза,
		|		ТабличнаяЧастьООСМС.ПериодРегистрации,
		|		ТабличнаяЧастьООСМС.Организация
		|	ИЗ
		|		ВТ_ТабличнаяЧастьООСМС КАК ТабличнаяЧастьООСМС) КАК ИсчисленныеОтчисленияОСМС
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсчисленныеОтчисленияОСМС.НомерСтроки,
		|	ИсчисленныеОтчисленияОСМС.ФизЛицо,
		|	ИсчисленныеОтчисленияОСМС.МесяцНалоговогоПериода,
		|	ИсчисленныеОтчисленияОСМС.ПериодРегистрации,
		|	ИсчисленныеОтчисленияОСМС.Организация
		|;
		|
		|" + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйОППВ.НомерСтроки,
		|	ИсчисленныйОППВ.ФизЛицо,
		|	ИсчисленныйОППВ.МесяцНалоговогоПериода,
		|	ИсчисленныйОППВ.ПериодРегистрации,
		|	ИсчисленныйОППВ.Организация,
		|	СУММА(ИсчисленныйОППВ.Взнос) КАК Взнос,
		|	СУММА(ИсчисленныйОППВ.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ИсчисленныйОППВ
		|ИЗ
		|	(ВЫБРАТЬ
		|		РанееИсчисленныйОППВ.НомерСтроки КАК НомерСтроки,
		|		РанееИсчисленныйОППВ.ФизЛицо КАК ФизЛицо,
		|		РанееИсчисленныйОППВ.Взнос КАК Взнос,
		|		РанееИсчисленныйОППВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		РанееИсчисленныйОППВ.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|		РанееИсчисленныйОППВ.ПериодРегистрации КАК ПериодРегистрации,
		|		РанееИсчисленныйОППВ.Организация КАК Организация
		|	ИЗ
		|		ВТ_РанееИсчисленныйОППВ КАК РанееИсчисленныйОППВ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьОППВ.НомерСтроки,
		|		ТабличнаяЧастьОППВ.ФизЛицо,
		|		ТабличнаяЧастьОППВ.Взнос,
		|		ТабличнаяЧастьОППВ.МесяцНалоговогоПериода,
		|		ТабличнаяЧастьОППВ.ОблагаемаяБаза,
		|		ТабличнаяЧастьОППВ.ПериодРегистрации,
		|		ТабличнаяЧастьОППВ.Организация
		|	ИЗ
		|		ВТ_ТабличнаяЧастьОППВ КАК ТабличнаяЧастьОППВ) КАК ИсчисленныйОППВ
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсчисленныйОППВ.НомерСтроки,
		|	ИсчисленныйОППВ.ФизЛицо,
		|	ИсчисленныйОППВ.МесяцНалоговогоПериода,
		|	ИсчисленныйОППВ.ПериодРегистрации,
		|	ИсчисленныйОППВ.Организация
		|;
		|", "") + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсчисленныйОПВР.НомерСтроки,
		|	ИсчисленныйОПВР.ФизЛицо,
		|	ИсчисленныйОПВР.МесяцНалоговогоПериода,
		|	ИсчисленныйОПВР.ПериодРегистрации,
		|	ИсчисленныйОПВР.Организация,
		|	СУММА(ИсчисленныйОПВР.Взнос) КАК Взнос,
		|	СУММА(ИсчисленныйОПВР.ОблагаемаяБаза) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ИсчисленныйОПВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		РанееИсчисленныйОПВР.НомерСтроки КАК НомерСтроки,
		|		РанееИсчисленныйОПВР.ФизЛицо КАК ФизЛицо,
		|		РанееИсчисленныйОПВР.Взнос КАК Взнос,
		|		РанееИсчисленныйОПВР.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|		РанееИсчисленныйОПВР.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|		РанееИсчисленныйОПВР.ПериодРегистрации КАК ПериодРегистрации,
		|		РанееИсчисленныйОПВР.Организация КАК Организация
		|	ИЗ
		|		ВТ_РанееИсчисленныйОПВР КАК РанееИсчисленныйОПВР
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабличнаяЧастьОПВР.НомерСтроки,
		|		ТабличнаяЧастьОПВР.ФизЛицо,
		|		ТабличнаяЧастьОПВР.Взнос,
		|		ТабличнаяЧастьОПВР.МесяцНалоговогоПериода,
		|		ТабличнаяЧастьОПВР.ОблагаемаяБаза,
		|		ТабличнаяЧастьОПВР.ПериодРегистрации,
		|		ТабличнаяЧастьОПВР.Организация
		|	ИЗ
		|		ВТ_ТабличнаяЧастьОПВР КАК ТабличнаяЧастьОПВР) КАК ИсчисленныйОПВР
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсчисленныйОПВР.НомерСтроки,
		|	ИсчисленныйОПВР.ФизЛицо,
		|	ИсчисленныйОПВР.МесяцНалоговогоПериода,
		|	ИсчисленныйОПВР.ПериодРегистрации,
		|	ИсчисленныйОПВР.Организация
		|";
		
	Запрос.Текст = РанееИсчисленныеНалогиОтчисленияТекст;
	Запрос.Выполнить();
		
	ПериодыФизЛицаТекст = 
		"ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	ВТ_ТабличнаяЧастьСН
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ) 
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	ВТ_ТабличнаяЧастьСО 
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ) 
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	ВТ_ТабличнаяЧастьООСМС " + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ) 
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	ВТ_ТабличнаяЧастьОППВ", "") + "
		|
		|ОБЪЕДИНИТЬ // выбираем только различающиеся строки (без ВСЕ) 
		|
		|ВЫБРАТЬ
		|	ФизЛицо,
		|	" + ПолеПериод + " КАК Период
		|ИЗ
		|	ВТ_ТабличнаяЧастьОПВР
		|";
	
	ПериодыФизЛицаТекст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ * ПОМЕСТИТЬ ПериодыФизЛицаВТ ИЗ ("+ПериодыФизЛицаТекст+") КАК ЗапросПоПериодамДляВТ;" ;
	Запрос.Текст = ПериодыФизЛицаТекст;
	Запрос.Выполнить();
		
	ПериодыФизЛицаТекстВТ = "ВЫБРАТЬ * ИЗ ПериодыФизЛицаВТ КАК ВложенныйЗапросПериодыФизЛицаИзВТ";
	МестоРаботыТекст = ПроведениеРасчетов.СформироватьТекстЗапросаСтруктурныеЕдиницы(ПериодыФизЛицаТекстВТ, ВыборкаПоШапкеДокумента.Организация, Запрос, Истина);
	МестоРаботыТекст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ *  
						|	ПОМЕСТИТЬ МестоРаботыВТ
						|	ИЗ ("+МестоРаботыТекст+") КАК МестаРабот";
						
	Запрос.Текст = МестоРаботыТекст;
	Запрос.Выполнить();
	
	МестоРаботыВТ = "МестоРаботыВТ";
	
	
	// СОЦИАЛЬНЫЕ ОТЧИСЛЕНИЯ
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличнаяЧастьСО.НомерСтроки,
		|	ТабличнаяЧастьСО.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьСО.ПериодРегистрации,
		|	ТабличнаяЧастьСО.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьСО.МесяцНалоговогоПериода
		|	КОНЕЦ КАК ПериодДоходов,
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьСО.Организация
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьСО.Организация
		|	КОНЕЦ КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ КАК ПодразделениеОрганизации,", "") + "
		|	СУММА(ЕСТЬNULL(СОСведенияОДоходахОбороты.СуммаДоходаОборот, 0) - ЕСТЬNULL(СОСведенияОДоходахОбороты.СуммаВычетаОборот, 0)) КАК ОблагаемыйДоход
		|ПОМЕСТИТЬ ВТ_СведенияОДоходахСО
		|ИЗ
		|	ВТ_ИсчисленныеСО КАК ТабличнаяЧастьСО
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СОСведенияОДоходах.Обороты(
		|				,
		|				,
		|				Месяц,
		|				ПериодРегистрации = &парамПериодРегистрации
		|					И ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + ")
		|					И Налогоплательщик = &парамНалогоплательщик
		|					И СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)) КАК СОСведенияОДоходахОбороты
		|		ПО ТабличнаяЧастьСО.ФизЛицо = СОСведенияОДоходахОбороты.ФизЛицо
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьСО." + ПолеПериод + ", МЕСЯЦ)= НАЧАЛОПЕРИОДА(СОСведенияОДоходахОбороты.Период, МЕСЯЦ))
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьСО.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СОСведенияОДоходахОбороты.ПериодРегистрации, МЕСЯЦ))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + МестоРаботыВТ + " КАК МестаРаботы
		|		ПО ТабличнаяЧастьСО.ФизЛицо = МестаРаботы.ФизЛицо
		|			И ТабличнаяЧастьСО." + ПолеПериод + " = МестаРаботы.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьСО.НомерСтроки,
		|	ТабличнаяЧастьСО.ФизЛицо,
		|	ТабличнаяЧастьСО.ПериодРегистрации,
		|	ТабличнаяЧастьСО.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьСО.МесяцНалоговогоПериода
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьСО.Организация
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьСО.Организация
		|	КОНЕЦ" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	ВЫБОР
		|		КОГДА НЕ (СОСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА СОСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьСО.НомерСтроки КАК НомерСтроки,
		|	ТабличнаяЧастьСО.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьСО.Отчисление КАК Отчисление,
		|	ТабличнаяЧастьСО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТабличнаяЧастьСО.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|	СведенияОДоходахСО.СтруктурнаяЕдиница,
		|	СведенияОДоходахСО.Организация КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	СведенияОДоходахСО.ПодразделениеОрганизации,", "") + "
		|	СведенияОДоходахСО.ОблагаемыйДоход,
		|	ОбщаяСуммаДоходов.ОблагаемыйДоход КАК ОблагаемыйДоходВсего,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.ПорядокОкругления, ОбщийПорядокОкругления.ПорядокОкругления) КАК ПорядокОкругления,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.МетодОкругления, ОбщийПорядокОкругления.МетодОкругления) КАК МетодОкругления
		|ИЗ
		|	ВТ_ИсчисленныеСО КАК ТабличнаяЧастьСО
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СведенияОДоходахСО.НомерСтроки КАК НомерСтроки,
		|			СведенияОДоходахСО.ФизЛицо КАК ФизЛицо,
		|			СведенияОДоходахСО.ПериодРегистрации КАК ПериодРегистрации,
		|			СведенияОДоходахСО.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|			СведенияОДоходахСО.ПериодДоходов КАК ПериодДоходов,
		|			СУММА(СведенияОДоходахСО.ОблагаемыйДоход) КАК ОблагаемыйДоход
		|		ИЗ
		|			ВТ_СведенияОДоходахСО КАК СведенияОДоходахСО
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СведенияОДоходахСО.НомерСтроки,
		|			СведенияОДоходахСО.ФизЛицо,
		|			СведенияОДоходахСО.ПериодРегистрации,
		|			СведенияОДоходахСО.МесяцНалоговогоПериода,
		|			СведенияОДоходахСО.ПериодДоходов) КАК ОбщаяСуммаДоходов
		|		ПО ТабличнаяЧастьСО.НомерСтроки = ОбщаяСуммаДоходов.НомерСтроки
		|			И ТабличнаяЧастьСО.ФизЛицо = ОбщаяСуммаДоходов.ФизЛицо
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОДоходахСО КАК СведенияОДоходахСО
		|		ПО ТабличнаяЧастьСО.ФизЛицо = СведенияОДоходахСО.ФизЛицо
		|			И ТабличнаяЧастьСО.НомерСтроки = СведенияОДоходахСО.НомерСтроки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ВидРасчета = НЕОПРЕДЕЛЕНО) КАК ОбщийПорядокОкругления
		|		ПО (ИСТИНА)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ) КАК ИндивидуальныйПорядокОкругления
		|		ПО (ИндивидуальныйПорядокОкругления.ВидРасчета = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ФизЛицо,
		|	МесяцНалоговогоПериода
		|ИТОГИ
		|	МАКСИМУМ(Отчисление),
		|	МАКСИМУМ(ОблагаемаяБаза),
		|	МАКСИМУМ(ПорядокОкругления),
		|	МАКСИМУМ(МетодОкругления)
		|ПО
		|	НомерСтроки";
		
	РезультатЗапросаСО = Запрос.Выполнить();;
	
	// Ключевое поле
	КолонкаДляПоиска = "НомерСтроки";
	
	// Сформируем структуру таблицы для промежуточного хранения результатов распределения СО
	ТаблицаРаспределенияСО = Новый ТаблицаЗначений();
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияСО.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(10)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРаспределенияСО.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияСО.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияСО.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	Если РаспределятьНалогиПоПодразделениямОрганизаций Тогда
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ТаблицаРаспределенияСО.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Дата"));
	ТаблицаРаспределенияСО.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов(МассивТипов, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияСО.Колонки.Добавить("Отчисление", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));
	ТаблицаРаспределенияСО.Колонки.Добавить("ОблагаемаяБаза", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));

	// Распределяемые значения
	КолонкиДляРаспределения = Новый Массив;
	КолонкиДляРаспределения.Добавить("Отчисление");
	КолонкиДляРаспределения.Добавить("ОблагаемаяБаза");
	
	КолонкаКоэффициентов = "ОблагаемыйДоход";
	ПроведениеРасчетов.РаспределитьНалогиВзносыУдержанияПоСтруктурнымЕдиницам(ТаблицаРаспределенияСО, РезультатЗапросаСО, КолонкиДляРаспределения, КолонкаДляПоиска, КолонкаКоэффициентов);	
	
	ТаблицаРаспределенияСО.Свернуть("НомерСтроки, ФизЛицо, СтруктурнаяЕдиница, Организация, " + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "ПодразделениеОрганизации, ", "") + "МесяцНалоговогоПериода", 
									"Отчисление, ОблагаемаяБаза");

	// СОЦИАЛЬНЫЙ НАЛОГ
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличнаяЧастьСН.НомерСтроки,
		|	ТабличнаяЧастьСН.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьСН.ПериодРегистрации,
		|	ТабличнаяЧастьСН.МесяцНалоговогоПериода,
		|	ВЫБОР 
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьСН.МесяцНалоговогоПериода
		|	КОНЕЦ КАК ПериодДоходов,
		|	ВЫБОР
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьСН.Организация
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьСН.Организация
		|	КОНЕЦ КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ВЫБОР 
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ КАК ПодразделениеОрганизации,", "") + "
		|	СУММА(ЕСТЬNULL(СНСведенияОДоходахОбороты.СуммаДоходаОборот, 0) - ЕСТЬNULL(СНСведенияОДоходахОбороты.СуммаВычетаОборот, 0)) КАК ОблагаемыйДоход
		|ПОМЕСТИТЬ ВТ_СведенияОДоходахСН
		|ИЗ
		|	ВТ_ИсчисленныеСН КАК ТабличнаяЧастьСН
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СНСведенияОДоходах.Обороты(
		|				,
		|				,
		|				Месяц,
		|				ПериодРегистрации = &парамПериодРегистрации
		|					И ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + ")
		|					И Налогоплательщик = &парамНалогоплательщик
		|					И СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)) КАК СНСведенияОДоходахОбороты
		|		ПО ТабличнаяЧастьСН.ФизЛицо = СНСведенияОДоходахОбороты.ФизЛицо
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьСН." + ПолеПериод + ", МЕСЯЦ) = НАЧАЛОПЕРИОДА(СНСведенияОДоходахОбороты.Период, МЕСЯЦ))
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьСН.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(СНСведенияОДоходахОбороты.ПериодРегистрации, МЕСЯЦ))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + МестоРаботыВТ + " КАК МестаРаботы
		|		ПО ТабличнаяЧастьСН.ФизЛицо = МестаРаботы.ФизЛицо
		|			И ТабличнаяЧастьСН." + ПолеПериод + " = МестаРаботы.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьСН.НомерСтроки,
		|	ТабличнаяЧастьСН.ФизЛицо,
		|	ТабличнаяЧастьСН.ПериодРегистрации,
		|	ТабличнаяЧастьСН.МесяцНалоговогоПериода,
		|	ВЫБОР 
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьСН.МесяцНалоговогоПериода
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьСН.Организация
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьСН.Организация
		|	КОНЕЦ" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	ВЫБОР 
		|		КОГДА НЕ (СНСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА СНСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьСН.НомерСтроки КАК НомерСтроки,
		|	ТабличнаяЧастьСН.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьСН.Налог КАК Налог,
		|	ТабличнаяЧастьСН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТабличнаяЧастьСН.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|	СведенияОДоходахСН.СтруктурнаяЕдиница,
		|	СведенияОДоходахСН.Организация КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	СведенияОДоходахСН.ПодразделениеОрганизации,", "") + "
		|	СведенияОДоходахСН.ОблагаемыйДоход,
		|	ОбщаяСуммаДоходов.ОблагаемыйДоход КАК ОблагаемыйДоходВсего,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.ПорядокОкругления, ОбщийПорядокОкругления.ПорядокОкругления) КАК ПорядокОкругления,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.МетодОкругления, ОбщийПорядокОкругления.МетодОкругления) КАК МетодОкругления
		|ИЗ
		|	ВТ_ИсчисленныеСН КАК ТабличнаяЧастьСН
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СведенияОДоходахСН.НомерСтроки КАК НомерСтроки,
		|			СведенияОДоходахСН.ФизЛицо КАК ФизЛицо,
		|			СведенияОДоходахСН.ПериодРегистрации КАК ПериодРегистрации,
		|			СведенияОДоходахСН.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|			СведенияОДоходахСН.ПериодДоходов КАК ПериодДоходов,
		|			СУММА(СведенияОДоходахСН.ОблагаемыйДоход) КАК ОблагаемыйДоход
		|		ИЗ
		|			ВТ_СведенияОДоходахСН КАК СведенияОДоходахСН
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СведенияОДоходахСН.НомерСтроки,
		|			СведенияОДоходахСН.ФизЛицо,
		|			СведенияОДоходахСН.ПериодРегистрации,
		|			СведенияОДоходахСН.МесяцНалоговогоПериода,
		|			СведенияОДоходахСН.ПериодДоходов) КАК ОбщаяСуммаДоходов
		|		ПО ТабличнаяЧастьСН.НомерСтроки = ОбщаяСуммаДоходов.НомерСтроки
		|			И ТабличнаяЧастьСН.ФизЛицо = ОбщаяСуммаДоходов.ФизЛицо
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОДоходахСН КАК СведенияОДоходахСН
		|		ПО ТабличнаяЧастьСН.ФизЛицо = СведенияОДоходахСН.ФизЛицо
		|			И ТабличнаяЧастьСН.НомерСтроки = СведенияОДоходахСН.НомерСтроки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ВидРасчета = НЕОПРЕДЕЛЕНО) КАК ОбщийПорядокОкругления
		|		ПО (ИСТИНА)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ) КАК ИндивидуальныйПорядокОкругления
		|		ПО (ИндивидуальныйПорядокОкругления.ВидРасчета = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.СоциальныйНалог))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ФизЛицо,
		|	МесяцНалоговогоПериода
		|ИТОГИ
		|	МАКСИМУМ(Налог),
		|	МАКСИМУМ(ОблагаемаяБаза),
		|	МАКСИМУМ(ПорядокОкругления),
		|	МАКСИМУМ(МетодОкругления)
		|ПО
		|	НомерСтроки";
		
	РезультатЗапросаСН = Запрос.Выполнить();;
	
	// Ключевое поле
	КолонкаДляПоиска = "НомерСтроки";
	
	// Сформируем структуру таблицы для промежуточного хранения результатов распределения СН
	ТаблицаРаспределенияСН = Новый ТаблицаЗначений();
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияСН.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(10)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРаспределенияСН.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияСН.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияСН.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	Если РаспределятьНалогиПоПодразделениямОрганизаций Тогда
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ТаблицаРаспределенияСН.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Дата"));
	ТаблицаРаспределенияСН.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов(МассивТипов, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияСН.Колонки.Добавить("Налог", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));
	ТаблицаРаспределенияСН.Колонки.Добавить("ОблагаемаяБаза", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));
	
	// Распределяемые значения
	КолонкиДляРаспределения = Новый Массив;
	КолонкиДляРаспределения.Добавить("Налог");
	КолонкиДляРаспределения.Добавить("ОблагаемаяБаза");
	
	КолонкаКоэффициентов = "ОблагаемыйДоход";
	ПроведениеРасчетов.РаспределитьНалогиВзносыУдержанияПоСтруктурнымЕдиницам(ТаблицаРаспределенияСН, РезультатЗапросаСН, КолонкиДляРаспределения, КолонкаДляПоиска, КолонкаКоэффициентов);	
	
	ТаблицаРаспределенияСН.Свернуть("НомерСтроки, ФизЛицо, СтруктурнаяЕдиница, Организация, " + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "ПодразделениеОрганизации, ", "") + "МесяцНалоговогоПериода", 
									"Налог, ОблагаемаяБаза");
	
									
	Если мОрганизацияЯвляетсяВкладчикомОППВ Тогда
										
	// ОБЯЗАТЕЛЬНЫЕ ПРОФЕССИОНАЛЬНЕ ПЕНСИОННЫЕ ВЗНОСЫ
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличнаяЧастьОППВ.НомерСтроки,
		|	ТабличнаяЧастьОППВ.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьОППВ.ПериодРегистрации,
		|	ТабличнаяЧастьОППВ.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьОППВ.МесяцНалоговогоПериода
		|	КОНЕЦ КАК ПериодДоходов,
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьОППВ.Организация
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьОППВ.Организация
		|	КОНЕЦ КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ КАК ПодразделениеОрганизации,", "") + "
		|	СУММА(ЕСТЬNULL(ОППВСведенияОДоходахОбороты.СуммаДоходаОборот, 0) - ЕСТЬNULL(ОППВСведенияОДоходахОбороты.СуммаВычетаОборот, 0)) КАК ОблагаемыйДоход
		|ПОМЕСТИТЬ ВТ_СведенияОДоходахОППВ
		|ИЗ
		|	ВТ_ИсчисленныйОППВ КАК ТабличнаяЧастьОППВ
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОППВСведенияОДоходах.Обороты(
		|				,
		|				,
		|				Месяц,
		|				ПериодРегистрации = &парамПериодРегистрации
		|					И ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + ")
		|					И Налогоплательщик = &парамНалогоплательщик
		|					И СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)) КАК ОППВСведенияОДоходахОбороты
		|		ПО ТабличнаяЧастьОППВ.ФизЛицо = ОППВСведенияОДоходахОбороты.ФизЛицо
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьОППВ." + ПолеПериод + ", МЕСЯЦ)= НАЧАЛОПЕРИОДА(ОППВСведенияОДоходахОбороты.Период, МЕСЯЦ))
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьОППВ.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ОППВСведенияОДоходахОбороты.ПериодРегистрации, МЕСЯЦ))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + МестоРаботыВТ + " КАК МестаРаботы
		|		ПО ТабличнаяЧастьОППВ.ФизЛицо = МестаРаботы.ФизЛицо
		|			И ТабличнаяЧастьОППВ." + ПолеПериод + " = МестаРаботы.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьОППВ.НомерСтроки,
		|	ТабличнаяЧастьОППВ.ФизЛицо,
		|	ТабличнаяЧастьОППВ.ПериодРегистрации,
		|	ТабличнаяЧастьОППВ.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьОППВ.МесяцНалоговогоПериода
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьОППВ.Организация
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьОППВ.Организация
		|	КОНЕЦ" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	ВЫБОР
		|		КОГДА НЕ (ОППВСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА ОППВСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьОППВ.НомерСтроки КАК НомерСтроки,
		|	ТабличнаяЧастьОППВ.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьОППВ.Взнос КАК Взнос,
		|	ТабличнаяЧастьОППВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТабличнаяЧастьОППВ.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|	СведенияОДоходахОППВ.СтруктурнаяЕдиница,
		|	СведенияОДоходахОППВ.Организация КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	СведенияОДоходахОППВ.ПодразделениеОрганизации,", "") + "
		|	СведенияОДоходахОППВ.ОблагаемыйДоход,
		|	ОбщаяСуммаДоходов.ОблагаемыйДоход КАК ОблагаемыйДоходВсего,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.ПорядокОкругления, ОбщийПорядокОкругления.ПорядокОкругления) КАК ПорядокОкругления,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.МетодОкругления, ОбщийПорядокОкругления.МетодОкругления) КАК МетодОкругления
		|ИЗ
		|	ВТ_ИсчисленныйОППВ КАК ТабличнаяЧастьОППВ
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СведенияОДоходахОППВ.НомерСтроки КАК НомерСтроки,
		|			СведенияОДоходахОППВ.ФизЛицо КАК ФизЛицо,
		|			СведенияОДоходахОППВ.ПериодРегистрации КАК ПериодРегистрации,
		|			СведенияОДоходахОППВ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|			СведенияОДоходахОППВ.ПериодДоходов КАК ПериодДоходов,
		|			СУММА(СведенияОДоходахОППВ.ОблагаемыйДоход) КАК ОблагаемыйДоход
		|		ИЗ
		|			ВТ_СведенияОДоходахОППВ КАК СведенияОДоходахОППВ
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СведенияОДоходахОППВ.НомерСтроки,
		|			СведенияОДоходахОППВ.ФизЛицо,
		|			СведенияОДоходахОППВ.ПериодРегистрации,
		|			СведенияОДоходахОППВ.МесяцНалоговогоПериода,
		|			СведенияОДоходахОППВ.ПериодДоходов) КАК ОбщаяСуммаДоходов
		|		ПО ТабличнаяЧастьОППВ.НомерСтроки = ОбщаяСуммаДоходов.НомерСтроки
		|			И ТабличнаяЧастьОППВ.ФизЛицо = ОбщаяСуммаДоходов.ФизЛицо
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОДоходахОППВ КАК СведенияОДоходахОППВ
		|		ПО ТабличнаяЧастьОППВ.ФизЛицо = СведенияОДоходахОППВ.ФизЛицо
		|			И ТабличнаяЧастьОППВ.НомерСтроки = СведенияОДоходахОППВ.НомерСтроки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ВидРасчета = НЕОПРЕДЕЛЕНО) КАК ОбщийПорядокОкругления
		|		ПО (ИСТИНА)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ) КАК ИндивидуальныйПорядокОкругления
		|		ПО (ИндивидуальныйПорядокОкругления.ВидРасчета = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ФизЛицо,
		|	МесяцНалоговогоПериода
		|ИТОГИ
		|	МАКСИМУМ(Взнос),
		|	МАКСИМУМ(ОблагаемаяБаза),
		|	МАКСИМУМ(ПорядокОкругления),
		|	МАКСИМУМ(МетодОкругления)
		|ПО
		|	НомерСтроки";
		
	РезультатЗапросаОППВ = Запрос.Выполнить();;
	
	// Ключевое поле
	КолонкаДляПоиска = "НомерСтроки";
	
	// Сформируем структуру таблицы для промежуточного хранения результатов распределения СО
	ТаблицаРаспределенияОППВ = Новый ТаблицаЗначений();
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияОППВ.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(10)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРаспределенияОППВ.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияОППВ.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияОППВ.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	Если РаспределятьНалогиПоПодразделениямОрганизаций Тогда
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ТаблицаРаспределенияОППВ.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Дата"));
	ТаблицаРаспределенияОППВ.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов(МассивТипов, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияОППВ.Колонки.Добавить("Взнос", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));
	ТаблицаРаспределенияОППВ.Колонки.Добавить("ОблагаемаяБаза", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));

	// Распределяемые значения
	КолонкиДляРаспределения = Новый Массив;
	КолонкиДляРаспределения.Добавить("Взнос");
	КолонкиДляРаспределения.Добавить("ОблагаемаяБаза");
	
	КолонкаКоэффициентов = "ОблагаемыйДоход";
	ПроведениеРасчетов.РаспределитьНалогиВзносыУдержанияПоСтруктурнымЕдиницам(ТаблицаРаспределенияОППВ, РезультатЗапросаОППВ, КолонкиДляРаспределения, КолонкаДляПоиска, КолонкаКоэффициентов);	
	
	ТаблицаРаспределенияОППВ.Свернуть("НомерСтроки, ФизЛицо, СтруктурнаяЕдиница, Организация, " + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "ПодразделениеОрганизации, ", "") + "МесяцНалоговогоПериода", 
									"Взнос, ОблагаемаяБаза");
									
	КонецЕсли;
	
	// ОБЯЗАТЕЛЬНЫЕ ПЕНСИОННЫЕ ВЗНОСЫ РАБОТОДАТЕЛЯ
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличнаяЧастьОПВР.НомерСтроки,
		|	ТабличнаяЧастьОПВР.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьОПВР.ПериодРегистрации,
		|	ТабличнаяЧастьОПВР.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьОПВР.МесяцНалоговогоПериода
		|	КОНЕЦ КАК ПериодДоходов,
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьОПВР.Организация
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьОПВР.Организация
		|	КОНЕЦ КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ КАК ПодразделениеОрганизации,", "") + "
		|	СУММА(ЕСТЬNULL(ОПВРСведенияОДоходахОбороты.СуммаДоходаОборот, 0) - ЕСТЬNULL(ОПВРСведенияОДоходахОбороты.СуммаВычетаОборот, 0)) КАК ОблагаемыйДоход
		|ПОМЕСТИТЬ ВТ_СведенияОДоходахОПВР
		|ИЗ
		|	ВТ_ИсчисленныйОПВР КАК ТабличнаяЧастьОПВР
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОПВРСведенияОДоходах.Обороты(
		|				,
		|				,
		|				Месяц,
		|				ПериодРегистрации = &парамПериодРегистрации
		|					И ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + ")
		|					И Налогоплательщик = &парамНалогоплательщик
		|					И СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)) КАК ОПВРСведенияОДоходахОбороты
		|		ПО ТабличнаяЧастьОПВР.ФизЛицо = ОПВРСведенияОДоходахОбороты.ФизЛицо
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьОПВР." + ПолеПериод + ", МЕСЯЦ)= НАЧАЛОПЕРИОДА(ОПВРСведенияОДоходахОбороты.Период, МЕСЯЦ))
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьОПВР.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ОПВРСведенияОДоходахОбороты.ПериодРегистрации, МЕСЯЦ))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + МестоРаботыВТ + " КАК МестаРаботы
		|		ПО ТабличнаяЧастьОПВР.ФизЛицо = МестаРаботы.ФизЛицо
		|			И ТабличнаяЧастьОПВР." + ПолеПериод + " = МестаРаботы.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьОПВР.НомерСтроки,
		|	ТабличнаяЧастьОПВР.ФизЛицо,
		|	ТабличнаяЧастьОПВР.ПериодРегистрации,
		|	ТабличнаяЧастьОПВР.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьОПВР.МесяцНалоговогоПериода
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьОПВР.Организация
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьОПВР.Организация
		|	КОНЕЦ" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	ВЫБОР
		|		КОГДА НЕ (ОПВРСведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА ОПВРСведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьОПВР.НомерСтроки КАК НомерСтроки,
		|	ТабличнаяЧастьОПВР.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьОПВР.Взнос КАК Взнос,
		|	ТабличнаяЧастьОПВР.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТабличнаяЧастьОПВР.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|	СведенияОДоходахОПВР.СтруктурнаяЕдиница,
		|	СведенияОДоходахОПВР.Организация КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	СведенияОДоходахОПВР.ПодразделениеОрганизации,", "") + "
		|	СведенияОДоходахОПВР.ОблагаемыйДоход,
		|	ОбщаяСуммаДоходов.ОблагаемыйДоход КАК ОблагаемыйДоходВсего,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.ПорядокОкругления, ОбщийПорядокОкругления.ПорядокОкругления) КАК ПорядокОкругления,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.МетодОкругления, ОбщийПорядокОкругления.МетодОкругления) КАК МетодОкругления
		|ИЗ
		|	ВТ_ИсчисленныйОПВР КАК ТабличнаяЧастьОПВР
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СведенияОДоходахОПВР.НомерСтроки КАК НомерСтроки,
		|			СведенияОДоходахОПВР.ФизЛицо КАК ФизЛицо,
		|			СведенияОДоходахОПВР.ПериодРегистрации КАК ПериодРегистрации,
		|			СведенияОДоходахОПВР.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|			СведенияОДоходахОПВР.ПериодДоходов КАК ПериодДоходов,
		|			СУММА(СведенияОДоходахОПВР.ОблагаемыйДоход) КАК ОблагаемыйДоход
		|		ИЗ
		|			ВТ_СведенияОДоходахОПВР КАК СведенияОДоходахОПВР
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СведенияОДоходахОПВР.НомерСтроки,
		|			СведенияОДоходахОПВР.ФизЛицо,
		|			СведенияОДоходахОПВР.ПериодРегистрации,
		|			СведенияОДоходахОПВР.МесяцНалоговогоПериода,
		|			СведенияОДоходахОПВР.ПериодДоходов) КАК ОбщаяСуммаДоходов
		|		ПО ТабличнаяЧастьОПВР.НомерСтроки = ОбщаяСуммаДоходов.НомерСтроки
		|			И ТабличнаяЧастьОПВР.ФизЛицо = ОбщаяСуммаДоходов.ФизЛицо
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СведенияОДоходахОПВР КАК СведенияОДоходахОПВР
		|		ПО ТабличнаяЧастьОПВР.ФизЛицо = СведенияОДоходахОПВР.ФизЛицо
		|			И ТабличнаяЧастьОПВР.НомерСтроки = СведенияОДоходахОПВР.НомерСтроки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ВидРасчета = НЕОПРЕДЕЛЕНО) КАК ОбщийПорядокОкругления
		|		ПО (ИСТИНА)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ) КАК ИндивидуальныйПорядокОкругления
		|		ПО (ИндивидуальныйПорядокОкругления.ВидРасчета = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОбязательныеСоциальныеОтчисления))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ФизЛицо,
		|	МесяцНалоговогоПериода
		|ИТОГИ
		|	МАКСИМУМ(Взнос),
		|	МАКСИМУМ(ОблагаемаяБаза),
		|	МАКСИМУМ(ПорядокОкругления),
		|	МАКСИМУМ(МетодОкругления)
		|ПО
		|	НомерСтроки";
		
	РезультатЗапросаОПВР = Запрос.Выполнить();;
	
	// Ключевое поле
	КолонкаДляПоиска = "НомерСтроки";
	
	// Сформируем структуру таблицы для промежуточного хранения результатов распределения СО
	ТаблицаРаспределенияОПВР = Новый ТаблицаЗначений();
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияОПВР.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(10)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРаспределенияОПВР.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияОПВР.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияОПВР.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	Если РаспределятьНалогиПоПодразделениямОрганизаций Тогда
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ТаблицаРаспределенияОПВР.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Дата"));
	ТаблицаРаспределенияОПВР.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов(МассивТипов, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияОПВР.Колонки.Добавить("Взнос", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));
	ТаблицаРаспределенияОПВР.Колонки.Добавить("ОблагаемаяБаза", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));

	// Распределяемые значения
	КолонкиДляРаспределения = Новый Массив;
	КолонкиДляРаспределения.Добавить("Взнос");
	КолонкиДляРаспределения.Добавить("ОблагаемаяБаза");
	
	КолонкаКоэффициентов = "ОблагаемыйДоход";
	ПроведениеРасчетов.РаспределитьНалогиВзносыУдержанияПоСтруктурнымЕдиницам(ТаблицаРаспределенияОПВР, РезультатЗапросаОПВР, КолонкиДляРаспределения, КолонкаДляПоиска, КолонкаКоэффициентов);	
	
	ТаблицаРаспределенияОПВР.Свернуть("НомерСтроки, ФизЛицо, СтруктурнаяЕдиница, Организация, " + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "ПодразделениеОрганизации, ", "") + "МесяцНалоговогоПериода", 
									"Взнос, ОблагаемаяБаза");
	
	// ОТЧИСЛЕНИЯ ОСМС
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабличнаяЧастьООСМС.НомерСтроки,
		|	ТабличнаяЧастьООСМС.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьООСМС.ПериодРегистрации,
		|	ТабличнаяЧастьООСМС.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьООСМС.МесяцНалоговогоПериода
		|	КОНЕЦ КАК ПериодДоходов,
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьООСМС.Организация
		|	КОНЕЦ КАК СтруктурнаяЕдиница,
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьООСМС.Организация
		|	КОНЕЦ КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ КАК ПодразделениеОрганизации,", "") + "
		|	СУММА(ЕСТЬNULL(ООСМССведенияОДоходахОбороты.СуммаДоходаОборот, 0) - ЕСТЬNULL(ООСМССведенияОДоходахОбороты.СуммаВычетаОборот, 0)) КАК ОблагаемыйДоход
		|ПОМЕСТИТЬ ВТ_ООСМССведенияОДоходах
		|ИЗ
		|	ВТ_ИсчисленныеОтчисленияОСМС КАК ТабличнаяЧастьООСМС
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ООСМССведенияОДоходах.Обороты(
		|				,
		|				,
		|				Месяц,
		|				ПериодРегистрации = &парамПериодРегистрации
		|					И ФизЛицо В (ВЫБРАТЬ ФизЛицо ИЗ " + СписокФизЛицТекст + ")
		|					И Налогоплательщик = &парамНалогоплательщик
		|					И СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)) КАК ООСМССведенияОДоходахОбороты
		|		ПО ТабличнаяЧастьООСМС.ФизЛицо = ООСМССведенияОДоходахОбороты.ФизЛицо
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьООСМС." + ПолеПериод + ", МЕСЯЦ)= НАЧАЛОПЕРИОДА(ООСМССведенияОДоходахОбороты.Период, МЕСЯЦ))
		|			И (НАЧАЛОПЕРИОДА(ТабличнаяЧастьООСМС.ПериодРегистрации, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ООСМССведенияОДоходахОбороты.ПериодРегистрации, МЕСЯЦ))
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ " + МестоРаботыВТ + " КАК МестаРаботы
		|		ПО ТабличнаяЧастьООСМС.ФизЛицо = МестаРаботы.ФизЛицо
		|			И ТабличнаяЧастьООСМС." + ПолеПериод + " = МестаРаботы.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьООСМС.НомерСтроки,
		|	ТабличнаяЧастьООСМС.ФизЛицо,
		|	ТабличнаяЧастьООСМС.ПериодРегистрации,
		|	ТабличнаяЧастьООСМС.МесяцНалоговогоПериода,
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.Период ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.Период
		|		ИНАЧЕ ТабличнаяЧастьООСМС.МесяцНалоговогоПериода
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.СтруктурнаяЕдиница
		|		КОГДА НЕ (МестаРаботы.СтруктурнаяЕдиница ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.СтруктурнаяЕдиница
		|		ИНАЧЕ ТабличнаяЧастьООСМС.Организация
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.Организация ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.Организация
		|		ИНАЧЕ ТабличнаяЧастьООСМС.Организация
		|	КОНЕЦ" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, ",
		|	ВЫБОР
		|		КОГДА НЕ (ООСМССведенияОДоходахОбороты.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА ООСМССведенияОДоходахОбороты.ПодразделениеОрганизации
		|		КОГДА НЕ (МестаРаботы.ПодразделениеОрганизации ЕСТЬ NULL)
		|			ТОГДА МестаРаботы.ПодразделениеОрганизации
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
		|	КОНЕЦ", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабличнаяЧастьООСМС.НомерСтроки КАК НомерСтроки,
		|	ТабличнаяЧастьООСМС.ФизЛицо КАК ФизЛицо,
		|	ТабличнаяЧастьООСМС.Отчисление КАК Отчисление,
		|	ТабличнаяЧастьООСМС.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|	ТабличнаяЧастьООСМС.ОблагаемаяБаза КАК ОблагаемаяБаза,
		|	ООСМССведенияОДоходах.СтруктурнаяЕдиница,
		|	ООСМССведенияОДоходах.Организация КАК Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ООСМССведенияОДоходах.ПодразделениеОрганизации,", "") + "
		|	ООСМССведенияОДоходах.ОблагаемыйДоход,
		|	ОбщаяСуммаДоходов.ОблагаемыйДоход КАК ОблагаемыйДоходВсего,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.ПорядокОкругления, ОбщийПорядокОкругления.ПорядокОкругления) КАК ПорядокОкругления,
		|	ЕСТЬNULL(ИндивидуальныйПорядокОкругления.МетодОкругления, ОбщийПорядокОкругления.МетодОкругления) КАК МетодОкругления
		|ИЗ
		|	ВТ_ИсчисленныеОтчисленияОСМС КАК ТабличнаяЧастьООСМС
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ООСМССведенияОДоходах.НомерСтроки КАК НомерСтроки,
		|			ООСМССведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|			ООСМССведенияОДоходах.ПериодРегистрации КАК ПериодРегистрации,
		|			ООСМССведенияОДоходах.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
		|			ООСМССведенияОДоходах.ПериодДоходов КАК ПериодДоходов,
		|			СУММА(ООСМССведенияОДоходах.ОблагаемыйДоход) КАК ОблагаемыйДоход
		|		ИЗ
		|			ВТ_ООСМССведенияОДоходах КАК ООСМССведенияОДоходах
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ООСМССведенияОДоходах.НомерСтроки,
		|			ООСМССведенияОДоходах.ФизЛицо,
		|			ООСМССведенияОДоходах.ПериодРегистрации,
		|			ООСМССведенияОДоходах.МесяцНалоговогоПериода,
		|			ООСМССведенияОДоходах.ПериодДоходов) КАК ОбщаяСуммаДоходов
		|		ПО ТабличнаяЧастьООСМС.НомерСтроки = ОбщаяСуммаДоходов.НомерСтроки
		|			И ТабличнаяЧастьООСМС.ФизЛицо = ОбщаяСуммаДоходов.ФизЛицо
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ООСМССведенияОДоходах КАК ООСМССведенияОДоходах
		|		ПО ТабличнаяЧастьООСМС.ФизЛицо = ООСМССведенияОДоходах.ФизЛицо
		|			И ТабличнаяЧастьООСМС.НомерСтроки = ООСМССведенияОДоходах.НомерСтроки
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ВидРасчета = НЕОПРЕДЕЛЕНО) КАК ОбщийПорядокОкругления
		|		ПО (ИСТИНА)
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОкругленияРезультатовРасчетаЗарплаты.СрезПоследних(&парамПериодРегистрации, ) КАК ИндивидуальныйПорядокОкругления
		|		ПО (ИндивидуальныйПорядокОкругления.ВидРасчета = ЗНАЧЕНИЕ(Справочник.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	ФизЛицо,
		|	МесяцНалоговогоПериода
		|ИТОГИ
		|	МАКСИМУМ(Отчисление),
		|	МАКСИМУМ(ОблагаемаяБаза),
		|	МАКСИМУМ(ПорядокОкругления),
		|	МАКСИМУМ(МетодОкругления)
		|ПО
		|	НомерСтроки";
		
	РезультатЗапросаООСМС = Запрос.Выполнить();
	
	// Ключевое поле
	КолонкаДляПоиска = "НомерСтроки";
	
	// Сформируем структуру таблицы для промежуточного хранения результатов распределения ООСМС
	ТаблицаРаспределенияООСМС = Новый ТаблицаЗначений();
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияООСМС.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(10)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
	ТаблицаРаспределенияООСМС.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияООСМС.Колонки.Добавить("СтруктурнаяЕдиница", Новый ОписаниеТипов(МассивТипов));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("СправочникСсылка.Организации"));
	ТаблицаРаспределенияООСМС.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	Если РаспределятьНалогиПоПодразделениямОрганизаций Тогда
		МассивТипов.Очистить();
		МассивТипов.Добавить(Тип("СправочникСсылка.ПодразделенияОрганизаций"));
		ТаблицаРаспределенияООСМС.Колонки.Добавить("ПодразделениеОрганизации", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Дата"));
	ТаблицаРаспределенияООСМС.Колонки.Добавить("МесяцНалоговогоПериода", Новый ОписаниеТипов(МассивТипов, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	МассивТипов.Очистить();
	МассивТипов.Добавить(Тип("Число"));
	ТаблицаРаспределенияООСМС.Колонки.Добавить("Отчисление", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));
	ТаблицаРаспределенияООСМС.Колонки.Добавить("ОблагаемаяБаза", Новый ОписаниеТипов(МассивТипов, , , Новый КвалификаторыЧисла(15,2)));

	// Распределяемые значения
	КолонкиДляРаспределения = Новый Массив;
	КолонкиДляРаспределения.Добавить("Отчисление");
	КолонкиДляРаспределения.Добавить("ОблагаемаяБаза");
	
	КолонкаКоэффициентов = "ОблагаемыйДоход";
	ПроведениеРасчетов.РаспределитьНалогиВзносыУдержанияПоСтруктурнымЕдиницам(ТаблицаРаспределенияООСМС, РезультатЗапросаООСМС, КолонкиДляРаспределения, КолонкаДляПоиска, КолонкаКоэффициентов);	
	
	ТаблицаРаспределенияООСМС.Свернуть("НомерСтроки, ФизЛицо, СтруктурнаяЕдиница, Организация, " + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "ПодразделениеОрганизации, ", "") + "МесяцНалоговогоПериода", 
									"Отчисление, ОблагаемаяБаза");

								
	// Финальный запрос
	Запрос.УстановитьПараметр("ТаблицаСО", ТаблицаРаспределенияСО);
	Запрос.УстановитьПараметр("ТаблицаСН", ТаблицаРаспределенияСН);
	Запрос.УстановитьПараметр("ТаблицаООСМС", ТаблицаРаспределенияООСМС);
	Запрос.УстановитьПараметр("ТаблицаОПВР", ТаблицаРаспределенияОПВР);
	
	Если мОрганизацияЯвляетсяВкладчикомОППВ Тогда
		Запрос.УстановитьПараметр("ТаблицаОППВ", ТаблицаРаспределенияОППВ);
	КонецЕсли;
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСО.НомерСтроки,
		|	ТаблицаСО.ФизЛицо,
		|	ТаблицаСО.СтруктурнаяЕдиница,
		|	ТаблицаСО.Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ТаблицаСО.ПодразделениеОрганизации,", "") + "
		|	ТаблицаСО.МесяцНалоговогоПериода,
		|	ТаблицаСО.Отчисление КАК Отчисление,
		|	ТаблицаСО.ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ДанныеРаспределенияСО
		|ИЗ
		|	&ТаблицаСО КАК ТаблицаСО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСН.НомерСтроки,
		|	ТаблицаСН.ФизЛицо,
		|	ТаблицаСН.СтруктурнаяЕдиница,
		|	ТаблицаСН.Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ТаблицаСН.ПодразделениеОрганизации,", "") + "
		|	ТаблицаСН.МесяцНалоговогоПериода,
		|	ТаблицаСН.Налог,
		|	ТаблицаСН.ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ДанныеРаспределенияСН
		|ИЗ
		|	&ТаблицаСН КАК ТаблицаСН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаООСМС.НомерСтроки,
		|	ТаблицаООСМС.ФизЛицо,
		|	ТаблицаООСМС.СтруктурнаяЕдиница,
		|	ТаблицаООСМС.Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ТаблицаООСМС.ПодразделениеОрганизации,", "") + "
		|	ТаблицаООСМС.МесяцНалоговогоПериода,
		|	ТаблицаООСМС.Отчисление КАК Отчисление,
		|	ТаблицаООСМС.ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ДанныеРаспределенияООСМС
		|ИЗ
		|	&ТаблицаООСМС КАК ТаблицаООСМС
		|;
		|
		|" + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОППВ.НомерСтроки,
		|	ТаблицаОППВ.ФизЛицо,
		|	ТаблицаОППВ.СтруктурнаяЕдиница,
		|	ТаблицаОППВ.Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ТаблицаОППВ.ПодразделениеОрганизации,", "") + "
		|	ТаблицаОППВ.МесяцНалоговогоПериода,
		|	ТаблицаОППВ.Взнос,
		|	ТаблицаОППВ.ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ДанныеРаспределенияОППВ
		|ИЗ
		|	&ТаблицаОППВ КАК ТаблицаОППВ
		|;
		|", "") + "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаОПВР.НомерСтроки,
		|	ТаблицаОПВР.ФизЛицо,
		|	ТаблицаОПВР.СтруктурнаяЕдиница,
		|	ТаблицаОПВР.Организация," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ТаблицаОПВР.ПодразделениеОрганизации,", "") + "
		|	ТаблицаОПВР.МесяцНалоговогоПериода,
		|	ТаблицаОПВР.Взнос,
		|	ТаблицаОПВР.ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ДанныеРаспределенияОПВР
		|ИЗ
		|	&ТаблицаОПВР КАК ТаблицаОПВР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ИсчисленныеСО"" КАК ВидСтрокиЗапроса,
		|	ЕСТЬNULL(ТаблицаСО.НомерСтроки, РанееИсчисленныеСО.НомерСтроки) КАК НомерСтроки,
		|	ЕСТЬNULL(ТаблицаСО.ФизЛицо, РанееИсчисленныеСО.ФизЛицо) КАК ФизЛицо,
		|	ЕСТЬNULL(ТаблицаСО.СтруктурнаяЕдиница, РанееИсчисленныеСО.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ЕСТЬNULL(ТаблицаСО.ПодразделениеОрганизации, РанееИсчисленныеСО.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,", "") + "
		|	ЕСТЬNULL(ТаблицаСО.МесяцНалоговогоПериода, РанееИсчисленныеСО.МесяцНалоговогоПериода) КАК МесяцНалоговогоПериода,
		|	0 КАК Налог,
		|	(ЕСТЬNULL(ТаблицаСО.Отчисление, 0) - ЕСТЬNULL(РанееИсчисленныеСО.Отчисление, 0)) КАК Отчисление,
		|	0 КАК Взнос,
		|	(ЕСТЬNULL(ТаблицаСО.ОблагаемаяБаза, 0) - ЕСТЬNULL(РанееИсчисленныеСО.ОблагаемаяБаза, 0)) КАК ОблагаемаяБаза
		|ПОМЕСТИТЬ ВТ_ДанныеРаспределения
		|ИЗ
		|	ВТ_ДанныеРаспределенияСО КАК ТаблицаСО
		|		
		|	ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РанееИсчисленныеСО КАК РанееИсчисленныеСО
		|		ПО ТаблицаСО.НомерСтроки =  РанееИсчисленныеСО.НомерСтроки
		|			И ТаблицаСО.СтруктурнаяЕдиница =  РанееИсчисленныеСО.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|			И ТаблицаСО.ПодразделениеОрганизации =  РанееИсчисленныеСО.ПодразделениеОрганизации", "") + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ИсчисленныйСН"" КАК ВидСтрокиЗапроса,
		|	ЕСТЬNULL(ТаблицаСН.НомерСтроки, РанееИсчисленныйСН.НомерСтроки) КАК НомерСтроки,
		|	ЕСТЬNULL(ТаблицаСН.ФизЛицо, РанееИсчисленныйСН.ФизЛицо) КАК ФизЛицо,
		|	ЕСТЬNULL(ТаблицаСН.СтруктурнаяЕдиница, РанееИсчисленныйСН.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ЕСТЬNULL(ТаблицаСН.ПодразделениеОрганизации, РанееИсчисленныйСН.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,", "") + "
		|	ЕСТЬNULL(ТаблицаСН.МесяцНалоговогоПериода, РанееИсчисленныйСН.МесяцНалоговогоПериода) КАК МесяцНалоговогоПериода,
		|	(ЕСТЬNULL(ТаблицаСН.Налог, 0) - ЕСТЬNULL(РанееИсчисленныйСН.Налог, 0)) КАК Налог,
		|	0 КАК Отчисление,
		|	0 КАК Взнос,
		|	(ЕСТЬNULL(ТаблицаСН.ОблагаемаяБаза, 0) - ЕСТЬNULL(РанееИсчисленныйСН.ОблагаемаяБаза, 0)) КАК ОблагаемаяБаза
		|ИЗ
		|	ВТ_ДанныеРаспределенияСН КАК ТаблицаСН
		|
		|	ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РанееИсчисленныйСН КАК РанееИсчисленныйСН
		|		ПО ТаблицаСН.НомерСтроки =  РанееИсчисленныйСН.НомерСтроки
		|			И ТаблицаСН.СтруктурнаяЕдиница =  РанееИсчисленныйСН.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|			И ТаблицаСН.ПодразделениеОрганизации =  РанееИсчисленныйСН.ПодразделениеОрганизации", "") + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ИсчисленныеОтчисленияОСМС"" КАК ВидСтрокиЗапроса,
		|	ЕСТЬNULL(ТаблицаООСМС.НомерСтроки, РанееИсчисленныеОтчисленияОСМС.НомерСтроки) КАК НомерСтроки,
		|	ЕСТЬNULL(ТаблицаООСМС.ФизЛицо, РанееИсчисленныеОтчисленияОСМС.ФизЛицо) КАК ФизЛицо,
		|	ЕСТЬNULL(ТаблицаООСМС.СтруктурнаяЕдиница, РанееИсчисленныеОтчисленияОСМС.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ЕСТЬNULL(ТаблицаООСМС.ПодразделениеОрганизации, РанееИсчисленныеОтчисленияОСМС.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,", "") + "
		|	ЕСТЬNULL(ТаблицаООСМС.МесяцНалоговогоПериода, РанееИсчисленныеОтчисленияОСМС.МесяцНалоговогоПериода) КАК МесяцНалоговогоПериода,
		|	0 КАК Налог,
		|	(ЕСТЬNULL(ТаблицаООСМС.Отчисление, 0) - ЕСТЬNULL(РанееИсчисленныеОтчисленияОСМС.Отчисление, 0)) КАК Отчисление,
		|	0 КАК Взнос,
		|	(ЕСТЬNULL(ТаблицаООСМС.ОблагаемаяБаза, 0) - ЕСТЬNULL(РанееИсчисленныеОтчисленияОСМС.ОблагаемаяБаза, 0)) КАК ОблагаемаяБаза
		|ИЗ
		|	ВТ_ДанныеРаспределенияООСМС КАК ТаблицаООСМС
		|		
		|	ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РанееИсчисленныеОтчисленияОСМС КАК РанееИсчисленныеОтчисленияОСМС
		|		ПО ТаблицаООСМС.НомерСтроки =  РанееИсчисленныеОтчисленияОСМС.НомерСтроки
		|			И ТаблицаООСМС.СтруктурнаяЕдиница =  РанееИсчисленныеОтчисленияОСМС.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|			И ТаблицаООСМС.ПодразделениеОрганизации =  РанееИсчисленныеОтчисленияОСМС.ПодразделениеОрганизации", "") + ?(мОрганизацияЯвляетсяВкладчикомОППВ, "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ИсчисленныйОППВ"" КАК ВидСтрокиЗапроса,
		|	ЕСТЬNULL(ТаблицаОППВ.НомерСтроки, РанееИсчисленныйОППВ.НомерСтроки) КАК НомерСтроки,
		|	ЕСТЬNULL(ТаблицаОППВ.ФизЛицо, РанееИсчисленныйОППВ.ФизЛицо) КАК ФизЛицо,
		|	ЕСТЬNULL(ТаблицаОППВ.СтруктурнаяЕдиница, РанееИсчисленныйОППВ.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ЕСТЬNULL(ТаблицаОППВ.ПодразделениеОрганизации, РанееИсчисленныйОППВ.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,", "") + "
		|	ЕСТЬNULL(ТаблицаОППВ.МесяцНалоговогоПериода, РанееИсчисленныйОППВ.МесяцНалоговогоПериода) КАК МесяцНалоговогоПериода,
		|	0 КАК Налог,
		|	0 КАК Отчисление,
		|	(ЕСТЬNULL(ТаблицаОППВ.Взнос, 0) - ЕСТЬNULL(РанееИсчисленныйОППВ.Взнос, 0)) КАК Взнос,
		|	(ЕСТЬNULL(ТаблицаОППВ.ОблагаемаяБаза, 0) - ЕСТЬNULL(РанееИсчисленныйОППВ.ОблагаемаяБаза, 0)) КАК ОблагаемаяБаза
		|ИЗ
		|	ВТ_ДанныеРаспределенияОППВ КАК ТаблицаОППВ
		|
		|	ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РанееИсчисленныйОППВ КАК РанееИсчисленныйОППВ
		|		ПО ТаблицаОППВ.НомерСтроки =  РанееИсчисленныйОППВ.НомерСтроки
		|			И ТаблицаОППВ.СтруктурнаяЕдиница =  РанееИсчисленныйОППВ.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|			И ТаблицаОППВ.ПодразделениеОрганизации =  РанееИсчисленныйОППВ.ПодразделениеОрганизации", ""), "") + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""ИсчисленныйОПВР"" КАК ВидСтрокиЗапроса,
		|	ЕСТЬNULL(ТаблицаОПВР.НомерСтроки, РанееИсчисленныйОПВР.НомерСтроки) КАК НомерСтроки,
		|	ЕСТЬNULL(ТаблицаОПВР.ФизЛицо, РанееИсчисленныйОПВР.ФизЛицо) КАК ФизЛицо,
		|	ЕСТЬNULL(ТаблицаОПВР.СтруктурнаяЕдиница, РанееИсчисленныйОПВР.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ЕСТЬNULL(ТаблицаОПВР.ПодразделениеОрганизации, РанееИсчисленныйОПВР.ПодразделениеОрганизации) КАК ПодразделениеОрганизации,", "") + "
		|	ЕСТЬNULL(ТаблицаОПВР.МесяцНалоговогоПериода, РанееИсчисленныйОПВР.МесяцНалоговогоПериода) КАК МесяцНалоговогоПериода,
		|	0 КАК Налог,
		|	0 КАК Отчисление,
		|	(ЕСТЬNULL(ТаблицаОПВР.Взнос, 0) - ЕСТЬNULL(РанееИсчисленныйОПВР.Взнос, 0)) КАК Взнос,
		|	(ЕСТЬNULL(ТаблицаОПВР.ОблагаемаяБаза, 0) - ЕСТЬNULL(РанееИсчисленныйОПВР.ОблагаемаяБаза, 0)) КАК ОблагаемаяБаза
		|ИЗ
		|	ВТ_ДанныеРаспределенияОПВР КАК ТаблицаОПВР
		|
		|	ПОЛНОЕ СОЕДИНЕНИЕ ВТ_РанееИсчисленныйОПВР КАК РанееИсчисленныйОПВР
		|		ПО ТаблицаОПВР.НомерСтроки =  РанееИсчисленныйОПВР.НомерСтроки
		|			И ТаблицаОПВР.СтруктурнаяЕдиница =  РанееИсчисленныйОПВР.СтруктурнаяЕдиница" + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|			И ТаблицаОПВР.ПодразделениеОрганизации =  РанееИсчисленныйОПВР.ПодразделениеОрганизации", "") + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРаспределения.НомерСтроки,
		|	ДанныеРаспределения.ФизЛицо,
		|	ДанныеРаспределения.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ДанныеРаспределения.ПодразделениеОрганизации,", "") + "
		|	ДанныеРаспределения.МесяцНалоговогоПериода,
		|	СУММА(ДанныеРаспределения.Налог) КАК Налог,
		|	СУММА(ДанныеРаспределения.Отчисление) КАК Отчисление,
		|	СУММА(ДанныеРаспределения.Взнос) КАК Взнос,
		|	СУММА(ДанныеРаспределения.ОблагаемаяБаза) КАК ОблагаемаяБаза,
		|	ДанныеРаспределения.ВидСтрокиЗапроса
		|ИЗ
		|	ВТ_ДанныеРаспределения КАК ДанныеРаспределения
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРаспределения.ФизЛицо,
		|	ДанныеРаспределения.СтруктурнаяЕдиница," + ?(РаспределятьНалогиПоПодразделениямОрганизаций, "
		|	ДанныеРаспределения.ПодразделениеОрганизации,", "") + "
		|	ДанныеРаспределения.МесяцНалоговогоПериода,
		|	ДанныеРаспределения.ВидСтрокиЗапроса,
		|	ДанныеРаспределения.НомерСтроки";
	
	 Возврат Запрос.Выполнить();
	 
КонецФункции

// Проверяет правильность заполнения шапки документа.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок = "")

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ГоловнаяОрганизация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ПериодРегистрации) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указан период регистрации!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке из ТЧ документа.
//
Процедура ПроверитьЗаполнениеСтрокиТЧ(ВыборкаПоСтрокамДокумента, Отказ)

	Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныйСН" Тогда
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
										""" табл. части ""СН"": ";
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныеСО" Тогда
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
										""" табл. части ""СО"": ";
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныйОППВ" Тогда
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
										""" табл. части ""ОППВ"": ";
	ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныеОтчисленияОСМС" Тогда
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
										""" табл. части ""Отчисления ОСМС"": ";

	КонецЕсли;
	
	// ФизЛицо
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбрано физическое лицо!", Отказ);
	КонецЕсли;

	// месяц налогового периода
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не задан месяц налогового периода!", Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиТЧ()

// По строке выборок из результатов запроса по документу формируем движения по регистрам.
//
Процедура ДобавитьСтрокуИсчисленныйСН(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц)
	
	Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница,
																						ВыборкаПоШапкеДокумента.Организация,
																						ИсчислениеНалоговСтруктурныхЕдиниц,
																						Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	
	Если ВыборкаПоСтрокамДокумента.Налог <> 0 Тогда
																							
		Движение = Движения.СНИсчисленный.Добавить();

		// Свойства
		Движение.Период						= КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);

		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.МесяцНалоговогоПериода = НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Иначе
			Движение.МесяцНалоговогоПериода = ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
			
		// Ресурсы
		Движение.Налог						= ВыборкаПоСтрокамДокумента.Налог;
		
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.ОблагаемаяБаза <> 0 Тогда
		
		Движение = Движения.СНСведенияОДоходах.Добавить();
		
		// Свойства
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.Период			 		= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Иначе
			Движение.Период			 		= ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
 		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;

		Движение.ПериодРегистрации 			= НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.СпособНалогообложения      = Справочники.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.ОблагаемаяБаза				= ВыборкаПоСтрокамДокумента.ОблагаемаяБаза;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуИсчисленныйСН()

// По строке выборок из результатов запроса по документу формируем движения по регистрам.
//
Процедура ДобавитьСтрокуИсчисленныеСО(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц)
	
	Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница,
																						ВыборкаПоШапкеДокумента.Организация,
																						ИсчислениеНалоговСтруктурныхЕдиниц,
																						Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	
	Если ВыборкаПоСтрокамДокумента.Отчисление <> 0 Тогда																					
		
		Движение = Движения.СОРасчетыСФондами.Добавить();

		// Свойства
		Движение.Период						= КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;

		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.МесяцНалоговогоПериода = НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Иначе
			Движение.МесяцНалоговогоПериода = ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		Движение.ВидПлатежа					= Перечисления.ВидыПлатежейВБюджетИФонды.Налог;
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.Отчисление					= ВыборкаПоСтрокамДокумента.Отчисление;
		
		// Реквизиты 
		Движение.ВидСтроки					= Перечисления.РасчетыСБюджетомФондамиВидСтроки.Исчисление;
		
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.ОблагаемаяБаза <> 0 Тогда
		
		Движение = Движения.СОСведенияОДоходах.Добавить();
		
		// Свойства
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.Период			 		= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Иначе
			Движение.Период			 		= ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;

		Движение.ПериодРегистрации 			= НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.СпособНалогообложения      = Справочники.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.ОблагаемаяБаза				= ВыборкаПоСтрокамДокумента.ОблагаемаяБаза;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуИсчисленныеСО()

// По строке выборок из результатов запроса по документу формируем движения по регистрам.
//
Процедура ДобавитьСтрокуИсчисленныйОППВ(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц)
	
	Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница,
																						ВыборкаПоШапкеДокумента.Организация,
																						ИсчислениеНалоговСтруктурныхЕдиниц,
																						Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	
	Если ВыборкаПоСтрокамДокумента.Взнос <> 0 Тогда
		
		Движение = Движения.ОППВРасчетыСФондами.Добавить();

		// Свойства
		Движение.Период						= КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;

		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.МесяцНалоговогоПериода = НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Иначе
			Движение.МесяцНалоговогоПериода = ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		Движение.ВидПлатежа					= Перечисления.ВидыПлатежейВБюджетИФонды.Налог;
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.Взнос						= ВыборкаПоСтрокамДокумента.Взнос;
		
		// Реквизиты 
		Движение.ВидСтроки					= Перечисления.РасчетыСБюджетомФондамиВидСтроки.Исчисление;
		
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.ОблагаемаяБаза <> 0 Тогда
		
		Движение = Движения.ОППВСведенияОДоходах.Добавить();
		
		// Свойства
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.Период			 		= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Иначе
			Движение.Период			 		= ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;

		Движение.ПериодРегистрации 			= НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.СпособНалогообложения      = Справочники.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.ОблагаемаяБаза				= ВыборкаПоСтрокамДокумента.ОблагаемаяБаза;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуИсчисленныеОППВ()

// По строке выборок из результатов запроса по документу формируем движения по регистрам.
//
Процедура ДобавитьСтрокуИсчисленныеОтчисленияОСМС(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц)
	
	Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница,
																						ВыборкаПоШапкеДокумента.Организация,
																						ИсчислениеНалоговСтруктурныхЕдиниц,
																						Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	
	Если ВыборкаПоСтрокамДокумента.Отчисление <> 0 Тогда																					
		
		Движение = Движения.ООСМСРасчетыСФондами.Добавить();

		// Свойства
		Движение.Период						= КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;

		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.МесяцНалоговогоПериода = НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Иначе
			Движение.МесяцНалоговогоПериода = ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		Движение.ВидПлатежа					= Перечисления.ВидыПлатежейВБюджетИФонды.Налог;
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.Отчисление					= ВыборкаПоСтрокамДокумента.Отчисление;
		
		// Реквизиты 
		Движение.ВидСтроки					= Перечисления.РасчетыСБюджетомФондамиВидСтроки.Исчисление;
		
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.ОблагаемаяБаза <> 0 Тогда
		
		Движение = Движения.ООСМССведенияОДоходах.Добавить();
		
		// Свойства
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.Период			 		= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Иначе
			Движение.Период			 		= ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;

		Движение.ПериодРегистрации 			= НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.СпособНалогообложения      = Справочники.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.ОблагаемаяБаза				= ВыборкаПоСтрокамДокумента.ОблагаемаяБаза;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуИсчисленныеОтчисленияОСМС()

// По строке выборок из результатов запроса по документу формируем движения по регистрам.
//
Процедура ДобавитьСтрокуИсчисленныйОПВР(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц)
	
	Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница,
																						ВыборкаПоШапкеДокумента.Организация,
																						ИсчислениеНалоговСтруктурныхЕдиниц,
																						Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	
	Если ВыборкаПоСтрокамДокумента.Взнос <> 0 Тогда
		
		Движение = Движения.ОПВРРасчетыСФондами.Добавить();

		// Свойства
		Движение.Период						= КонецМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.ВидДвижения				= ВидДвиженияНакопления.Приход;

		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.МесяцНалоговогоПериода = НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Иначе
			Движение.МесяцНалоговогоПериода = ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		Движение.ВидПлатежа					= Перечисления.ВидыПлатежейВБюджетИФонды.Налог;
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.Взнос						= ВыборкаПоСтрокамДокумента.Взнос;
		
		// Реквизиты 
		Движение.ВидСтроки					= Перечисления.РасчетыСБюджетомФондамиВидСтроки.Исчисление;
		
	КонецЕсли;
	
	Если ВыборкаПоСтрокамДокумента.ОблагаемаяБаза <> 0 Тогда
		
		Движение = Движения.ОПВРСведенияОДоходах.Добавить();
		
		// Свойства
		Если ВыборкаПоШапкеДокумента.ОтражениеПоПериодуРегистрации Тогда
			Движение.Период			 		= ВыборкаПоШапкеДокумента.ПериодРегистрации;
		Иначе
			Движение.Период			 		= ВыборкаПоСтрокамДокумента.МесяцНалоговогоПериода;
		КонецЕсли;
		
		// Измерения
		Движение.ФизЛицо                    = ВыборкаПоСтрокамДокумента.ФизЛицо;
		Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
			Движение.Налогоплательщик		= Налогоплательщик;
		Иначе
			Движение.Налогоплательщик		= ВыборкаПоШапкеДокумента.Организация;
		КонецЕсли;
		Движение.СтруктурнаяЕдиница			= ВыборкаПоСтрокамДокумента.СтруктурнаяЕдиница;

		Движение.ПериодРегистрации 			= НачалоМесяца(ВыборкаПоШапкеДокумента.ПериодРегистрации);
		Движение.Организация				= ВыборкаПоШапкеДокумента.Организация;
		Движение.СпособНалогообложения      = Справочники.СпособыНалогообложенияДоходов.ОблагаетсяЦеликом;
		Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоПодразделениямОрганизаций Тогда
			Движение.ПодразделениеОрганизации = ВыборкаПоСтрокамДокумента.ПодразделениеОрганизации;
		КонецЕсли;
		
		// Ресурсы
		Движение.ОблагаемаяБаза				= ВыборкаПоСтрокамДокумента.ОблагаемаяБаза;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуИсчисленныеОПВР()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
 
// Процедура - обработчик "ПередЗаписью" документа.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	МассивТЧ = Новый Массив();
	МассивТЧ.Добавить(ИсчисленныеСО);
	МассивТЧ.Добавить(ИсчисленныйСН);
 	МассивТЧ.Добавить(ИсчисленныйОППВ);
	МассивТЧ.Добавить(ИсчисленныеОтчисленияОСМС);

	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(МассивТЧ, "ФизЛицо");
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);	

	// Проверка ручной корректировки
	Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;

	ИсчислениеНалоговСтруктурныхЕдиниц = глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц");

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			мОрганизацияЯвляетсяВкладчикомОППВ = ВыборкаПоШапкеДокумента.ОрганизацияЯвляетсяВкладчикомОППВ;
			
			Если ВыборкаПоШапкеДокумента.РаспределятьНалогиПоСтруктурнымЕдиницам Тогда
				ВыборкаПоСтрокамДокумента = РаспределитьРезультатыПоСтруктурнымЕдиницам(ВыборкаПоШапкеДокумента).Выбрать();
			Иначе 
				// получим реквизиты табличной части
				ВыборкаПоСтрокамДокумента = СформироватьЗапросПоТабличнымЧастям(ВыборкаПоШапкеДокумента).Выбрать();
			КонецЕсли;
			
			Пока ВыборкаПоСтрокамДокумента.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиТЧ(ВыборкаПоСтрокамДокумента, Отказ);
				Если НЕ Отказ Тогда
					// Заполним записи в наборах записей регистров
					Если ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныйСН" Тогда
						ДобавитьСтрокуИсчисленныйСН(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц);
					ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныеСО" Тогда
						ДобавитьСтрокуИсчисленныеСО(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц);
					ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныйОППВ" Тогда
						ДобавитьСтрокуИсчисленныйОППВ(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц);
					ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныеОтчисленияОСМС" Тогда
						ДобавитьСтрокуИсчисленныеОтчисленияОСМС(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц);
					ИначеЕсли ВыборкаПоСтрокамДокумента.ВидСтрокиЗапроса = "ИсчисленныйОПВР" Тогда
						ДобавитьСтрокуИсчисленныйОПВР(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, ИсчислениеНалоговСтруктурныхЕдиниц);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

		КонецЕсли; 

	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

//////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

мПоддержкаРаботыСоСтруктурнымиПодразделениями = Константы.ПоддержкаРаботыСоСтруктурнымиПодразделениями.Получить();
мОрганизацияЯвляетсяПлательщикомСН = ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаСоциальногоНалога(Организация, Дата);
