
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Если Параметры.Свойство("РежимСохраненияНастройки") Тогда
		РежимСохраненияНастройки  = Параметры.РежимСохраненияНастройки;
	КонецЕсли;
    Если Параметры.Свойство("НастраиваемыйОбъект") Тогда
		НастраиваемыйОбъект  = Параметры.НастраиваемыйОбъект;
	КонецЕсли;
	// Установка заголовка формы и удаление ненужных кнопок панели
	ИмяОбъекта = Сред(НастраиваемыйОбъект, Найти(НастраиваемыйОбъект, ".") + 1);
	Если Параметры.Свойство("Заголовок") Тогда
		СинонимОбъекта = Параметры.Заголовок;
	ИначеЕсли Метаданные.Отчеты.Найти(ИмяОбъекта) <> Неопределено Тогда
		СинонимОбъекта = Метаданные.Отчеты.Найти(ИмяОбъекта).Синоним;
	Иначе
		СинонимОбъекта = "";
	КонецЕсли;
	Если РежимСохраненияНастройки Тогда
		ЭтаФорма.Заголовок = "Сохранение варианта настройки "; //"" + СинонимОбъекта + """";
        Элементы.Выбрать.Видимость=Ложь;
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование1;
	Иначе
		ЭтаФорма.Заголовок = "Список вариантов настройки "; //"" + СинонимОбъекта + """";
        Элементы.ФормаСохранить.Видимость=Ложь;
        Элементы.Наименование1.Видимость=Ложь;
        Элементы.ГруппаДополнительно.Видимость=Ложь;
		ЭтаФорма.ТекущийЭлемент = Элементы.СписокДанных;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СохраненныеНастройки.Наименование,
		|	СохраненныеНастройки.Представление,
		|	СохраненныеНастройки.Ссылка,
		|	СохраненныеНастройки.ТипНастройки,
		|	СохраненныеНастройки.СохранятьАвтоматически,
		|	СохраненныеНастройки.ИспользоватьПриОткрытии
		|ИЗ
		|	Справочник.общ_СохраненныеНастройки КАК СохраненныеНастройки
		|ГДЕ
		|	(НЕ СохраненныеНастройки.ПометкаУдаления)
		|	И СохраненныеНастройки.НастраиваемыйОбъект = &НастраиваемыйОбъект
		|	И СохраненныеНастройки.ТипНастройки = &ТипНастройки
		|	И СохраненныеНастройки.Ссылка В(&Ссылка)";
	Если Параметры.Свойство("ДополнительныйОбъект") Тогда
		Запрос.Текст = Запрос.Текст+"
		|	И СохраненныеНастройки.ДополнительныйОбъект = &ДополнительныйОбъект";
		Запрос.УстановитьПараметр("ДополнительныйОбъект", Параметры.ДополнительныйОбъект);
		ПоДопОбъекту = Истина;
		ДополнительныйОбъект = Параметры.ДополнительныйОбъект;
	КонецЕсли;

	Запрос.УстановитьПараметр("НастраиваемыйОбъект", НастраиваемыйОбъект);
	Запрос.УстановитьПараметр("Ссылка", общ_СтандартныеОтчетыСервер.ПолучитьСписокДоступныхВариантов(НастраиваемыйОбъект));
	Запрос.УстановитьПараметр("ТипНастройки", ?(Найти(НастраиваемыйОбъект, "ОтчетОбъект") > 0,Перечисления.ТипыНастроек.НастройкиОтчета,Перечисления.ТипыНастроек.ПроизвольныеНастройки));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НС = СписокДанных.Добавить();
		НС.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		НС.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		НС.ИспользоватьПриОткрытии = ВыборкаДетальныеЗаписи.ИспользоватьПриОткрытии;
//		НС.Представление = ВыборкаДетальныеЗаписи.Представление;
		НС.ТипНастройки = ВыборкаДетальныеЗаписи.ТипНастройки;
		НС.СохранятьАвтоматически = ВыборкаДетальныеЗаписи.СохранятьАвтоматически;
//		ЗаполнитьЗначенияСвойств(НС,ВыборкаДетальныеЗаписи);
		СтрокаПользователи = "";
		Для Каждого СтрокаП Из ВыборкаДетальныеЗаписи.Ссылка.Пользователи Цикл
			СтрокаПользователи=СтрокаПользователи+?(СтрокаПользователи="","","; ")+Строка(СтрокаП.Пользователь);
		КонецЦикла;
		НС.Пользователи = СтрокаПользователи;
	КонецЦикла;

    Если Параметры.Свойство("Наименование") Тогда
		Наименование  = Параметры.Наименование;
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура СправочникСписокСохраненныеНастройкиВыборЗначения(Элемент,ВыбраннаяСтрока,СтандартнаяОбработка)
	
	Если Элементы.СписокДанных.ТекущиеДанные.Ссылка = ПредопределенноеЗначение("Справочник.общ_СохраненныеНастройки.ПустаяСсылка") ИЛИ ЭтоГруппа(Элементы.СписокДанных.ТекущиеДанные.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если РежимСохраненияНастройки Тогда
		СохранитьНастройку();
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") ИЛИ ТипЗнч(ВладелецФормы) = Тип("Форма") Тогда
		Попытка
			ВладелецФормы.СохраненнаяНастройка = Элементы.СписокДанных.ТекущиеДанные.Ссылка;
		Исключение
			ВладелецФормы.Объект.СохраненнаяНастройка = Элементы.СписокДанных.ТекущиеДанные.Ссылка;
		КонецПопытки;
//		ВладелецФормы.ПрименитьНастройку();
		Модифицированность = Ложь;
		Закрыть(Элементы.СписокДанных.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппа(Ссылка)
	Возврат Ссылка.ЭтоГруппа;	
КонецФункции

&НаКлиенте
Процедура СправочникСписокСохраненныеНастройкиПриАктивизацииСтроки(Элемент)
	
	// Обновим поле наименование
	ТекущаяСтрока = Элементы.СписокДанных.ТекущиеДанные;
	Если ТекущаяСтрока=Неопределено ИЛИ ТекущаяСтрока.Ссылка = ПредопределенноеЗначение("Справочник.общ_СохраненныеНастройки.ПустаяСсылка") И ПустаяСтрока(Наименование) Тогда
		Наименование = ?(Параметры.Заголовок="","Новый вариант отчета",Параметры.Заголовок);
	ИначеЕсли ТекущаяСтрока <> Неопределено Тогда
		Наименование = ТекущаяСтрока.Наименование;
		ИспользоватьПриОткрытии = ТекущаяСтрока.ИспользоватьПриОткрытии;
		СохранятьАвтоматически = ТекущаяСтрока.СохранятьАвтоматически;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьИспользоватьПриОткрытии()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СохраненныеНастройки.Ссылка
		|ИЗ
		|	Справочник.общ_СохраненныеНастройки.Пользователи КАК СохраненныеНастройки
		|ГДЕ
		|	СохраненныеНастройки.Пользователь = &Владелец
		|	И СохраненныеНастройки.Ссылка.ТипНастройки = ЗНАЧЕНИЕ(Перечисление.ТипыНастроек."+?(Найти(НастраиваемыйОбъект, "ОтчетОбъект") > 0,"НастройкиОтчета","ПроизвольныеНастройки")+")
		|	И СохраненныеНастройки.Ссылка.НастраиваемыйОбъект = &НастраиваемыйОбъект
		|	И СохраненныеНастройки.Ссылка.ИспользоватьПриОткрытии = ИСТИНА
		|	И СохраненныеНастройки.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Если ПоДопОбъекту Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И СохраненныеНастройки.Ссылка.ДополнительныйОбъект = &ДополнительныйОбъект";
		Запрос.УстановитьПараметр("ДополнительныйОбъект",ДополнительныйОбъект);
	КонецЕсли;

	Запрос.УстановитьПараметр("Владелец", фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ТекущийПользователь"));
	Запрос.УстановитьПараметр("НастраиваемыйОбъект", НастраиваемыйОбъект);

	Результат = Запрос.Выполнить();

	Возврат Не Результат.Пустой();	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьСвойствоОбъекта(Ссылка,Имя,Значение)
	НовыйЭлемент = 	Ссылка.ПолучитьОбъект();
	НовыйЭлемент[Имя] = Значение;
	НовыйЭлемент.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройку()
	
	ЕстьИспользоватьПриОткрытии = ЕстьИспользоватьПриОткрытии();	
	
	Если Элементы.СписокДанных.ТекущаяСтрока<>Неопределено Тогда
		ТекущаяСтрока = СписокДанных.НайтиПоИдентификатору(Элементы.СписокДанных.ТекущаяСтрока);
	КонецЕсли;
	Если ТекущаяСтрока <> Неопределено И Наименование = ТекущаяСтрока.Наименование Тогда
		//Если ВладелецФормы.СохраненнаяНастройка = ТекущаяСтрока Тогда
		//	// Выбрали текущую настройку. ничего не делаем
		//Иначе
		Ответ = Вопрос("Заменить существующий вариант отчета """ + Наименование + """?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			// Сохранение существующей настройки
			Если (Не ТекущаяСтрока.ИспользоватьПриОткрытии) И ИспользоватьПриОткрытии И ЕстьИспользоватьПриОткрытии Тогда 
				Ответ = Вопрос("Для данного отчета уже существует настройка с признаком ""Использовать при открытии"".
				|Продолжить запись?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;				
			
			Если ИспользоватьПриОткрытии <> ТекущаяСтрока.ИспользоватьПриОткрытии Тогда
				УстановитьСвойствоОбъекта(ТекущаяСтрока.Ссылка,"ИспользоватьПриОткрытии",ИспользоватьПриОткрытии);
			КонецЕсли;
			Если СохранятьАвтоматически <> ТекущаяСтрока.СохранятьАвтоматически Тогда
				УстановитьСвойствоОбъекта(ТекущаяСтрока.Ссылка,"СохранятьАвтоматически",СохранятьАвтоматически);
			КонецЕсли;
			Попытка
				ВладелецФормы.СохраненнаяНастройка = ТекущаяСтрока.Ссылка;
			Исключение
				ВладелецФормы.Объект.СохраненнаяНастройка = ТекущаяСтрока.Ссылка;
			КонецПопытки;
			Иначе
				Возврат;
			КонецЕсли;
		//КонецЕсли;
	Иначе
		// Создание новой настройки
		Если ИспользоватьПриОткрытии И ЕстьИспользоватьПриОткрытии Тогда 
			Ответ = Вопрос("Для данного отчета уже существует настройка с признаком ""Использовать при открытии"".
			|Продолжить запись?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Отказ = Ложь;
		НовыйЭлемент = СоздатьНастройку(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		// Сохранение
		Попытка
			ВладелецФормы.СохраненнаяНастройка = НовыйЭлемент;
		Исключение
			ВладелецФормы.Объект.СохраненнаяНастройка = НовыйЭлемент;
		КонецПопытки;
	КонецЕсли;
	ВладелецФормы.СохранитьНастройку();
	ВладелецФормы.Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры


&НаСервере
Функция СоздатьНастройку(Отказ)
		НовыйЭлемент = Справочники.общ_СохраненныеНастройки.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.ИспользоватьПриОткрытии = ИспользоватьПриОткрытии;
		НовыйЭлемент.СохранятьАвтоматически = СохранятьАвтоматически;
		НовыйЭлемент.НастраиваемыйОбъект = НастраиваемыйОбъект;
		Если ПоДопОбъекту Тогда
			НовыйЭлемент.ДополнительныйОбъект = ДополнительныйОбъект;
		КонецЕсли;
		НовыйЭлемент.ТипНастройки = ?(Найти(НастраиваемыйОбъект, "ОтчетОбъект") > 0,Перечисления.ТипыНастроек.НастройкиОтчета,Перечисления.ТипыНастроек.ПроизвольныеНастройки);
		НовыйПользователь = НовыйЭлемент.Пользователи.Добавить();
		НовыйПользователь.Пользователь = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ТекущийПользователь");
		НовыйПользователь.ПравоИзменения = Истина;
		Отказ = Ложь;
		Сообщение = "";
//		НовыйЭлемент.ПроверитьОбязательныеРеквизиты(НовыйЭлемент, Отказ, Сообщение);
		Если Отказ Тогда
			Сообщить("Элемент не может быть записан! " + Сообщение, СтатусСообщения.Важное);
			Возврат Неопределено;
		КонецЕсли;
		НовыйЭлемент.Записать();
		Возврат НовыйЭлемент.Ссылка;
КонецФункции

&НаКлиенте
Процедура ДействияФормыСохранить(Кнопка)
	
	СохранитьНастройку();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если Элементы.СписокДанных.ТекущиеДанные<>Неопределено Тогда
		СправочникСписокСохраненныеНастройкиВыборЗначения(Неопределено,Неопределено,Неопределено);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДанныхВыбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Истина;
КонецПроцедуры


