Перем ДанныеРасшифровки Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;

Процедура Скомпоновать(ДокументРезультат,ДеревоСЕ,СписокСЕ,СписокПодразделений) Экспорт
	мСписокПодразделений = СписокПодразделений;
	мСписокСтруктурныхЕдиниц = СписокСЕ;
	мДеревоСтруктурныхЕдиниц = ДеревоСЕ;
	СкомпоноватьРезультат(ДокументРезультат,ДанныеРасшифровки);	
	общ_СтандартныеОтчетыСервер.НастроитьФиксацию(ДокументРезультат,КомпоновщикНастроек.Настройки);
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Реквизит.Имя,?(Реквизит.Имя="ДатаАктуальности" И ДатаАктуальности<>'00010101',КонецДня(ДатаАктуальности),?(Реквизит.Имя="КонецПериода" И КонецПериода<>'00010101',КонецДня(КонецПериода),ЭтотОбъект[Реквизит.Имя])));
	КонецЦикла;
	Отчеты.дог_ГрафикПоступленияТоваровИУслугОтПоставщиков.ДоработатьКомпоновщикПередВыводом(КомпоновщикНастроек,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ДоговорКонтрагента,мСписокСтруктурныхЕдиниц,мСписокПодразделений,мДеревоСтруктурныхЕдиниц);
КонецПроцедуры
