
&НаСервере
Процедура БИНКонтрагентаПриИзмененииНаСервере()
Объект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИдентификационныйКодЛичности", Объект.БИНКонтрагента);
Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
	 Сообщить("Контрагент не найден");
	 Отказ = Истина;
	 Возврат;
	 КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БИНКонтрагентаПриИзменении(Элемент)
	БИНКонтрагентаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидПриИзмененииНаСервере()
	Если Объект.Вид = Перечисления.дог_ВидыОперацийДоговор.Договор Тогда
		ЭтаФорма.Элементы.ОсновнойДоговор.Видимость = Ложь;
		Иначе 
		ЭтаФорма.Элементы.ОсновнойДоговор.Видимость = Истина;
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	ВидПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.ОсновнойДоговор.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговор(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.БИНКонтрагента) Тогда
		Сообщить("Не заполнен БИН контрагента");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.НомерДоговора) Тогда
		Сообщить("Не заполнен номер договора");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Сообщить("Не заполнена дата заключения договора");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДоговора) Тогда 
			Сообщить("Не заполнен вид договора");
			Возврат;
			КонецЕсли;
	
	СоздатьДоговорНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДоговорНаСервере()
	
	Попытка
			НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		Исключение
			Сообщить("Договор не создан");
		КонецПопытки;
		
		НовыйДоговор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("398");
		НовыйДоговор.ВидДоговора   		  = Объект.ВидДоговора;
		НовыйДоговор.Наименование 		  = "Договор № " + Объект.НомерДоговора + ", от " + Формат(Объект.ДатаЗаключенияДоговора, "ДЛФ=Д");
		НовыйДоговор.Владелец 			  = Объект.Контрагент;
		НовыйДоговор.ДатаДоговора 		  = Объект.ДатаЗаключенияДоговора;
		НовыйДоговор.ДатаНачалаДействияДоговора    = Объект.ДатаНачала;
		НовыйДоговор.ДатаОкончанияДействияДоговора = Объект.ДатаОкончания;
		НовыйДоговор.НомерДоговора 			  = Объект.НомерДоговора;
		НовыйДоговор.Организация 			  = Справочники.Организации.НайтиПоКоду("000000001");
		НовыйДоговор.ВедениеВзаиморасчетов 	  = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	
	Попытка
		НовыйДоговор.Записать();
		Сообщить("Договор успешно записан");
	Исключение
		Сообщить("Договор не записан")
	
	КонецПопытки;
КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	 ДанныеКонтрагента = Справочники.Контрагенты.НайтиПоРеквизиту("ИдентификационныйКодЛичности", Объект.БИНКонтрагента);
// Если Не ЗначениеЗаполнено(ДанныеКонтрагента) Тогда
//	 Сообщить("Контрагент не найден");
//	 Отказ = Истина;
//	 КонецЕсли;
//КонецПроцедуры
