//Перем _менеджерОбъектов;

//////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПередКонтролемЛицензии(Отказ) Экспорт
	// Если необходимо контролировать только наличие ключа без
	// учета количества лицензий, то не проверяем лицензию
	// Отказ = Истина;
	Отказ = Истина; // для лицензирования на приложение должно быть Истина
КонецПроцедуры

Процедура ПриСозданииОбъекта(МенеджерОбъектов, Отказ, ОписаниеОшибки) Экспорт
	// Сохраняем менеджер объектов
//	_менеджерОбъектов = МенеджерОбъектов;
	
КонецПроцедуры
