#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ЗначениеРеквизитаОтчетаИзТекущейНастройки(ИмяРеквизита,Объект) Экспорт
	МетаданныеНастроек = фин_ОбщегоНазначенияВызовСервераПовтИсп.РеквизитыСправочникаНастроекОтчетов();
	Если МетаданныеНастроек.Найти(НРег(ИмяРеквизита))<>Неопределено Тогда
		Возврат Объект[ИмяРеквизита];
	Иначе
		СтрокиНастроек = Объект.ДополнительныеПараметрыОтчета.НайтиСтроки(Новый Структура("Параметр",ИмяРеквизита));
		Если СтрокиНастроек.Количество()>0 Тогда
			Возврат СтрокиНастроек[0].Значение;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецЕсли