// Функция определяет перечень операций закрытия месяца, которые должны выполняться
// в целом по организации.
// Операци, не входящие в этот перечень выполняются отдельно по каждому СП
Функция ПолучитьСписокОперацийЗакрытияМесяцаПоОрганизации() Экспорт
	
	СписокОперацийПоОрганизации = Новый СписокЗначений;
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетДоходаОтПревышенияСтоимостиВыбывшихФА);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.СписаниеСтоимостногоБалансаГруппыМенееМинимума);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.СписаниеПриВыбытииВсехФАГруппы);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.АмортизацияФАНУ);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоРасходамНаРемонт);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоПреференциям);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоНалогам);	
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.ЗакрытиеСчетовНУ);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетСтоимостиПродукцииБУ);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетСтоимостиПродукцииНУ);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.ПереносНЗПБУ);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.ПереносНЗПНУ);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетНДСКЗачету);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетНалогаНаПрибыль);
	СписокОперацийПоОрганизации.Добавить(Перечисления.ВидыРегламентныхОпераций.РасчетВременныхРазниц);
	
	Возврат СписокОперацийПоОрганизации;
КонецФункции

// Классифицирует регламентную операцию на выполняемую по СП, либо выполняемую по организации в целом и определяет ее периодичность
// для последующей проверки
Процедура ЗаполнитьСпискиРегламентныхОперацийПоПериодамПроверки(ПериодПроверки, Организация, РегламентнаяОперация,СтруктураВыбранныхОперацийПоОрганизации,СтруктураВыбранныхОперацийПоСтруктурномуПодразделению, ОбщийСписокОперацийПоОрганизации = Неопределено, ВедениеУчетаВременныхРазницБалансовымМетодом = Неопределено) Экспорт
	
	Если ОбщийСписокОперацийПоОрганизации = Неопределено Тогда // // кешируемое значение списка
		ОбщийСписокОперацийПоОрганизации  = ПолучитьСписокОперацийЗакрытияМесяцаПоОрганизации();
	КонецЕсли;
	
	Если ВедениеУчетаВременныхРазницБалансовымМетодом = Неопределено Тогда 
		мКонДата = КонецМесяца(ПериодПроверки);
		Отказ 	 = Ложь;
		
		мУчетнаяПолитикаПоБухгалтерскомуУчету 		 = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(мКонДата, Отказ, Организация, "Бух");
		ВедениеУчетаВременныхРазницБалансовымМетодом =  ПроцедурыНалоговогоУчета.ПолучитьПризнакВеденияУчетаВременныхРазницБалансовымМетодом(Организация, ПериодПроверки, мУчетнаяПолитикаПоБухгалтерскомуУчету);	
	КонецЕсли;

	// Получаем текстовое представление рег. операции для заполнения списка
	ИндексВидаОперации = Перечисления.ВидыРегламентныхОпераций.Индекс(РегламентнаяОперация); 	
	ИмяРегламентнойОперации = РегламентнаяОперация.Метаданные().ЗначенияПеречисления.Получить(ИндексВидаОперации).Имя;
		
	ДатаНачалаПроверки = НачалоМесяца(ПериодПроверки); // Для операций, которые не могут повторяться в более длительных периодах, чем месяц	
	
	// Зачет по НДС
	Если РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетНДСКЗачету Тогда
		Если УчетНДСИАкциза.ПолучитьПериодОтнесенияНДСВЗачет(Организация, ПериодПроверки) = Перечисления.Периодичность.Месяц Тогда
			ДатаНачалаПериодаЗачета = НачалоМесяца(ПериодПроверки);
		Иначе
			ДатаНачалаПериодаЗачета = НачалоКвартала(ПериодПроверки);
		КонецЕсли;	
		
		ДатаНачалаПроверки = ДатаНачалаПериодаЗачета;				
		
	///////////////////////////////////////////////////////////////////////////////
	// Операции налогового учета. Периодичность - год		
	ИначеЕсли РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.АмортизацияФАНУ 
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоРасходамНаРемонт
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетДоходаОтПревышенияСтоимостиВыбывшихФА
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.СписаниеПриВыбытииВсехФАГруппы
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.СписаниеСтоимостногоБалансаГруппыМенееМинимума
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоПреференциям
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетВременныхРазниц
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетВычетаПоРеализованнымТоварам
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоНалогам
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно
		ИЛИ РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.РасчетНалогаНаПрибыль Тогда
		
		ДатаНачалаПроверки = НачалоГода(ПериодПроверки);						
		
	///////////////////////////////////////////////////////////////////////////////
	// Операции налогового учета. Весь период ведения учета.		
	ИначеЕсли РегламентнаяОперация = Перечисления.ВидыРегламентныхОпераций.ЗакрытиеСчетовНУ И ВедениеУчетаВременныхРазницБалансовымМетодом Тогда
		ДатаНачалаПроверки = Дата('00010101');						
	КонецЕсли;		
	
	Если ОбщийСписокОперацийПоОрганизации.НайтиПоЗначению(РегламентнаяОперация) <> Неопределено  Тогда
		СтруктураВыбранныхОперацийПоОрганизации.Вставить(ИмяРегламентнойОперации, ДатаНачалаПроверки);	
	Иначе
		СтруктураВыбранныхОперацийПоСтруктурномуПодразделению.Вставить(ИмяРегламентнойОперации, ДатаНачалаПроверки ); 		
	КонецЕсли;  
		
КонецПроцедуры // ЗаполнитьСпискиРегламентныхОперацийПоПериодамПроверки

// Проверяет дублирование рег. операций в заданном периоде
// Врзвращает:
// текст с описанием сведений о дублировании 
// а также перечень дублируемых операций в переменной СписокОперацийКОтмене
Функция ПроверитьПовторОперацииВОтчетномПериоде(ДатаНачалаПериода, ДатаОкончанияПериода, Организация, СтруктураВидовОперации, СтруктурноеПодразделение = Неопределено, ПроверятьСУчетомСП = Ложь, СписокОперацийКОтмене = Неопределено) Экспорт
	
	Если СтруктураВидовОперации.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Если СписокОперацийКОтмене = Неопределено Тогда
		СписокОперацийКОтмене = Новый СписокЗначений;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаПериода", 	  ДатаНачалаПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияПериода", ДатаОкончанияПериода);
	Запрос.УстановитьПараметр("Организация",  		  Организация);
	Если ПроверятьСУчетомСП Тогда
		Запрос.УстановитьПараметр("СтруктурноеПодразделение",  СтруктурноеПодразделение);
	КонецЕсли;
	
	// временная таблица для выборки документов
	Запрос.Текст = "ВЫБРАТЬ ";	
	Для Каждого ВидОперации Из СтруктураВидовОперации Цикл
		ИмяОперации 	= ВидОперации.Ключ;
		Запрос.Текст 	= Запрос.Текст + "
	               |	ЗакрытиеМесяца." + ИмяОперации + " КАК " + ИмяОперации + ","
	КонецЦикла;
	Запрос.Текст 	= Запрос.Текст + "
				|	ЗакрытиеМесяца.Ссылка,
	            |	ЗакрытиеМесяца.Представление,
				|	ЗакрытиеМесяца.Дата
	            |ПОМЕСТИТЬ ВТ_СписокЗакрытияМесяца
	            |ИЗ
	            |	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	            |ГДЕ
	            |	ЗакрытиеМесяца.Организация = &Организация " + ?(ПроверятьСУчетомСП, " И ЗакрытиеМесяца.СтруктурноеПодразделение = &СтруктурноеПодразделение ", "")+ "	            
	            |	И ЗакрытиеМесяца.Дата >= &ДатаНачалаПериода
	            |	И ЗакрытиеМесяца.Дата <= &ДатаОкончанияПериода
	            |	И ЗакрытиеМесяца.Проведен
	            |	И (НЕ ЗакрытиеМесяца.ПометкаУдаления); ";
	
	// Строим запрос с учетом группировки по виду операции, чтобы показывать пользвателю дубли в разрезе видов документа
	ПерваяОперация = Истина; // для первой записи не нужно ключевое слово ОБЪЕДИНИТЬ
	Для Каждого ВидОперации из СтруктураВидовОперации Цикл
		ИмяОперации 		 = ВидОперации.Ключ;
		ДатаПроверкиОперации = ВидОперации.Значение;
		Если НЕ ПерваяОперация Тогда
			Запрос.Текст = Запрос.Текст +	"
			            |ОБЪЕДИНИТЬ ВСЕ ";		
			
		КонецЕсли;      		
		ПерваяОперация = Ложь;			
		Запрос.Текст = Запрос.Текст +	" 
	               |ВЫБРАТЬ
	               |	""" + ИмяОперации + """ КАК ВидОперации,
	               |	1 КАК КоличествоОпераций,	               
				   |	ЗакрытиеМесяца.Ссылка КАК Ссылка,
	               |	ЗакрытиеМесяца.Представление  КАК ПредставлениеДокумента
	               |ИЗ
	               |	ВТ_СписокЗакрытияМесяца КАК ЗакрытиеМесяца
	               |ГДЕ
	               |	ЗакрытиеМесяца." + ИмяОперации;
		СтрокаДаты = "ДатаВремя(" + Формат(Год(ДатаПроверкиОперации),"ЧГ=0") + "," + Месяц(ДатаПроверкиОперации) + ","+День(ДатаПроверкиОперации) + ")";
		Запрос.Текст = Запрос.Текст + "			
			|	И ЗакрытиеМесяца.Дата >= " + СтрокаДаты; 		   
	               
	КонецЦикла;
	// добавляем Итоги по виду операции	
	Запрос.Текст = Запрос.Текст + "	               
	               |ИТОГИ
	               |	СУММА(КоличествоОпераций)
	               |ПО
	               |	ВидОперации";
				   
				   
	ВыборкаВидовОпераций = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ТекстСообщения = "";
	ЗакрытиеМесяцаМД = Документы.ЗакрытиеМесяца.ПустаяСсылка().Метаданные();
	Пока ВыборкаВидовОпераций.Следующий() Цикл

		Если ВыборкаВидовОпераций.КоличествоОпераций > 1 Тогда
			
			ТекстСообщения = ТекстСообщения + "Повторение операции: " + СокрЛП(ЗакрытиеМесяцаМД.Реквизиты[ВыборкаВидовОпераций.ВидОперации].Синоним)+ " в документах";
			СписокОперацийКОтмене.Добавить(ВыборкаВидовОпераций.ВидОперации);
			
			// показываем пользователю перечень документов
			ВыборкаДетали = ВыборкаВидовОпераций.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				ТекстСообщения = ТекстСообщения + "
					|   " + СокрЛП(ВыборкаДетали.ПредставлениеДокумента);
			КонецЦикла;			
		   ТекстСообщения = ТекстСообщения + "
			| ";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстСообщения;	
КонецФункции

Процедура СообщитьОбОшибкеРегОперации(Знач ТекстСообщения, ДокументСообщения = Неопределено, Отказ = Ложь, РегОперация, ВидРегламентнойОперации, Ошибка = Истина) Экспорт

	Отказ = Истина;
		
		Если ТипЗнч(РегОперация)=Тип("ДокументОбъект.ЗакрытиеМесяца") И ЗначениеЗаполнено(РегОперация.Ссылка) Тогда
			ОшибкиСтрока 						 = РегОперация.Ошибки.Добавить();
			ОшибкиСтрока.Описание 				 = ТекстСообщения;
			ОшибкиСтрока.ВидРегламентнойОперации = ВидРегламентнойОперации;
			ОшибкиСтрока.Комментарий 		     = НЕ Ошибка;
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
		КонецЕсли;
	
КонецПроцедуры // СообщитьОбОшибке()

// Формирует список регламентных состояний, которые требуется выполнить
// и которые выполнены успешно и с ошибками
Функция СоставГруппыРегОпераций(Группа, Организация,СтруктурноеПодразделение, Период, ВидОперации = Неопределено) Экспорт
	
	КонецКвартала = (Месяц(Период) = 3 Или Месяц(Период) = 6 Или Месяц(Период) = 9 Или Месяц(Период) = 12);
	КонецГода     = (Месяц(Период) = 12);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", 				НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаКон", 				КонецМесяца(Период));
	Запрос.УстановитьПараметр("ОперацияВыполнена", 		Перечисления.ВидыСостоянийРегламентныхОпераций.Выполнено);
	Запрос.УстановитьПараметр("ОперацияНЕВыполнена", 	Перечисления.ВидыСостоянийРегламентныхОпераций.НЕВыполнено);
	Запрос.УстановитьПараметр("НеВыполнено",       		Перечисления.ВидыСостоянийРегламентныхОпераций.НеВыполнено);
	Запрос.УстановитьПараметр("Выполнено",         		Перечисления.ВидыСостоянийРегламентныхОпераций.Выполнено);
	Запрос.УстановитьПараметр("ВидСубконтоНМА",			ПланыВидовХарактеристик.ВидыСубконтоТиповые.НематериальныеАктивы);
	Запрос.УстановитьПараметр("ВидСубконтоРБП", 		ПланыВидовХарактеристик.ВидыСубконтоТиповые.РасходыБудущихПериодов);
	
	Запрос.УстановитьПараметр("КонецГода", (Месяц(Период) = 12));
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурноеПодразделение", СтруктурноеПодразделение);
			
	
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	&СтруктурноеПодразделение КАК СтруктурноеПодразделение,
		|	ВложенныйЗапрос.ВидОперации КАК ВидОперации,
		|	ВложенныйЗапрос.ВидДокумента КАК ВидДокумента,
		|	ВложенныйЗапрос.Требуется КАК Требуется,
		|	ВложенныйЗапрос.РучнаяКорректировка КАК РучнаяКорректировка,
		|	ВложенныйЗапрос.Состояние КАК Состояние
		|ИЗ
		|	(";
		
	Если Группа = 1 Или Группа = "Все" Тогда
		
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
	                              |	АмортизацияОС.Организация КАК Организация,
	                              |	АмортизацияОС.ВидОперации КАК ВидОперации,
	                              |	""РегламентнаяОперация"" КАК ВидДокумента,
	                              |	ЕСТЬNULL(ОстаткиИОбороты.Требуется, ЛОЖЬ) КАК Требуется,
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
	                              |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.АмортизацияОСБУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация,
	                              |		ПодразделенияОрганизаций.Ссылка КАК СтруктурноеПодразделение
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |			Левое СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	                              |			ПО Организации.Ссылка = ПодразделенияОрганизаций.Владелец
	                              |	ГДЕ
	                              |		Организации.Ссылка = &Организация) КАК АмортизацияОС
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
	                              |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
	                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.АмортизацияОСБУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО АмортизацияОС.Организация = РегламентнаяОперация.Организация
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			ВЫБОР
	                              |				КОГДА (НЕ ТиповойОстаткиИОбороты.СуммаНачальныйОстаток = 0)
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ КАК Требуется,
	                              |			ТиповойОстаткиИОбороты.Организация КАК Организация
	                              |		ИЗ
	                              |			РегистрБухгалтерии.Типовой.ОстаткиИОбороты(
	                              |					&ДатаНач,
	                              |					&ДатаКон,
	                              |					,
	                              |					,
	                              |					Счет В
	                              |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                              |							СчетаУчетаОССрезПоследних.СчетУчетаБУ
	                              |						ИЗ
	                              |							РегистрСведений.СчетаУчетаОС.СрезПоследних(&ДатаКон, Организация = &Организация) КАК СчетаУчетаОССрезПоследних),
	                              |					,
	                              |					Организация = &Организация
	                              |						И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК ТиповойОстаткиИОбороты) КАК ОстаткиИОбороты
	                              |		ПО АмортизацияОС.Организация = ОстаткиИОбороты.Организация
	                              |
	                              |ОБЪЕДИНИТЬ ВСЕ
	                              |
	                              |ВЫБРАТЬ
	                              |	АмортизацияНМА.Организация,
	                              |	АмортизацияНМА.ВидОперации,
	                              |	""РегламентнаяОперация"",
	                              |	ЕСТЬNULL(ОстаткиИОбороты.Требуется, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                              |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.АмортизацияНМАБУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		Организации.Ссылка = &Организация) КАК АмортизацияНМА
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			ВЫБОР
	                              |				КОГДА РегламентнаяОперация.Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.ВыполненоСОшибками)
	                              |						И ЕСТЬNULL(ОшибкиРегламентнойОперации.КоличествоОшибок, 0) = 0
	                              |					ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийРегламентныхОпераций.Выполнено)
	                              |				ИНАЧЕ РегламентнаяОперация.Состояние
	                              |			КОНЕЦ КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |					ЗакрытиеМесяцаОшибки.Ссылка КАК Ссылка,
	                              |					КОЛИЧЕСТВО(ЗакрытиеМесяцаОшибки.НомерСтроки) КАК КоличествоОшибок
	                              |				ИЗ
	                              |					Документ.ЗакрытиеМесяца.Ошибки КАК ЗакрытиеМесяцаОшибки
	                              |				ГДЕ
	                              |					ЗакрытиеМесяцаОшибки.ВидРегламентнойОперации = ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.АмортизацияНМАБУ)
	                              |				
	                              |				СГРУППИРОВАТЬ ПО
	                              |					ЗакрытиеМесяцаОшибки.Ссылка) КАК ОшибкиРегламентнойОперации
	                              |				ПО РегламентнаяОперация.Ссылка = ОшибкиРегламентнойОперации.Ссылка
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
	                              |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
	                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.АмортизацияНМАБУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО АмортизацияНМА.Организация = РегламентнаяОперация.Организация
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			ВЫБОР
	                              |				КОГДА (НЕ ТиповойОстаткиИОбороты.СуммаНачальныйОстаток = 0)
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ КАК Требуется,
	                              |			ТиповойОстаткиИОбороты.Организация КАК Организация
	                              |		ИЗ
	                              |			РегистрБухгалтерии.Типовой.ОстаткиИОбороты(
	                              |					&ДатаНач,
	                              |					&ДатаКон,
	                              |					Период,
	                              |					,
	                              |					,
	                              |					&ВидСубконтоНМА,
	                              |					Организация = &Организация
	                              |						И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК ТиповойОстаткиИОбороты) КАК ОстаткиИОбороты
	                              |		ПО АмортизацияНМА.Организация = ОстаткиИОбороты.Организация
	                              |
	                              |ОБЪЕДИНИТЬ ВСЕ
	                              |
	                              |ВЫБРАТЬ
	                              |	СписаниеРезерваПоПереоценкеОС.Организация,
	                              |	СписаниеРезерваПоПереоценкеОС.ВидОперации,
	                              |	""РегламентнаяОперация"",
	                              |	ЕСТЬNULL(ОстаткиИОбороты.Требуется, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                              |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.СписаниеРезерваПоПереоценкеОСБУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		Организации.Ссылка = &Организация) КАК СписаниеРезерваПоПереоценкеОС
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
	                             |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
	                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.СписаниеРезерваПоПереоценкеОСБУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО СписаниеРезерваПоПереоценкеОС.Организация = РегламентнаяОперация.Организация
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			ВЫБОР
	                              |				КОГДА (НЕ ТиповойОстаткиИОбороты.СуммаНачальныйОстатокКт = 0)
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ КАК Требуется,
	                              |			ТиповойОстаткиИОбороты.Организация КАК Организация
	                              |		ИЗ
	                              |			РегистрБухгалтерии.Типовой.ОстаткиИОбороты(
	                              |					&ДатаНач,
	                              |					&ДатаКон,
	                              |					,
	                              |					,
	                              |					Счет = ЗНАЧЕНИЕ(ПланСчетов.Типовой.РезервНаПереоценкуОсновныхСредств),
	                              |					,
	                              |					Организация = &Организация
	                              |						И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК ТиповойОстаткиИОбороты) КАК ОстаткиИОбороты
	                              |		ПО СписаниеРезерваПоПереоценкеОС.Организация = ОстаткиИОбороты.Организация
	                              |
	                              |ОБЪЕДИНИТЬ ВСЕ
	                              |
	                              |ВЫБРАТЬ
	                              |	ПереоценкаВалютныхСредств.Организация,
	                              |	ПереоценкаВалютныхСредств.ВидОперации,
	                              |	""РегламентнаяОперация"",
	                              |	ЕСТЬNULL(ПереоценкаОстатки.Требуется, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                              |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.ПереоценкаВалютныхСредствБУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		Организации.Ссылка = &Организация) КАК ПереоценкаВалютныхСредств
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
	                              |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
	                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.ПереоценкаВалютныхСредствБУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО ПереоценкаВалютныхСредств.Организация = РегламентнаяОперация.Организация
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			ВЫБОР
	                              |				КОГДА (НЕ ТиповойОстатки.СуммаОстаток = 0)
	                              |						ИЛИ (НЕ ТиповойОстатки.ВалютнаяСуммаОстаток = 0)
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ КАК Требуется,
	                              |			ТиповойОстатки.Организация КАК Организация
	                              |		ИЗ
	                              |			РегистрБухгалтерии.Типовой.Остатки(
	                              |					&ДатаКон,
	                              |					Счет В
	                              |						(ВЫБРАТЬ
	                              |							Типовой.Ссылка КАК СчетПереоценки
	                              |						ИЗ
	                              |							ПланСчетов.Типовой КАК Типовой ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаСОсобымПорядкомПереоценкиБУ КАК СчетаСОсобымПорядкомПереоценкиБУ
	                              |								ПО
	                              |									СчетаСОсобымПорядкомПереоценкиБУ.Счет = Типовой.Ссылка
	                              |						ГДЕ
	                              |							Типовой.Валютный = ИСТИНА
	                              |							И (СчетаСОсобымПорядкомПереоценкиБУ.Счет ЕСТЬ NULL 
	                              |								ИЛИ СчетаСОсобымПорядкомПереоценкиБУ.СпособПризнанияКурсовойРазницы = ЗНАЧЕНИЕ(Перечисление.СпособыПризнанияКурсовойРазницы.Регламентно))),
	                              |					,
	                              |					Организация = &Организация
	                              |						И СтруктурноеПодразделение = &СтруктурноеПодразделение) КАК ТиповойОстатки) КАК ПереоценкаОстатки
	                              |		ПО ПереоценкаВалютныхСредств.Организация = ПереоценкаОстатки.Организация
	                              |
	                              |ОБЪЕДИНИТЬ ВСЕ
	                              |
	                              |ВЫБРАТЬ
	                              |	СписаниеРБП.Организация,
	                              |	СписаниеРБП.ВидОперации,
	                              |	""РегламентнаяОперация"",
	                              |	ЕСТЬNULL(РБПОстатки.Требуется, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                              |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.СписаниеРБПБУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		Организации.Ссылка = &Организация) КАК СписаниеРБП
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
	                              |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
	                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.СписаниеРБПБУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО СписаниеРБП.Организация = РегламентнаяОперация.Организация
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			ВЫБОР
	                              |				КОГДА (НЕ ТиповойОстатки.СуммаОстаток = 0)
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ КАК Требуется,
	                              |			ТиповойОстатки.Организация КАК Организация
	                              |		ИЗ
	                              |			РегистрБухгалтерии.Типовой.Остатки(
	                              |					&ДатаКон,
	                              |					Счет В (ЗНАЧЕНИЕ(ПланСчетов.Типовой.КраткосрочныеРасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ДолгосрочныеРасходыБудущихПериодов)),
	                              |					&ВидСубконтоРБП,
	                              |					Организация = &Организация
	                              |						И СтруктурноеПодразделение = &СтруктурноеПодразделение
	                              |						И (НЕ Субконто1.СпособСписания = ЗНАЧЕНИЕ(Перечисление.СпособыСписанияРБП.НеРассчитывать))) КАК ТиповойОстатки) КАК РБПОстатки
	                              |		ПО СписаниеРБП.Организация = РБПОстатки.Организация";  
	КонецЕсли;
							  
	Если Группа = 2 Или Группа = "Все"  Тогда
		Если Группа = "Все"  Тогда
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст +  "ВЫБРАТЬ
		                          |	РасчетСтоимостиПродукцииБУ.Организация КАК Организация,
	                              |	РасчетСтоимостиПродукцииБУ.ВидОперации КАК ВидОперации,
	                              |	""РегламентнаяОперация"" КАК ВидДокумента,
	                              |	ЕстьNULL(ПроизводствоОбороты.Требуется,ЛОЖЬ)КАК Требуется,
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
                                  |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		Значение(Перечисление.ВидыРегламентныхОпераций.РасчетСтоимостиПродукцииБУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		 Организации.Ссылка = &Организация) КАК РасчетСтоимостиПродукцииБУ
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация
								  
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
								  |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.РасчетСтоимостиПродукцииБУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО РасчетСтоимостиПродукцииБУ.Организация = РегламентнаяОперация.Организация
								  |ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
								  |			ВЫБОР
	                              |				КОГДА (НЕ ТиповойОбороты.СуммаОборотДт = 0)
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ КАК Требуется,
	                              |			ТиповойОбороты.Организация КАК Организация
	                              |ИЗ
	                              |		РегистрБухгалтерии.Типовой.Обороты(
	                              |				&ДатаНач, &ДатаКон,,
	                              |				Счет В Иерархии(ЗНАЧЕНИЕ(ПланСчетов.Типовой.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Типовой.ПолуфабрикатыСобственногоПроизводства_),ЗНАЧЕНИЕ(ПланСчетов.Типовой.ВспомогательныеПроизводства_),ЗНАЧЕНИЕ(ПланСчетов.Типовой.НакладныеРасходы_) ),
	                              |				,
	                              |				Организация = &Организация ) КАК ТиповойОбороты) КАК ПроизводствоОбороты
								  |		ПО РасчетСтоимостиПродукцииБУ.Организация = ПроизводствоОбороты.Организация
								  |
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
								  |ВЫБРАТЬ
		                          |	РасчетСтоимостиПродукцииНУ.Организация КАК Организация,
	                              |	РасчетСтоимостиПродукцииНУ.ВидОперации КАК ВидОперации,
	                              |	""РегламентнаяОперация"" КАК ВидДокумента,
	                              |	ЕстьNULL(ПроизводствоОбороты.Требуется,ЛОЖЬ)КАК Требуется,
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
                                  |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		Значение(Перечисление.ВидыРегламентныхОпераций.РасчетСтоимостиПродукцииНУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		 Организации.Ссылка = &Организация) КАК РасчетСтоимостиПродукцииНУ
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация
								  
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
								  |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.РасчетСтоимостиПродукцииНУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО РасчетСтоимостиПродукцииНУ.Организация = РегламентнаяОперация.Организация
								  |ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
								  |			ВЫБОР
	                              |				КОГДА (НЕ НалоговыйОбороты.СуммаОборотДт = 0)
	                              |					ТОГДА ИСТИНА
	                              |				ИНАЧЕ ЛОЖЬ
	                              |			КОНЕЦ КАК Требуется,
	                              |			НалоговыйОбороты.Организация КАК Организация
	                              |ИЗ
	                              |		РегистрБухгалтерии.Налоговый.Обороты(
	                              |				&ДатаНач, &ДатаКон,,
	                              |				Счет В Иерархии(ЗНАЧЕНИЕ(ПланСчетов.Налоговый.Производство_)),
	                              |				,
	                              |				Организация = &Организация) КАК НалоговыйОбороты) КАК ПроизводствоОбороты
								  |		ПО РасчетСтоимостиПродукцииНУ.Организация = ПроизводствоОбороты.Организация
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
                                  |ВЫБРАТЬ
	                              |	ПереносНЗПБУ.Организация КАК Организация,
	                              |	ПереносНЗПБУ.ВидОперации КАК ВидОперации,
	                              |	""РегламентнаяОперация"" КАК ВидДокумента,
	                              | ИСТИНА КАК Требуется,
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
                                  |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		Значение(Перечисление.ВидыРегламентныхОпераций.ПереносНЗПБУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		 Организации.Ссылка = &Организация) КАК ПереносНЗПБУ
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация								  
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
								  |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.ПереносНЗПБУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО ПереносНЗПБУ.Организация = РегламентнаяОперация.Организация
								  |ОБЪЕДИНИТЬ ВСЕ
								  |
                                  |ВЫБРАТЬ
	                              |	ПереносНЗПНУ.Организация КАК Организация,
	                              |	ПереносНЗПНУ.ВидОперации КАК ВидОперации,
	                              |	""РегламентнаяОперация"" КАК ВидДокумента,
	                              | ИСТИНА КАК Требуется,
	                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
                                  |ИЗ
	                              |	(ВЫБРАТЬ
	                              |		Значение(Перечисление.ВидыРегламентныхОпераций.ПереносНЗПНУ) КАК ВидОперации,
	                              |		Организации.Ссылка КАК Организация
	                              |	ИЗ
	                              |		Справочник.Организации КАК Организации
	                              |	ГДЕ
	                              |		 Организации.Ссылка = &Организация) КАК ПереносНЗПНУ
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                              |			РегламентнаяОперация.Состояние КАК Состояние,
	                              |			РегламентнаяОперация.Организация КАК Организация								  
	                              |		ИЗ
	                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                              |		ГДЕ
	                              |			РегламентнаяОперация.Организация = &Организация
								  |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                              |			И РегламентнаяОперация.ПереносНЗПНУ
	                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                              |		ПО ПереносНЗПНУ.Организация = РегламентнаяОперация.Организация"; 								  

	КонецЕсли;
	
	Если Группа = 3 Или Группа = "Все" Тогда
		
		Если Группа = "Все"  Тогда
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		Запрос.УстановитьПараметр("КонецКвартала", КонецКвартала);
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	РасчетНДСКЗачету.Организация КАК Организация,
		                              |	РасчетНДСКЗачету.ВидОперации КАК ВидОперации,
		                              |	""РегламентнаяОперация"" КАК ВидДокумента,
		                              |	&КонецКвартала КАК Требуется,
		                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
		                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
		                              |ИЗ
		                              |	(ВЫБРАТЬ
		                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетНДСКЗачету) КАК ВидОперации,
		                              |		Организации.Ссылка КАК Организация
		                              |	ИЗ
		                              |		Справочник.Организации КАК Организации
		                              |	ГДЕ
		                              |		Организации.Ссылка = &Организация) КАК РасчетНДСКЗачету
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
		                              |			РегламентнаяОперация.Состояние КАК Состояние,
		                              |			РегламентнаяОперация.Организация КАК Организация
		                              |		ИЗ
		                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
		                              |		ГДЕ
		                              |			РегламентнаяОперация.Организация = &Организация									
		                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
		                              |			И РегламентнаяОперация.РасчетНДСКЗачету
		                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
		                              |		ПО РасчетНДСКЗачету.Организация = РегламентнаяОперация.Организация
		                              |
		                              |ОБЪЕДИНИТЬ ВСЕ
		                              |
		                              |ВЫБРАТЬ
		                              |	ЗакрытиеПодотчетныхСумм.Организация,
		                              |	ЗакрытиеПодотчетныхСумм.ВидОперации,
		                              |	""РегламентнаяОперация"",
		                              |	ИСТИНА,
		                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
		                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
		                              |ИЗ
		                              |	(ВЫБРАТЬ
		                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.ЗакрытиеПодотчетныхСуммБУ) КАК ВидОперации,
		                              |		Организации.Ссылка КАК Организация
		                              |	ИЗ
		                              |		Справочник.Организации КАК Организации
		                              |	ГДЕ
		                              |		Организации.Ссылка = &Организация) КАК ЗакрытиеПодотчетныхСумм
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
		                              |			РегламентнаяОперация.Состояние КАК Состояние,
		                              |			РегламентнаяОперация.Организация КАК Организация
		                              |		ИЗ
		                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
		                              |		ГДЕ
		                              |			РегламентнаяОперация.Организация = &Организация
									  |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение									  
		                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
		                              |			И РегламентнаяОперация.ЗакрытиеПодотчетныхСуммБУ
		                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
		                              |		ПО ЗакрытиеПодотчетныхСумм.Организация = РегламентнаяОперация.Организация
		                              |
		                              |ОБЪЕДИНИТЬ ВСЕ
		                              |
		                              |ВЫБРАТЬ
		                              |	ЗачетАвансовыхПлатежейПоНалогамИСборамБУ.Организация,
		                              |	ЗачетАвансовыхПлатежейПоНалогамИСборамБУ.ВидОперации,
		                              |	""РегламентнаяОперация"",
		                              |	ИСТИНА,
		                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
		                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
		                              |ИЗ
		                              |	(ВЫБРАТЬ
		                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.ЗачетАвансовыхПлатежейПоНалогамИСборамБУ) КАК ВидОперации,
		                              |		Организации.Ссылка КАК Организация
		                              |	ИЗ
		                              |		Справочник.Организации КАК Организации
		                              |	ГДЕ
		                              |		Организации.Ссылка = &Организация) КАК ЗачетАвансовыхПлатежейПоНалогамИСборамБУ
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
		                              |			РегламентнаяОперация.Состояние КАК Состояние,
		                              |			РегламентнаяОперация.Организация КАК Организация
		                              |		ИЗ
		                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
		                              |		ГДЕ
		                              |			РегламентнаяОперация.Организация = &Организация
									  |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
		                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
		                              |			И РегламентнаяОперация.ЗачетАвансовыхПлатежейПоНалогамИСборамБУ
		                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
		                              |		ПО ЗачетАвансовыхПлатежейПоНалогамИСборамБУ.Организация = РегламентнаяОперация.Организация
									  |
		                              |ОБЪЕДИНИТЬ ВСЕ
		                              |
		                              |ВЫБРАТЬ
		                              |	ЗачетАвансовыхПлатежейПоНалогамИСборамНУ.Организация,
		                              |	ЗачетАвансовыхПлатежейПоНалогамИСборамНУ.ВидОперации,
		                              |	""РегламентнаяОперация"",
		                              |	ИСТИНА,
		                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
		                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
		                              |ИЗ
		                              |	(ВЫБРАТЬ
		                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.ЗачетАвансовыхПлатежейПоНалогамИСборамНУ) КАК ВидОперации,
		                              |		Организации.Ссылка КАК Организация
		                              |	ИЗ
		                              |		Справочник.Организации КАК Организации
		                              |	ГДЕ
		                              |		Организации.Ссылка = &Организация) КАК ЗачетАвансовыхПлатежейПоНалогамИСборамНУ
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
		                              |			РегламентнаяОперация.Состояние КАК Состояние,
		                              |			РегламентнаяОперация.Организация КАК Организация
		                              |		ИЗ
		                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
		                              |		ГДЕ
		                              |			РегламентнаяОперация.Организация = &Организация
									  |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
		                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
		                              |			И РегламентнаяОперация.ЗачетАвансовыхПлатежейПоНалогамИСборамНУ
		                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
		                              |		ПО ЗачетАвансовыхПлатежейПоНалогамИСборамНУ.Организация = РегламентнаяОперация.Организация";  
								  

	КонецЕсли;
	
	Если Группа = 4 Или Группа = "Все" Тогда
		
		Если Группа = "Все"  Тогда
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("КонецКвартала", КонецКвартала);
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	РасчетИтоговогоДоходаУбыткаБУ.Организация КАК Организация,
		                              |	РасчетИтоговогоДоходаУбыткаБУ.ВидОперации КАК ВидОперации,
		                              |	""РегламентнаяОперация"" КАК ВидДокумента,
		                              |	ИСТИНА КАК Требуется,
		                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,									  
									  |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
		                              |ИЗ
		                              |	(ВЫБРАТЬ
		                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетИтоговогоДоходаУбыткаБУ) КАК ВидОперации,
		                              |		Организации.Ссылка КАК Организация
		                              |	ИЗ
		                              |		Справочник.Организации КАК Организации
		                              |	ГДЕ
		                              |		Организации.Ссылка = &Организация) КАК РасчетИтоговогоДоходаУбыткаБУ
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
		                              |			РегламентнаяОперация.Состояние КАК Состояние,
		                              |			РегламентнаяОперация.Организация КАК Организация
		                              |		ИЗ
		                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
		                              |		ГДЕ
		                              |			РегламентнаяОперация.Организация = &Организация
									  |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
		                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
		                              |			И РегламентнаяОперация.РасчетИтоговогоДоходаУбыткаБУ
		                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
		                              |		ПО РасчетИтоговогоДоходаУбыткаБУ.Организация = РегламентнаяОперация.Организация
		                              |
		                              |ОБЪЕДИНИТЬ ВСЕ
		                              |
		                              |ВЫБРАТЬ
		                              |	РеформацияБалансаБУ.Организация,
		                              |	РеформацияБалансаБУ.ВидОперации,
		                              |	""РегламентнаяОперация"",
		                              |	ИСТИНА,
		                              |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
		                              |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
		                              |ИЗ
		                              |	(ВЫБРАТЬ
		                              |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РеформацияБалансаБУ) КАК ВидОперации,
		                              |		Организации.Ссылка КАК Организация
		                              |	ИЗ
		                              |		Справочник.Организации КАК Организации
		                              |	ГДЕ
		                              |		Организации.Ссылка = &Организация) КАК РеформацияБалансаБУ
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
		                              |			РегламентнаяОперация.Состояние КАК Состояние,
		                              |			РегламентнаяОперация.Организация КАК Организация
		                              |		ИЗ
		                              |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
		                              |		ГДЕ
		                              |			РегламентнаяОперация.Организация = &Организация
									  |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
		                              |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
		                              |			И РегламентнаяОперация.РеформацияБалансаБУ
		                              |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
		                              |		ПО РеформацияБалансаБУ.Организация = РегламентнаяОперация.Организация";

		
	КонецЕсли;
	
	Если Группа = 5 Или Группа = "Все" Тогда
		
		Если Группа = "Все"  Тогда
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;

	Запрос.УстановитьПараметр("КонецГода", КонецГода);		
	
	Запрос.УстановитьПараметр("КонецГодаДляЗакрытияСчетовНУ", КонецГода);
	
			
	Запрос.Текст = Запрос.Текст +  "ВЫБРАТЬ
	                               |	РасчетДоходаОтПревышенияСтоимостиВыбывшихФА.Организация КАК Организация,
	                               |	РасчетДоходаОтПревышенияСтоимостиВыбывшихФА.ВидОперации КАК ВидОперации,
	                               |	""РегламентнаяОперация"" КАК ВидДокумента,
	                               |	&КонецГода КАК Требуется,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетДоходаОтПревышенияСтоимостиВыбывшихФА) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетДоходаОтПревышенияСтоимостиВыбывшихФА
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетДоходаОтПревышенияСтоимостиВыбывшихФА
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетДоходаОтПревышенияСтоимостиВыбывшихФА.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	СписаниеПриВыбытииВсехФАГруппы.Организация,
	                               |	СписаниеПриВыбытииВсехФАГруппы.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.СписаниеПриВыбытииВсехФАГруппы) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК СписаниеПриВыбытииВсехФАГруппы
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.СписаниеПриВыбытииВсехФАГруппы
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО СписаниеПриВыбытииВсехФАГруппы.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	СписаниеСтоимостногоБалансаГруппыМенееМинимума.Организация,
	                               |	СписаниеСтоимостногоБалансаГруппыМенееМинимума.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.СписаниеСтоимостногоБалансаГруппыМенееМинимума) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК СписаниеСтоимостногоБалансаГруппыМенееМинимума
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.СписаниеСтоимостногоБалансаГруппыМенееМинимума
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО СписаниеСтоимостногоБалансаГруппыМенееМинимума.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	АмортизацияФАНУ.Организация,
	                               |	АмортизацияФАНУ.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.АмортизацияФАНУ) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК АмортизацияФАНУ
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.АмортизацияФАНУ
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО АмортизацияФАНУ.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	РасчетВычетовПоРасходамНаРемонт.Организация,
	                               |	РасчетВычетовПоРасходамНаРемонт.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетВычетовПоРасходамНаРемонт) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетВычетовПоРасходамНаРемонт
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетВычетовПоРасходамНаРемонт
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетВычетовПоРасходамНаРемонт.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	РасчетВычетовПоПреференциям.Организация,
	                               |	РасчетВычетовПоПреференциям.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетВычетовПоПреференциям) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетВычетовПоПреференциям
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетВычетовПоПреференциям
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетВычетовПоПреференциям.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно.Организация,
	                               |	ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО ВключениеВСтоимостныйБалансАктивовУчитываемыхОтдельно.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	РасчетВычетаПоРеализованнымТоварам.Организация,
	                               |	РасчетВычетаПоРеализованнымТоварам.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетВычетаПоРеализованнымТоварам) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетВычетаПоРеализованнымТоварам
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
								   |			И РегламентнаяОперация.СтруктурноеПодразделение = &СтруктурноеПодразделение
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетВычетаПоРеализованнымТоварам
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетВычетаПоРеализованнымТоварам.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	ЗакрытиеСчетовНУ.Организация,
	                               |	ЗакрытиеСчетовНУ.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГодаДляЗакрытияСчетовНУ,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.ЗакрытиеСчетовНУ) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК ЗакрытиеСчетовНУ
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.ЗакрытиеСчетовНУ
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО ЗакрытиеСчетовНУ.Организация = РегламентнаяОперация.Организация
								   |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	РасчетВычетовПоНалогам.Организация,
	                               |	РасчетВычетовПоНалогам.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетВычетовПоНалогам) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетВычетовПоНалогам
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетВычетовПоНалогам
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетВычетовПоНалогам.Организация = РегламентнаяОперация.Организация"; 	

	КонецЕсли;
	
	Если Группа = 6 ИЛИ Группа = "Все" Тогда
		
		Если Группа = "Все"  Тогда
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;

	Запрос.Текст = Запрос.Текст +  "ВЫБРАТЬ
	                               |	РасчетИтоговогоДоходаУбыткаНУ.Организация КАК Организация,
	                               |	РасчетИтоговогоДоходаУбыткаНУ.ВидОперации КАК ВидОперации,
	                               |	""РегламентнаяОперация"" КАК ВидДокумента,
	                               |	&КонецГода КАК Требуется,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено) КАК Состояние
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетИтоговогоДоходаУбыткаНУ) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетИтоговогоДоходаУбыткаНУ
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетИтоговогоДоходаУбыткаНУ
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетИтоговогоДоходаУбыткаНУ.Организация = РегламентнаяОперация.Организация
	                               |	                             
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	РасчетВременныхРазниц.Организация,
	                               |	РасчетВременныхРазниц.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетВременныхРазниц) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетВременныхРазниц
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетВременныхРазниц
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетВременныхРазниц.Организация = РегламентнаяОперация.Организация
	                               |
	                               |ОБЪЕДИНИТЬ ВСЕ
	                               |
	                               |ВЫБРАТЬ
	                               |	РасчетНалогаНаПрибыль.Организация,
	                               |	РасчетНалогаНаПрибыль.ВидОперации,
	                               |	""РегламентнаяОперация"",
	                               |	&КонецГода,
	                               |	ЕСТЬNULL(РегламентнаяОперация.РучнаяКорректировка, ЛОЖЬ),
	                               |	ЕСТЬNULL(РегламентнаяОперация.Состояние, &НеВыполнено)
	                               |ИЗ
	                               |	(ВЫБРАТЬ
	                               |		ЗНАЧЕНИЕ(Перечисление.ВидыРегламентныхОпераций.РасчетНалогаНаПрибыль) КАК ВидОперации,
	                               |		Организации.Ссылка КАК Организация
	                               |	ИЗ
	                               |		Справочник.Организации КАК Организации
	                               |	ГДЕ
	                               |		Организации.Ссылка = &Организация) КАК РасчетНалогаНаПрибыль
	                               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                               |			РегламентнаяОперация.РучнаяКорректировка КАК РучнаяКорректировка,
	                               |			РегламентнаяОперация.Состояние КАК Состояние,
	                               |			РегламентнаяОперация.Организация КАК Организация
	                               |		ИЗ
	                               |			Документ.ЗакрытиеМесяца КАК РегламентнаяОперация
	                               |		ГДЕ
	                               |			РегламентнаяОперация.Организация = &Организация
	                               |			И РегламентнаяОперация.Дата МЕЖДУ &ДатаНач И &ДатаКон
	                               |			И РегламентнаяОперация.РасчетНалогаНаПрибыль
	                               |			И (НЕ РегламентнаяОперация.ПометкаУдаления)) КАК РегламентнаяОперация
	                               |		ПО РасчетНалогаНаПрибыль.Организация = РегламентнаяОперация.Организация";
		        
	КонецЕсли;
	
	
	Запрос.Текст = Запрос.Текст + ") КАК ВложенныйЗапрос	
	    |СГРУППИРОВАТЬ ПО
		|   ВложенныйЗапрос.Организация,
		|	&СтруктурноеПодразделение,
		|	ВложенныйЗапрос.ВидДокумента,
		|	ВложенныйЗапрос.ВидОперации,
		|	ВложенныйЗапрос.Требуется,
		|	ВложенныйЗапрос.Состояние,
		|	ВложенныйЗапрос.РучнаяКорректировка";

  
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УстановитьДоступность(Организация, Период, Форма, ИныеУсловия = Истина) Экспорт
	
	СоответствиеГраницЗапрета = ПараметрыСеанса.ГраницыЗапретаИзмененияДанных.Получить();
	
	// Для пользователя с полными правами проверок выполнять не нужно
	Если СоответствиеГраницЗапрета = Неопределено Тогда
		УсловиеГраницы = Истина;
	Иначе
		ДатаЗапретаРедактирования = СоответствиеГраницЗапрета.Получить(Организация);
		УсловиеГраницы = (ДатаЗапретаРедактирования < Период);
	КонецЕсли;
	
	Доступность = (УсловиеГраницы И ИныеУсловия);
	
	// устанавливаем экспортную переменную формы
	Форма.мРежимТолькоПросмотр 	= НЕ Доступность; // для скрытия контекстных команд
	Форма.ТолькоПросмотр 		= НЕ Доступность;	
КонецПроцедуры	// УстановитьДоступностьФормыДляРедактирования

Процедура  ПечатьСправкиРасчета(Объект, Организация,СтруктурноеПодразделение, ПериодРегистрации) Экспорт
		
	СправкаРасчет = Объект.Создать();
	ФормаОбъекта = СправкаРасчет.ПолучитьФорму();
	МетаданныеОтчета = СправкаРасчет.Метаданные();
	
	Если ОбщегоНазначения.ЕстьРеквизитОтчета("ИспользоватьИнуюНастройку",МетаданныеОтчета) Тогда
		СправкаРасчет.ИспользоватьИнуюНастройку = Истина;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОтчета("Организация",МетаданныеОтчета) Тогда
		СправкаРасчет.Организация = Организация;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОтчета("СтруктурноеПодразделение",МетаданныеОтчета) Тогда
		СправкаРасчет.СтруктурноеПодразделение = СтруктурноеПодразделение;
	КонецЕсли;

	Если ОбщегоНазначения.ЕстьРеквизитОтчета("ДатаНач",МетаданныеОтчета) Тогда
		СправкаРасчет.ДатаНач = НачалоМесяца(ПериодРегистрации);
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОтчета("ДатаКон",МетаданныеОтчета) Тогда
	    СправкаРасчет.ДатаКон = КонецМесяца(ПериодРегистрации);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОтчета("ПериодРегистрации",МетаданныеОтчета) Тогда
	    СправкаРасчет.ПериодРегистрации = КонецМесяца(ПериодРегистрации);
	КонецЕсли;
	
	Если Объект = Отчеты.СправкаРасчетВычетовПоНалогам Тогда
		СправкаРасчет.НачалоПериода = НачалоМесяца(ПериодРегистрации);
	    СправкаРасчет.КонецПериода = КонецМесяца(ПериодРегистрации);
		
		мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
		мСписокСтруктурныхЕдиниц.Добавить(Организация);
		СправкаРасчет.мСписокСтруктурныхЕдиниц = мСписокСтруктурныхЕдиниц;
		
		мСписокПодразделений = Новый СписокЗначений;
		мСписокПодразделений.Добавить(СтруктурноеПодразделение);
		СправкаРасчет.мСписокПодразделений = мСписокПодразделений;
		СправкаРасчет.РежимРасшифровки = Истина;
	КонецЕсли;
	
	ФормаОбъекта.Открыть();
	Если Объект = Отчеты.СправкаРасчетВычетовПоНалогам Тогда
		ФормаОбъекта.ОбновитьОтчет();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьСправкиРасчеты(Организация, СтруктурноеПодразделение, ПериодРегистрации, ВидОперации = "Все") Экспорт 
		
	Если ВидОперации = "Все" Тогда
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетСписаниеРБП, 					Организация, СтруктурноеПодразделение, ПериодРегистрации);
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетСебестоимостиПродукцииИУслуг, 	Организация, СтруктурноеПодразделение, ПериодРегистрации);
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетКалькуляцияСебестоимости, 		Организация, СтруктурноеПодразделение, ПериодРегистрации);
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетРаспределенияКосвенныхРасходов,Организация, СтруктурноеПодразделение,ПериодРегистрации);						
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетПереоценкаВалютныхСредств, 	Организация, СтруктурноеПодразделение, ПериодРегистрации);						
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетВычетаПоРеализованнымТоварам, 	Организация, СтруктурноеПодразделение, ПериодРегистрации);						
	ИначеЕсли ВидОперации = Перечисления.ВидыРегламентныхОпераций.СписаниеРБПБУ Тогда
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетСписаниеРБП, 				Организация, СтруктурноеПодразделение,ПериодРегистрации);
	ИначеЕсли ВидОперации = Перечисления.ВидыРегламентныхОпераций.ПереоценкаВалютныхСредствБУ Тогда
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетПереоценкаВалютныхСредств, Организация, СтруктурноеПодразделение,ПериодРегистрации);
	ИначеЕсли ВидОперации = Перечисления.ВидыРегламентныхОпераций.РасчетСтоимостиПродукцииБУ Тогда
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетСебестоимостиПродукцииИУслуг, Организация, СтруктурноеПодразделение,ПериодРегистрации);
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетРаспределенияКосвенныхРасходов, Организация,СтруктурноеПодразделение, ПериодРегистрации);
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетКалькуляцияСебестоимости, 	Организация,СтруктурноеПодразделение, ПериодРегистрации);		
	ИначеЕсли ВидОперации = Перечисления.ВидыРегламентныхОпераций.РасчетВычетаПоРеализованнымТоварам Тогда
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетВычетаПоРеализованнымТоварам,Организация, СтруктурноеПодразделение,ПериодРегистрации);
	ИначеЕсли ВидОперации = Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоНалогам Тогда
		ПечатьСправкиРасчета(Отчеты.СправкаРасчетВычетовПоНалогам,Организация, СтруктурноеПодразделение,ПериодРегистрации);
	КонецЕсли;
	
КонецПроцедуры

Функция СуществуетСправкаРасчет (ВидОперации) Экспорт
	Если  ВидОперации = Перечисления.ВидыРегламентныхОпераций.СписаниеРБПБУ 
		ИЛИ ВидОперации = Перечисления.ВидыРегламентныхОпераций.РасчетСтоимостиПродукцииБУ 
		ИЛИ ВидОперации = Перечисления.ВидыРегламентныхОпераций.ПереоценкаВалютныхСредствБУ
		ИЛИ ВидОперации = Перечисления.ВидыРегламентныхОпераций.РасчетВычетаПоРеализованнымТоварам 
		ИЛИ ВидОперации = Перечисления.ВидыРегламентныхОпераций.РасчетВычетовПоНалогам  Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции


