
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыДокумента = ПараметрыВыбора(ПараметрКоманды);
	СписокПоследующихПериодов = Новый СписокЗначений;
	мПериод = ПараметрыДокумента.ПериодПланирования;
	Пока мПериод <=ПараметрыДокумента.ГоризонтПланирования Цикл
		СписокПоследующихПериодов.Добавить(мПериод,фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(мПериод,ПараметрыДокумента.Периодичность));
		мПериод = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.СледующийПериодПланирования(мПериод,ПараметрыДокумента.Периодичность);
	КонецЦикла;
	Если СписокПоследующихПериодов.Количество()=1 Тогда
		ОбработкаВыбораПериода(СписокПоследующихПериодов[0], ПараметрКоманды);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериода",ЭтотОбъект,ПараметрКоманды);
		СписокПоследующихПериодов.ПоказатьВыборЭлемента(ОписаниеОповещения,"Выберите период для актуализации");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериода(Период, Документ) Экспорт
	Если Период=Неопределено Тогда
		Возврат;
	КонецЕсли;
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Основание",Новый Структура("ЭтоКорректировка,Документ,АктуализируемыйПериод,УчетПрогноза",Истина,Документ,Период.Значение,Истина));
	ОткрытьФорму("Документ.фин_Бюджет.ФормаОбъекта", ПараметрыФормы, , Новый УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры

&НаСервере
Функция ПараметрыВыбора(Документ)
	Возврат Новый Структура("ПериодПланирования,Периодичность,ГоризонтПланирования",Документ.ПериодПланирования,фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПериодичностьСценария(Документ.Сценарий),фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьГоризонтПланирования(Документ.ПериодПланирования,Документ.Сценарий));
КонецФункции