
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	БюджетВладелец = Объект.Владелец;
	Элементы.ГруппаФормулыРасчета.Видимость = БюджетВладелец.РучнаяНастройкаИтоговПоГруппам;
	Элементы.Формула.Видимость 				= БюджетВладелец.УчетПоСумме;
	Элементы.ФормулаКоличество.Видимость 	= БюджетВладелец.УчетПоКоличеству;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Если НЕ ПолеОбъекта(Объект.Владелец,"РучнаяНастройкаИтоговПоГруппам") Тогда
		Объект.Формула 				= ПредопределенноеЗначение("Справочник.фин_ФормулыРасчетаФинансовыхПоказателей.ПустаяСсылка");	
		Объект.ФормулаКоличество 	= ПредопределенноеЗначение("Справочник.фин_ФормулыРасчетаФинансовыхПоказателей.ПустаяСсылка");
	Иначе
		Если НЕ ПолеОбъекта(Объект.Владелец,"УчетПоСумме") Тогда
			Объект.Формула 			= ПредопределенноеЗначение("Справочник.фин_ФормулыРасчетаФинансовыхПоказателей.ПустаяСсылка");	
		КонецЕсли;
		Если НЕ ПолеОбъекта(Объект.Владелец,"УчетПоКоличеству") Тогда
			Объект.ФормулаКоличество= ПредопределенноеЗначение("Справочник.фин_ФормулыРасчетаФинансовыхПоказателей.ПустаяСсылка");	
		КонецЕсли;
	КонецЕсли;
	УправлениеФормой();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолеОбъекта(Бюджет,Поле)
	Возврат Бюджет[Поле];	
КонецФункции
