////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступность();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВидДокументовПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьДоступность();
	Если Запись.Статус <> ПредопределенноеЗначение("Перечисление.усд_СтатусыДокументовНаЭтапах.Возвращенный")
		И Запись.Статус <> ПредопределенноеЗначение("Перечисление.усд_СтатусыДокументовНаЭтапах.Отклоненный") Тогда
		Запись.ПричинаВозврата = "";
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьДоступность()
	Элементы.ПричинаВозврата.Видимость = (Запись.Статус=Перечисления.усд_СтатусыДокументовНаЭтапах.Возвращенный ИЛИ Запись.Статус=Перечисления.усд_СтатусыДокументовНаЭтапах.Отклоненный);
	Если ЗначениеЗаполнено(Запись.ВидДокументов) И Запись.ВидДокументов.ПрограммныйИдентификатор<>"" Тогда
		Элементы.Документ.ОграничениеТипа=Новый ОписаниеТипов("ДокументСсылка."+Запись.ВидДокументов.ПрограммныйИдентификатор);
	Иначе
		Элементы.Документ.ОграничениеТипа=Новый ОписаниеТипов("Неопределено");
	КонецЕсли;
КонецПроцедуры
