
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокБюджетов.Добавить(Перечисления.фин_КлассификаторБюджетов.БюджетДвиженияДенежныхСредств);
	СписокБюджетов.Добавить(Перечисления.фин_КлассификаторБюджетов.БюджетДоходовИРасходов);
	СписокБюджетов.Добавить(Перечисления.фин_КлассификаторБюджетов.БюджетПоБалансовомуЛисту);
	ЗаполнитьСтатьи();
	КодСтроки = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,Запись.КлассификаторПозицииОтчета);
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторБюджетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокБюджетов;
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторБюджетовПриИзменении(Элемент)
	ЗаполнитьСтатьи();
	Если СписокСтатей.НайтиПоЗначению(Запись.КлассификаторПозицииОтчета)=Неопределено Тогда
		Запись.КлассификаторПозицииОтчета = ПредопределенноеЗначение("Перечисление.фин_КлассификаторСтатейБюджетов.ПустаяСсылка");
	КонецЕсли;
	КодСтроки = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,Запись.КлассификаторПозицииОтчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьи()
	СписокСтатей.Очистить();
	ТаблицаСтатей = фин_УправлениеБюджетнойМоделью.ПолучитьТаблицуПостатейногоСоставаБюджетов(,Запись.КлассификаторБюджетов);
	СтрокиОтдельныхСтатей = ТаблицаСтатей.НайтиСтроки(Новый Структура("ЭтоГруппа",Ложь));
	Для Каждого СтрокаСтатья Из СтрокиОтдельныхСтатей Цикл
		Представление = Строка(СтрокаСтатья.Статья);
		Представление = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,СтрокаСтатья.Статья) + ". "+Представление;
		СписокСтатей.Добавить(СтрокаСтатья.Статья,Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторПозицииОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокСтатей;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьКодСтроки(КлассификаторБюджетов,Статья)
	Если КлассификаторБюджетов=Перечисления.фин_КлассификаторБюджетов.БюджетДвиженияДенежныхСредств Тогда
		Возврат Отчеты.фин_ПрогнозныйОтчетОДвиженииДенег.КодСтрокиОтчета(Статья);
	ИначеЕсли КлассификаторБюджетов=Перечисления.фин_КлассификаторБюджетов.БюджетДоходовИРасходов Тогда
		Возврат Отчеты.фин_ПрогнозныйОтчетОДоходахИРасходах.КодСтрокиОтчета(Статья);
	КонецЕсли;
	Возврат "";
КонецФункции

&НаКлиенте
Процедура КлассификаторПозицииОтчетаПриИзменении(Элемент)
	КодСтроки = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,Запись.КлассификаторПозицииОтчета);
КонецПроцедуры
