Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		Для Каждого ЭлементЗаполнения Из ДанныеЗаполнения Цикл
			Если Метаданные().Реквизиты.Найти(ЭлементЗаполнения.Ключ)<>Неопределено ИЛИ ЭлементЗаполнения.Ключ="Владелец" Тогда
				ЭтотОбъект[ЭлементЗаполнения.Ключ] = ЭлементЗаполнения.Значение;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(Владелец) И ТипЗнч(Владелец)=Тип("СправочникСсылка.фин_КлассификаторРегистров") Тогда
			ВидДанных=Перечисления.фин_ВидыОтраженийПервичныхДокументовВБюджетировании.ПоДвижениямВРегистрах;
			ИмяИсточника = Владелец.ПолучитьОбъект().ПолноеИмя();
			ПредставлениеИсточника = Владелец.НаименованиеПолное;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ОписаниеУсловия = Справочники.усд_УсловияВыполненияОперацийПоСтрокамДокумента.ПолучитьОписаниеУсловияДляЭлементаСправочника(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив;
	Если ТипЗнч(Владелец)=Тип("СправочникСсылка.фин_КлассификаторРегистров") Тогда
		НепроверяемыеРеквизиты.Добавить("ВидДанных");
		НепроверяемыеРеквизиты.Добавить("ИмяИсточника");
		НепроверяемыеРеквизиты.Добавить("ПредставлениеИсточника");
	ИначеЕсли ВидДанных=Перечисления.фин_ВидыОтраженийПервичныхДокументовВБюджетировании.ПоШапкеДокумента Тогда
		НепроверяемыеРеквизиты.Добавить("ИмяИсточника");
		НепроверяемыеРеквизиты.Добавить("ПредставлениеИсточника");
	КонецЕсли;
	фин_ЗаполнениеДокументов.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,НепроверяемыеРеквизиты);
КонецПроцедуры
