Функция КодСтрокиОтчета(ДвижениеДенежныхСредств) Экспорт
	Если ТипЗнч(ДвижениеДенежныхСредств) = Тип("ПеречислениеСсылка.фин_КлассификаторСтатейБюджетов") Тогда
		Если ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтРеализацииОсновныхСредств Тогда
			Возврат "041";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтРеализацииНематериальныхАктивов Тогда 
			Возврат "042";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтРеализацииДругихДолгосрочныхАктивов Тогда 
			Возврат "043";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтРеализацииПрочихФинансовыхАктивов Тогда 
			Возврат "047";				
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтФьючерсныхИФорвардныхКонтрактовОпционовИСвопов Тогда 
			Возврат "048";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтРеализацииДолевыхИнструментовДругихОрганизацийКромеДочерних Тогда
			Возврат "044"; 
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтРеализацииДолговыхИнструментовДругихОрганизаций Тогда
			Возврат "045";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтВозмещенияПриПотереКонтроляНадДочернимиОрганизациями Тогда
			Возврат "046";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПолученныеДивидендыПоИнвестиционнойДеятельности Тогда
			Возврат "049";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПолученныеВознагражденияПоИнвестиционнойДеятельности Тогда
			Возврат "050";					
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПрочиеПоступленияПоИнвестиционнойДеятельности Тогда
			Возврат "051";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаПриобретениеОсновныхСредств Тогда
			Возврат "061";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаПриобретениеНематериальныхАктивов Тогда 
			Возврат "062";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаПриобретениеДругихДолгосрочныхАктивов Тогда 
			Возврат "063";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаПриобретениеПрочихФинансовыхАктивов Тогда 
			Возврат "067";	
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПредоставлениеЗаймов Тогда 
			Возврат "068";		
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаФьючерсныеФорвардныеКонтрактыОпционыСвопы Тогда 
			Возврат "069";								
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаПриобретениеДолевыхИнструментовДругихОрганизацийКромеДочерних Тогда 
			Возврат "064";	
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаПриобретениеДолговыхИнструментовДругихОрганизаций Тогда 
			Возврат "065";	
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиЗаПриобретениеКонтроляНадДочернимиОрганизациями Тогда 
			Возврат "066";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ИнвестицииВАссоциированныеИДочерниеОрганизации Тогда 
			Возврат "070";									
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПрочиеВыплатыПоИнвестиционнойДеятельности Тогда 
			Возврат "071";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтЭмиссииАкцийИДругихФинансовыхИнструментов Тогда
			Возврат "091";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПолучениеЗаймов Тогда 
			Возврат "092";				
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПолученныеВознагражденияПоФинансовойДеятельности Тогда 
			Возврат "093";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПрочиеПоступленияОтФинансовойДеятельности Тогда 
			Возврат "094";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПогашениеЗаймов Тогда
			Возврат "101";			
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ВыплатаДивидендов Тогда 
			Возврат "103";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ВыплатаВознагражденияПоФинансовойДеятельности Тогда 
			Возврат "102";
		ИначеЕсли ДвижениеДенежныхСредств	 = Перечисления.фин_КлассификаторСтатейБюджетов.ВыплатыСобственникамПоАкциямОрганизации Тогда 
			Возврат "104";	
		ИначеЕсли ДвижениеДенежныхСредств	 = Перечисления.фин_КлассификаторСтатейБюджетов.ПрочиеВыбытияПоФинансовойДеятельности Тогда 
			Возврат "105";	
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияОтРеализацииТоваровИУслуг Тогда
			Возврат "011";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.АвансыПолученныеОтПокупателейЗаказчиков Тогда 
			Возврат "013";					
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ВыплатаВознагражденияПоОперационнойДеятельности Тогда 
			Возврат "015";
		ИначеЕсли ДвижениеДенежныхСредств	 = Перечисления.фин_КлассификаторСтатейБюджетов.ПрочаяВыручка Тогда 
			Возврат "012";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПоступленияПоДоговорамСтрахования Тогда 
			Возврат "014";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПрочиеПоступленияПоОперационнойДеятельности Тогда 
			Возврат "016";				
		ИначеЕсли  ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПлатежиПоставщикамЗаТоварыИУслуги Тогда
			Возврат "021";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.АвансыВыданныеПоставщикамТоваровИУслуг Тогда 
			Возврат "022";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ВыплатыПоОплатеТруда Тогда 
			Возврат "023";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ВыплатаВознагражденияПоОперационнойДеятельности Тогда 
			Возврат "024";					
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ВыплатыПоДоговорамСтрахования Тогда 						
			Возврат "025";										
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ДругиеПлатежиВБюджет Тогда 
			Возврат "026";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.КорпоративныйПодоходныйНалог Тогда 
			Возврат "026";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ПрочиеВыплатыПоОперационнойДеятельности Тогда 
			Возврат "027";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ДенежныеСредстваНаНачалоПериода Тогда 
			Возврат "140";
		ИначеЕсли ДвижениеДенежныхСредств = Перечисления.фин_КлассификаторСтатейБюджетов.ДенежныеСредстваНаКонецПериода Тогда 
			Возврат "150";
		КонецЕсли;	
	КонецЕсли;
	Возврат "";
КонецФункции

// Выполняет расчет вычисляемых показателей отчета
// (ячеек, выделенных зеленым цветом).
//
Процедура Расчет(мБаланс)  Экспорт
	
	// Строка 010 Поступление денежных средств, всего
	мБаланс.Области.Б010_3.Значение = мБаланс.Области.Б011_3.Значение
	                                  + мБаланс.Области.Б012_3.Значение
	                                  + мБаланс.Области.Б013_3.Значение
	                                  + мБаланс.Области.Б014_3.Значение
	                                  + мБаланс.Области.Б015_3.Значение
									  + мБаланс.Области.Б016_3.Значение;
									  
	мБаланс.Области.Б010_4.Значение = мБаланс.Области.Б011_4.Значение
	                                  + мБаланс.Области.Б012_4.Значение
	                                  + мБаланс.Области.Б013_4.Значение
	                                  + мБаланс.Области.Б014_4.Значение
	                                  + мБаланс.Области.Б015_4.Значение
									  + мБаланс.Области.Б016_4.Значение;									  									  

	// Строка 020 Выбытие денежных средств, всего
	мБаланс.Области.Б020_3.Значение = мБаланс.Области.Б021_3.Значение
	                                  + мБаланс.Области.Б022_3.Значение
	                                  + мБаланс.Области.Б023_3.Значение
	                                  + мБаланс.Области.Б024_3.Значение
	                                  + мБаланс.Области.Б025_3.Значение
	                                  + мБаланс.Области.Б026_3.Значение
	                                  + мБаланс.Области.Б027_3.Значение;

	мБаланс.Области.Б020_4.Значение = мБаланс.Области.Б021_4.Значение
	                                  + мБаланс.Области.Б022_4.Значение
	                                  + мБаланс.Области.Б023_4.Значение
	                                  + мБаланс.Области.Б024_4.Значение
	                                  + мБаланс.Области.Б025_4.Значение
	                                  + мБаланс.Области.Б026_4.Значение
	                                  + мБаланс.Области.Б027_4.Значение;
									  
	// Строка 030 Чистая сумма денежных средств от операционной деятельности (стр. 010 - стр. 020)
	мБаланс.Области.Б030_3.Значение = мБаланс.Области.Б010_3.Значение
	                                  - мБаланс.Области.Б020_3.Значение;

	мБаланс.Области.Б030_4.Значение = мБаланс.Области.Б010_4.Значение
	                                  - мБаланс.Области.Б020_4.Значение;
									  
	// Строка 040 Поступление денежных средств, всего
	мБаланс.Области.Б040_3.Значение = мБаланс.Области.Б041_3.Значение
	                                  + мБаланс.Области.Б042_3.Значение
	                                  + мБаланс.Области.Б043_3.Значение
	                                  + мБаланс.Области.Б044_3.Значение
	                                  + мБаланс.Области.Б045_3.Значение
	                                  + мБаланс.Области.Б046_3.Значение
	                                  + мБаланс.Области.Б047_3.Значение
									  + мБаланс.Области.Б048_3.Значение
									  + мБаланс.Области.Б049_3.Значение
									  + мБаланс.Области.Б050_3.Значение
									  + мБаланс.Области.Б051_3.Значение;

	мБаланс.Области.Б040_4.Значение = мБаланс.Области.Б041_4.Значение
	                                  + мБаланс.Области.Б042_4.Значение
	                                  + мБаланс.Области.Б043_4.Значение
	                                  + мБаланс.Области.Б044_4.Значение
	                                  + мБаланс.Области.Б045_4.Значение
	                                  + мБаланс.Области.Б046_4.Значение
	                                  + мБаланс.Области.Б047_4.Значение
									  + мБаланс.Области.Б048_4.Значение
									  + мБаланс.Области.Б049_4.Значение
									  + мБаланс.Области.Б050_4.Значение
									  + мБаланс.Области.Б051_4.Значение;
									
    // Строка 050 Выбытие денежных средств, всего
	мБаланс.Области.Б060_3.Значение = мБаланс.Области.Б061_3.Значение
	                                  + мБаланс.Области.Б062_3.Значение
	                                  + мБаланс.Области.Б063_3.Значение
	                                  + мБаланс.Области.Б064_3.Значение
	                                  + мБаланс.Области.Б065_3.Значение
	                                  + мБаланс.Области.Б066_3.Значение
	                                  + мБаланс.Области.Б067_3.Значение
									  + мБаланс.Области.Б068_3.Значение
									  + мБаланс.Области.Б069_3.Значение
									  + мБаланс.Области.Б070_3.Значение
									  + мБаланс.Области.Б071_3.Значение;

	мБаланс.Области.Б060_4.Значение = мБаланс.Области.Б061_4.Значение
	                                  + мБаланс.Области.Б062_4.Значение
	                                  + мБаланс.Области.Б063_4.Значение
	                                  + мБаланс.Области.Б064_4.Значение
	                                  + мБаланс.Области.Б065_4.Значение
	                                  + мБаланс.Области.Б066_4.Значение
	                                  + мБаланс.Области.Б067_4.Значение
									  + мБаланс.Области.Б068_4.Значение
									  + мБаланс.Области.Б069_4.Значение
									  + мБаланс.Области.Б070_4.Значение
									  + мБаланс.Области.Б071_4.Значение;
									  
	// Строка 080 Чистая сумма денежных средств от инвестиционной деятельности (стр. 040 - стр. 060)
	мБаланс.Области.Б080_3.Значение = мБаланс.Области.Б040_3.Значение
	                                  - мБаланс.Области.Б060_3.Значение;

	мБаланс.Области.Б080_4.Значение = мБаланс.Области.Б040_4.Значение
	                                  - мБаланс.Области.Б060_4.Значение;
									  
	// Строка 090 Поступление денежных средств, всего
	мБаланс.Области.Б090_3.Значение = мБаланс.Области.Б091_3.Значение
	                                  + мБаланс.Области.Б092_3.Значение
	                                  + мБаланс.Области.Б093_3.Значение
	                                  + мБаланс.Области.Б094_3.Значение;

	мБаланс.Области.Б090_4.Значение = мБаланс.Области.Б091_4.Значение
	                                  + мБаланс.Области.Б092_4.Значение
	                                  + мБаланс.Области.Б093_4.Значение
	                                  + мБаланс.Области.Б094_4.Значение;
	
	// Строка 100 Выбытие денежных средств, всего
	мБаланс.Области.Б100_3.Значение = мБаланс.Области.Б101_3.Значение
	                                  + мБаланс.Области.Б102_3.Значение
	                                  + мБаланс.Области.Б103_3.Значение
	                                  + мБаланс.Области.Б104_3.Значение
									  + мБаланс.Области.Б105_3.Значение;

	мБаланс.Области.Б100_4.Значение = мБаланс.Области.Б101_4.Значение
	                                  + мБаланс.Области.Б102_4.Значение
	                                  + мБаланс.Области.Б103_4.Значение
	                                  + мБаланс.Области.Б104_4.Значение
									  + мБаланс.Области.Б105_4.Значение;
									  
	// Строка 110 Чистая сумма денежных средств от финансовой деятельности (стр. 90 - стр. 100)
	мБаланс.Области.Б110_3.Значение = мБаланс.Области.Б090_3.Значение
	                                  - мБаланс.Области.Б100_3.Значение;

	мБаланс.Области.Б110_4.Значение = мБаланс.Области.Б090_4.Значение
	                                  - мБаланс.Области.Б100_4.Значение;
	
	// Итого: Увеличение +/- уменьшение денежных средств ( (строка 030 +/- строка 080 +/- строка 110 +/- строка 120))
	мБаланс.Области.Б130_3.Значение = мБаланс.Области.Б030_3.Значение
	                                  + мБаланс.Области.Б080_3.Значение
	                                  + мБаланс.Области.Б110_3.Значение
									  + мБаланс.Области.Б120_3.Значение;

	мБаланс.Области.Б130_4.Значение = мБаланс.Области.Б030_4.Значение
	                                  + мБаланс.Области.Б080_4.Значение
	                                  + мБаланс.Области.Б110_4.Значение
									  + мБаланс.Области.Б120_4.Значение;
	

КонецПроцедуры // Расчет()
