
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьТоваромИзПеречня(Команда)
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("ВводДатыЗавершение", ЭтаФорма,Ложь),
		ТекущаяДата(), НСтр("ru='Введите дату обновления перечня изъятий'"),ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводДатыЗавершение(Результат, ОчищатьДанные) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьТоваромИзПеречняНаСервере(Результат,ОчищатьДанные);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТоварыИзПеречня(Команда)
	
	ТекстВопроса = НСтр("ru = 'Перед заполнением текущие данные регистра будут удалены. Продолжить?'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаполнить", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьИзъятий(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбораКода = ПолучитьОбщуюФорму("ФормаВыбораИзКлассификатора", ЭтаФорма);
	
	ФормаВыбораКода.РежимВыбора = Истина;
	ФормаВыбораКода.ИмяМакета = "ПереченьИзъятий";
	ФормаВыбораКода.ИмяСекции = "Классификатор";  	
	ФормаВыбораКода.Открыть();

	#КонецЕсли

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаполнить(Результат, Параметры) Экспорт 
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("ВводДатыЗавершение",ЭтаФорма,Истина),
		ТекущаяДата(), НСтр("ru='Введите дату обновления перечня изъятий'"),ЧастиДаты.Дата);
	
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьТоваромИзПеречняНаСервере (Дата,ОчищатьДанные = Ложь)
	РегистрыСведений.ТоварыСПониженнойСтавкойПошлин.ЗаполнитьТоварыИзПеречняИзъятия(Дата,ОчищатьДанные);
КонецПроцедуры;


