Процедура ЗаполнитьПроектПоПоменклатурнойГруппе(СтрокаТабличнойЧасти,ЗначениеСубконто,Период) Экспорт
	Если фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("фин_ВестиУчетПоПроектам") И ТипЗнч(ЗначениеСубконто)=Тип("СправочникСсылка.НоменклатурныеГруппы") И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Проект) Тогда
		Проект = фин_УправлениеБюджетированием.ПолучитьСоответствиеРазрезуБюджетирования(ЗначениеСубконто,Перечисления.фин_ФактическиеПоказателиБюджетирования.Проект,Период);
		Если ЗначениеЗаполнено(Проект) Тогда
			СтрокаТабличнойЧасти.Проект = Проект;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры