
#Область ПрограммныйИнтерфейс

//См. функцию ЭлектронноеВзаимодействиеССервисами.ПолучитьКриптобиблиотекуССервера
Функция ПолучитьКриптобиблиотекуССервера(serviceNick = "", ДанныеПрофиля, ИнформацияОПрограмме, ВерсияКриптобиблиотекиКЗагрузке) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ПолучитьКриптобиблиотекуССервера(serviceNick, ДанныеПрофиля, ИнформацияОПрограмме, ВерсияКриптобиблиотекиКЗагрузке);
КонецФункции

//См. функцию ЭлектронноеВзаимодействиеССервисами.ПолучитьСсылкуНаСкачиваниеБиблиотекиКлиентУправляемая
Функция ПолучитьСсылкуНаСкачиваниеБиблиотекиКлиентУправляемая(ЗапросXML, Идентификатор = "", Организация) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ПолучитьСсылкуНаСкачиваниеБиблиотекиКлиентУправляемая(ЗапросXML, Идентификатор, Организация);
КонецФункции

//См. функцию ЭлектронноеВзаимодействиеССервисами.ВыполнитьМетодВебСервисаИТС
Функция ВыполнитьМетодВебСервисаИТС(Знач ТекстМетода, Знач ИмяВебСервиса) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ВыполнитьМетодВебСервисаИТС(ТекстМетода, ИмяВебСервиса);
КонецФункции

//См. функцию ЭлектронноеВзаимодействиеССервисами.ПолучитьТекущуюВерсиюКриптобиблиотеки
Функция ПолучитьТекущуюВерсиюКриптобиблиотеки(serviceNick = "", Организация, OptionName, ЭтоПроверкаКриптобиблиотеки = Ложь) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ПолучитьТекущуюВерсиюКриптобиблиотеки(serviceNick, Организация, OptionName, ЭтоПроверкаКриптобиблиотеки);
КонецФункции

//См. функцию ЭлектронноеВзаимодействиеССервисами.СоздатьХранилищеЗначений
Функция СоздатьХранилищеЗначений(Значение) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.СоздатьХранилищеЗначений(Значение);
КонецФункции

//См. функцию ЭлектронноеВзаимодействиеССервисами.КонстантыСоздатьНабор
Функция КонстантыСоздатьНабор(СтрМодифицируемыеКонстанты, ВнешнийМодуль, ОбъектВнешнийМодуль, ВерсияВнешнегоМодуля) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.КонстантыСоздатьНабор(СтрМодифицируемыеКонстанты, ВнешнийМодуль, ОбъектВнешнийМодуль, ВерсияВнешнегоМодуля);
КонецФункции

//См. процедуру ЭлектронноеВзаимодействиеССервисами.ОбновитьДанныеОкончанияПодписки
Процедура ОбновитьДанныеОкончанияПодписки() Экспорт
	ЭлектронноеВзаимодействиеССервисами.ОбновитьДанныеОкончанияПодписки();
КонецПроцедуры

//См. функцию ЭлектронноеВзаимодействиеССервисами.ПроверитьНаличиеОбновлений
Функция ПроверитьНаличиеОбновлений(ПараметрыСервераИнтернета, СвойстваМодуляДляТекущегоРелиза, ШапкаОшибки) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ПроверитьНаличиеОбновлений(ПараметрыСервераИнтернета, СвойстваМодуляДляТекущегоРелиза, ШапкаОшибки);
КонецФункции

//См. функцию ЭлектронноеВзаимодействиеССервисами.ЗакачатьИВключитьПризнакИспользования
Функция ЗакачатьИВключитьПризнакИспользования(ДополнительныеПараметры, СвойстваМодуляДляТекущегоРелиза, ШапкаОшибки) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ЗакачатьИВключитьПризнакИспользования(ДополнительныеПараметры, СвойстваМодуляДляТекущегоРелиза, ШапкаОшибки);
КонецФункции

//См. функцию ЭлектронноеВзаимодействиеССервисами.ОпределитьПараметрыТекущейКомпоненты
Функция ОпределитьПараметрыТекущейКомпоненты(ДанныеАктуальнойВерсии, ШапкаОшибки) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ОпределитьПараметрыТекущейКомпоненты(ДанныеАктуальнойВерсии, ШапкаОшибки);
КонецФункции

#Область РаботаКомпоненты

// См. функцию ЭлектронноеВзаимодействиеССервисами.ПолучитьПараметрыКомпонентыЭСФ
Функция ПолучитьПараметрыКомпонентыЭСФ(БИНОпции, КонтролироватьБИН = Ложь, БИНКонтроля = "" , ИспользоватьКлючАутентификации = Ложь, СтруктурнаяЕдиница = Неопределено) Экспорт
	Возврат ЭлектронноеВзаимодействиеССервисами.ПолучитьПараметрыКомпонентыЭСФ(БИНОпции, КонтролироватьБИН, БИНКонтроля, ИспользоватьКлючАутентификации, СтруктурнаяЕдиница);
КонецФункции //ПолучитьПараметрыКомпонентыЭСФ

// См. функцию ЭлектронноеВзаимодействиеССервисами.ОбработкаВызоваКомпоненты
Процедура ОбработкаВызоваКомпоненты(СтруктурнаяЕдиница, СлужебныеДанные) Экспорт
	ЭлектронноеВзаимодействиеССервисами.ОбработкаВызоваКомпоненты(СтруктурнаяЕдиница, СлужебныеДанные);
КонецПроцедуры //ОбработкаВызоваКомпоненты

#КонецОбласти

#КонецОбласти