
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметры,"ИтоговаяФункция,ИсключитьИзИтогов,ПризнакВнутригрупповогоОборота,РучнаяНастройкаИтоговПоГруппам");
	Элементы.ИсключитьИзИтогов.Видимость = НЕ РучнаяНастройкаИтоговПоГруппам;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("ИтоговаяФункция,ИсключитьИзИтогов,ПризнакВнутригрупповогоОборота",ИтоговаяФункция,ИсключитьИзИтогов,ПризнакВнутригрупповогоОборота));
КонецПроцедуры
