////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

Функция ПользовательИмеетУправленческиеРоли(Код) Экспорт
	
	ПользовательИБ = УправлениеПользователями.НайтиПользователяИБ(СокрЛП(Код));
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РолиУправленческогоУчета = Новый Массив;
	РолиУправленческогоУчета.Добавить(Метаданные.Роли.ПолныеПрава);
	РолиУправленческогоУчета.Добавить(Метаданные.Роли.КадровикУправленческихДанных);
	РолиУправленческогоУчета.Добавить(Метаданные.Роли.РасчетчикУправленческойЗарплаты);
	
	Для Каждого РольУправленческогоУчета Из РолиУправленческогоУчета Цикл
		Если ПользовательИБ.Роли.Содержит(РольУправленческогоУчета)	Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

// Проверка доступности роли "управленческого" кадровика
// это или КадровикУправленческихДанных или полные права
// Применяется для проверки прав на доступ к кадровым даннам, например, 
// в формах или при выводе на печать
// Возвращаемое значение:
//	булево - истина если есть доступ к "кадровым" данным
Функция ДоступнаРольКадровикаУпр() Экспорт
	
	Возврат РольДоступна("КадровикУправленческихДанных")
			ИЛИ РольДоступна("ПолныеПрава");
	
КонецФункции  //ДоступнаРольРасчетчика
		
////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы со справочником Пользователи

Процедура СформироватьСписокДоступныхВидовРабочегоСтола(СписокДоступныхВидовРабочегоСтола) Экспорт
	
	// В данной конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры


Процедура ДеревоНастроекПриНачалеРедактированияДополнительно(ТекущаяНастройка, ЭлементУправления, СписокДоступныхВидовРабочегоСтола) Экспорт
	
	// В данной конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ДополнитьСоответствиеЗначенийПоУмолчанию(ЗначенияПоУмолчанию) Экспорт
	
	ЗначенияПоУмолчанию.Вставить(ПланыВидовХарактеристик.НастройкиПользователей.ОткрыватьПриЗапускеПанельФункций, Истина);

КонецПроцедуры

Процедура ФормаПередЗаписьюДополнительно(ВидРабочегоСтола, ДеревоНастроек, Отказ) Экспорт
	
	ВидРабочегоСтола = Неопределено;
	
КонецПроцедуры

#Если ТолстыйКлиентОбычноеПриложение Тогда
			
Процедура ПрименитьНастройкиРабочегоСтола(ТекущаяФормаРабочегоСтола, ФормаНастроекПользователя) Экспорт

	//проверим необходимость закрытия рабочего стола
	ФормаРабочегоСтола = РабочийСтолПереопределяемый.ФормаРабочегоСтола(глЗначениеПеременной("глТекущийПользователь"));
	ИспользоватьРабочийСтол = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОткрыватьПриЗапускеПанельФункций");
	
	Если ФормаРабочегоСтола.Открыта() И НЕ ИспользоватьРабочийСтол Тогда
		// надо закрыть рабочий стол
		ОтветПользователя = Вопрос("Вы отключили использование ""Рабочего стола""." + Символы.ПС + "Закрыть сейчас ""Рабочий стол""?", РежимДиалогаВопрос.ДаНет);
		Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
			ФормаРабочегоСтола.Закрыть();
		КонецЕсли;
	ИначеЕсли ИспользоватьРабочийСтол И НЕ ФормаРабочегоСтола.Открыта() Тогда
		ФормаРабочегоСтола.Открыть();
		ФормаНастроекПользователя.Активизировать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ФормаПередОткрытиемДополнительно(ЭлементыФормы, ИсполняемыеФункцииВПредприятии, РазделятьЗадачиПоПодразделениям, РазделятьЗадачиПоРолямИсполнителей, ПользовательСсылка) Экспорт
	
	// В данной конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ФормаПриЗаписиДополнительно(ИсполняемыеФункцииВПредприятии, РазделятьЗадачиПоПодразделениям, РазделятьЗадачиПоРолямИсполнителей, ПользовательСсылка) Экспорт
	
	// В данной конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

#КонецЕсли

Процедура ДополнитьПараметрыОповещения(ПараметрыОповещения, ТекущийВидРабочегоСтола) Экспорт
	
	// В данной конфигурации дополнительных действие не предусмотрено
	
КонецПроцедуры

Функция РазделятьЗадачиПоПодразделениям() Экспорт
	
	// В данной конфигурации дополнительного разделения нет
	Возврат Ложь;	
	
КонецФункции

