#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ
//

Перем мПоддержкаРаботыСоСтруктурнымиПодразделениями;
Перем мСтруктураПредставлениеПолей;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция возвращает налогоплательщика, реквизиты которого необходимо выводить в шапке отчета
//
Функция ОпределитьОсновногоНалогоплательщика(ПервыйВыведенныйНалогоплательщик = Неопределено,
												ПерваяВыведеннаяОрганизация = Неопределено,
												ПерваяВыведеннаяСтруктурнаяЕдиница = Неопределено)

	Налогоплательщик = Неопределено;
	
	// сначала смотрим по отбору
	ОтборПоНалогоплательщику = ПостроительОтчета.Отбор.Найти("Налогоплательщик");
	Если ОтборПоНалогоплательщику <> Неопределено И ОтборПоНалогоплательщику.Использование Тогда
		Если ОтборПоНалогоплательщику.ВидСравнения = ВидСравнения.Равно
			Или ОтборПоНалогоплательщику.ВидСравнения = ВидСравнения.ВИерархии Тогда
			Налогоплательщик = ОтборПоНалогоплательщику.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Налогоплательщик) Тогда

		ОтборПоСтруктурнойЕдинице = ПостроительОтчета.Отбор.Найти("СтруктурнаяЕдиница");
		Если ОтборПоСтруктурнойЕдинице <> Неопределено И ОтборПоСтруктурнойЕдинице.Использование Тогда
			Если ОтборПоСтруктурнойЕдинице.ВидСравнения = ВидСравнения.Равно
					Или ОтборПоСтруктурнойЕдинице.ВидСравнения = ВидСравнения.ВИерархии Тогда
				СтруктурнаяЕдиница = ОтборПоСтруктурнойЕдинице.Значение;
				
				Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
					ОрганизацияСтруктурнойЕдиницы = СтруктурнаяЕдиница.Владелец;
				Иначе
					ОрганизацияСтруктурнойЕдиницы = СтруктурнаяЕдиница;
				КонецЕсли;

				Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(СтруктурнаяЕдиница, 
																										ОрганизацияСтруктурнойЕдиницы,
																										глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц"),
																										Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// далее смотрим по первым выведенным
	Если Не ЗначениеЗаполнено(Налогоплательщик) Тогда
		Если ЗначениеЗаполнено(ПервыйВыведенныйНалогоплательщик) Тогда
			Налогоплательщик = ПервыйВыведенныйНалогоплательщик;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Налогоплательщик) Тогда
		Если ЗначениеЗаполнено(ПерваяВыведеннаяОрганизация) Тогда
			Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ПерваяВыведеннаяОрганизация, 
																									ПерваяВыведеннаяОрганизация,
																									глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц"),
																									Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Налогоплательщик) Тогда
		Если ЗначениеЗаполнено(ПерваяВыведеннаяСтруктурнаяЕдиница) Тогда

			Если ТипЗнч(ПерваяВыведеннаяСтруктурнаяЕдиница) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				ОрганизацияСтруктурнойЕдиницы = ПерваяВыведеннаяСтруктурнаяЕдиница.Владелец;
			Иначе
				ОрганизацияСтруктурнойЕдиницы = ПерваяВыведеннаяСтруктурнаяЕдиница;
			КонецЕсли;

			Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ПерваяВыведеннаяСтруктурнаяЕдиница, 
																									ОрганизацияСтруктурнойЕдиницы,
																									глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц"),
																									Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
			
		КонецЕсли;
	КонецЕсли;

	// если ничего не нашли, то берем из настроек пользователя
	Если Не ЗначениеЗаполнено(Налогоплательщик) Тогда
		ОсновнаяОрганизацияПользователя = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),
																								"ОсновнаяОрганизация");
		
		Налогоплательщик = ПроцедурыНалоговогоУчета.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(ОсновнаяОрганизацияПользователя, 
																								ОсновнаяОрганизацияПользователя,
																								глЗначениеПеременной("глИсчислениеНалоговСтруктурныхЕдиниц"),
																								Перечисления.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты);
	КонецЕсли;

	Возврат Налогоплательщик;

КонецФункции // ОпределитьОсновногоНалогоплательщика

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет настройку отчета по умолчанию для заданного вида отчета
//
// Параметры: 
// 
Процедура ЗаполнитьНачальныеНастройки(ИзмененВидОтчета = Ложь) Экспорт
	
	Если ИзмененВидОтчета Тогда
		СохраненныеНастройкиПостроителя = ПостроительОтчета.ПолучитьНастройки();
	КонецЕсли;
	
	ЕстьДетализация = РежимФормированияОтчета = "Детальный";

	ТекстЗапроса = "
	|// календарь
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(РеглКалендарь.ДатаКалендаря, МЕСЯЦ) КАК НачМесяца,
	|	КОНЕЦПЕРИОДА(РеглКалендарь.ДатаКалендаря, МЕСЯЦ) КАК КонМесяца
	|
	|ПОМЕСТИТЬ ВТ_РеглКалендарь
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РеглКалендарь
	|
	|ГДЕ
	|	РеглКалендарь.ДатаКалендаря МЕЖДУ &ДатаНач И &ДатаКон
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КонМесяца
	|;
	|
	|//////////////////////////////////////////////////////////////
	|// ближайщие даты ставок
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеглКалендарь.НачМесяца,
	|	РеглКалендарь.КонМесяца,
	|	СведенияОСтавках.ВидНалога,
	|	СведенияОСтавках.Налогоплательщик,
	|	МАКСИМУМ(СведенияОСтавках.Период) КАК Период
	|
	|ПОМЕСТИТЬ ВТ_ПоследниеДатыСтавок
	|ИЗ
	|	ВТ_РеглКалендарь КАК РеглКалендарь
	|					
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СведенияОСтавках
	|		ПО СведенияОСтавках.Период <= РеглКалендарь.КонМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	РеглКалендарь.НачМесяца,
	|	РеглКалендарь.КонМесяца,
	|	СведенияОСтавках.ВидНалога,
	|	СведенияОСтавках.Налогоплательщик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ВидНалога,
	|	Налогоплательщик
	|;	
	|
	|//////////////////////////////////////////////////////////////
	|// размеры ставок
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоследниеДатыСтавок.НачМесяца,
	|	ПоследниеДатыСтавок.КонМесяца,
	|	ПоследниеДатыСтавок.ВидНалога КАК ВидНалога,
	|	ПоследниеДатыСтавок.Налогоплательщик КАК Налогоплательщик,
	|	СведенияОСтавках.Ставка
	|
	|ПОМЕСТИТЬ ВТ_СведенияОСтавках
	|ИЗ
	|	ВТ_ПоследниеДатыСтавок КАК ПоследниеДатыСтавок
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений КАК СведенияОСтавках
	|		ПО ПоследниеДатыСтавок.Налогоплательщик = СведенияОСтавках.Налогоплательщик
	|			И ПоследниеДатыСтавок.ВидНалога = СведенияОСтавках.ВидНалога
	|			И ПоследниеДатыСтавок.Период = СведенияОСтавках.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НачМесяца,
	|	КонМесяца,
	|	Налогоплательщик,
	|	ВидНалога
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетнаяПолитикаНУ.Организация,
	|	УчетнаяПолитикаНУ.ЗасчитыватьВВыплаченныеДоходыУдержанияПоИЛ
	|
	|ПОМЕСТИТЬ ВТ_УчетнаяПолитикаНУ
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаНалоговыйУчет.СрезПоследних(&ДатаНач) КАК УчетнаяПолитикаНУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|//////////////////////////////////////////////////////////////
	|// даты гражданства по месяцам
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеглКалендарь.НачМесяца КАК НачМесяца,
	|	ГражданствоФизЛиц.ФизЛицо КАК ФизЛицо,
	|	МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
	|
	|ПОМЕСТИТЬ ВТ_ПоследниеДатыГражданства
	|ИЗ
	|	ВТ_РеглКалендарь КАК РеглКалендарь
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО ГражданствоФизЛиц.Период <= РеглКалендарь.КонМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	РеглКалендарь.НачМесяца,
	|	ГражданствоФизЛиц.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Период
	|;	
	|
	|//////////////////////////////////////////////////////////////
	|// данные о гражданстве по месяцам
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоследниеДатыГражданства.НачМесяца,
	|	ПоследниеДатыГражданства.ФизЛицо,
	|	ГражданствоФизЛиц.Страна,
	|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию,
	|	ГражданствоФизЛиц.НеПодлежитСоциальномуСтрахованию,
	|	ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРК,
	|	ГражданствоФизЛиц.ИностранныйСпециалист,
	|	ГражданствоФизЛиц.НомерНалоговойРегистрацииВСтранеРезидентства
	|
	|ПОМЕСТИТЬ ВТ_ГражданствоФизЛиц
	|ИЗ
	|	ВТ_ПоследниеДатыГражданства КАК ПоследниеДатыГражданства
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО ПоследниеДатыГражданства.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
	|			И ПоследниеДатыГражданства.Период = ГражданствоФизЛиц.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПоследниеДатыГражданства.ФизЛицо,
	|	ПоследниеДатыГражданства.НачМесяца
	|;
	|
	|//////////////////////////////////////////////////////////////
	// -куфиб- начало
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		// Задолженность по доходам, невыплаченным физлицам, из текущих взаиморасчетов
	|		ВложенныйЗапрос.Налогоплательщик,
	|		ВложенныйЗапрос.СтруктурнаяЕдиница,
	|		ВложенныйЗапрос.Организация,
	|		ВложенныйЗапрос.ФизЛицо,
	|		ВложенныйЗапрос.Период КАК Период,
	|		ВложенныйЗапрос.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|		ВложенныйЗапрос.Регистратор КАК Регистратор,
	|		ВложенныйЗапрос.ВыплатыПоИЛ КАК ВыплатыПоИЛ,
	|
	|		ВложенныйЗапрос.СуммаДохода КАК СуммаДохода,
	|		ВложенныйЗапрос.НачисленоДоходов КАК НачисленоДоходов,
	|		ВложенныйЗапрос.ДоходыНеОблагаемыеИПН КАК ДоходыНеОблагаемыеИПН,
	|		ВложенныйЗапрос.ВыплатыНеОблагаемыеСН КАК ВыплатыНеОблагаемыеСН,
	|		ВложенныйЗапрос.ДоходКВыплате КАК ДоходКВыплате,
	|		ВложенныйЗапрос.ВыплаченоДоходов КАК ВыплаченоДоходов,
	|
	|		ВложенныйЗапрос.СуммаИПН КАК СуммаИПН,
	|		ВложенныйЗапрос.СуммаИПНПодлежащегоПеречислению КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВложенныйЗапрос.СуммаОПВ КАК СуммаОПВ,
	|		ВложенныйЗапрос.СуммаОПВПодлежащихПеречислению КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВложенныйЗапрос.СуммаОПВ КАК СуммаВОСМС,
	|		ВложенныйЗапрос.СуммаОПВПодлежащихПеречислению КАК СуммаВОСМСПодлежащихПеречислению
	|
	|ПОМЕСТИТЬ ВТ_Взаиморасчеты
	| ИЗ (
	|		ВЫБРАТЬ
	// -куфиб- конец
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|		// Задолженность по доходам, невыплаченным физлицам, из текущих взаиморасчетов
	|		ВзаиморасчетыСРаботниками.Налогоплательщик,
	|		ВзаиморасчетыСРаботниками.СтруктурнаяЕдиница,
	|		ВзаиморасчетыСРаботниками.Организация,
	|		ВзаиморасчетыСРаботниками.ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСРаботниками.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовОстаток КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|
//	|ПОМЕСТИТЬ ВТ_Взаиморасчеты
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Остатки(
	|					&ДатаНач,
	|					&УдельныйВес
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВзаиморасчетыСРаботниками
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// Задолженность по доходам, невыплаченным физлицам, из текущих взаиморасчетов
	|		ВзаиморасчетыСРаботниками.Налогоплательщик,
	|		ВзаиморасчетыСРаботниками.СтруктурнаяЕдиница,
	|		ВзаиморасчетыСРаботниками.Организация,
	|		ВзаиморасчетыСРаботниками.ФизЛицо,
	|		ВзаиморасчетыСРаботниками.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСРаботниками.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСРаботниками.СуммаВзаиморасчетовОборот КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.Обороты(
	|					&ДатаНач, 
	|					&ДатаКон, 
	|					МЕСЯЦ,
	|					&УдельныйВес
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВзаиморасчетыСРаботниками
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// Задолженность по доходам, невыплаченным физлицам, из депонированных сумм
	|		ВзаиморасчетыСДепонентами.Налогоплательщик,
	|		ВзаиморасчетыСДепонентами.СтруктурнаяЕдиница,
	|		ВзаиморасчетыСДепонентами.Организация,
	|		ВзаиморасчетыСДепонентами.ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСДепонентами.СуммаВзаиморасчетовОстаток КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Остатки(
	|					&ДатаНач,
	|					&УдельныйВес
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВзаиморасчетыСДепонентами
	|
	|	ОБЪЕДИНИТЬ ВСЕ	
	|
	|	ВЫБРАТЬ
	|		// Задолженность по доходам, невыплаченным физлицам, из депонированных сумм
	|		ВзаиморасчетыСДепонентами.Налогоплательщик,
	|		ВзаиморасчетыСДепонентами.СтруктурнаяЕдиница,
	|		ВзаиморасчетыСДепонентами.Организация,
	|		ВзаиморасчетыСДепонентами.ФизЛицо,
	|		ВзаиморасчетыСДепонентами.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСДепонентами.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСДепонентами.СуммаВзаиморасчетовОборот КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,	
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Обороты(
	|					&ДатаНач, 
	|					&ДатаКон, 
	|					МЕСЯЦ,
	|					&УдельныйВес
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВзаиморасчетыСДепонентами
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// Задолженность по доходам, невыплаченным физлицам, из оплаты по актам закупа
	|		ВзаиморасчетыСКонтрагентами.Налогоплательщик,
	|		ВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|		ВзаиморасчетыСКонтрагентами.Организация,	
	|		ВзаиморасчетыСКонтрагентами.Контрагент КАК ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентами.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетовОстаток КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыОрганизацийСКонтрагентамиФизЛицами.Остатки(
	|					&ДатаНач,
	|					&УдельныйВес
	|					И ВЫБОР
	|						КОГДА &ВключитьИП
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ НЕ Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|					КОНЕЦ
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, Контрагент.* КАК ФизЛицо}) КАК ВзаиморасчетыСКонтрагентами
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// Задолженность по доходам, невыплаченным физлицам, из оплаты по актам закупа
	|		ВзаиморасчетыСКонтрагентами.Налогоплательщик,
	|		ВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|		ВзаиморасчетыСКонтрагентами.Организация,	
	|		ВзаиморасчетыСКонтрагентами.Контрагент КАК ФизЛицо,
	|		ВзаиморасчетыСКонтрагентами.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСКонтрагентами.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСКонтрагентами.СуммаВзаиморасчетовОборот КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыОрганизацийСКонтрагентамиФизЛицами.Обороты(
	|					&ДатаНач, 
	|					&ДатаКон,
	|					МЕСЯЦ,
	|					&УдельныйВес
	|					И ВЫБОР
	|						КОГДА &ВключитьИП
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ НЕ Контрагент.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|					КОНЕЦ
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, Контрагент.* КАК ФизЛицо}) КАК ВзаиморасчетыСКонтрагентами
	|
	|   ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// выплата по исполнительным листам для алименщика
	|   	ВзаиморасчетыСПолучателямиИЛ.Налогоплательщик,
	|   	ВзаиморасчетыСПолучателямиИЛ.СтруктурнаяЕдиница,
	|   	ВзаиморасчетыСПолучателямиИЛ.Организация,
	|		ВзаиморасчетыСПолучателямиИЛ.ДокументОснование.ФизЛицо КАК ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСПолучателямиИЛ.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовОстаток + ВзаиморасчетыСПолучателямиИЛ.СуммаСборовОстаток КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыОрганизацийСПолучателямиИЛ.Остатки(
	|					&ДатаНач,
	|					&УдельныйВес
	|					// Если включаем суммы удержаний по исполнительным листам по фактическому перечислению,
	|					// иначе удержания по ИЛ уже находятся в регистр накопления ВыплаченныеДоходыРаботникамОрганизацийНУ
	|					И Организация НЕ В (ВЫБРАТЬ
	|											УчетнаяПолитикаНУ.Организация
	|										ИЗ
	|											ВТ_УчетнаяПолитикаНУ КАК УчетнаяПолитикаНУ
	|										ГДЕ
	|											УчетнаяПолитикаНУ.ЗасчитыватьВВыплаченныеДоходыУдержанияПоИЛ)
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ДокументОснование.ФизЛицо.* КАК ФизЛицо}) КАК ВзаиморасчетыСПолучателямиИЛ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// выплата по исполнительным листам для алименщика
	|   	ВзаиморасчетыСПолучателямиИЛ.Налогоплательщик,
	|   	ВзаиморасчетыСПолучателямиИЛ.СтруктурнаяЕдиница,
	|   	ВзаиморасчетыСПолучателямиИЛ.Организация,
	|		ВзаиморасчетыСПолучателямиИЛ.ДокументОснование.ФизЛицо КАК ФизЛицо,
	|		ВзаиморасчетыСПолучателямиИЛ.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСПолучателямиИЛ.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		" + ?(ЕстьДетализация, "ВзаиморасчетыСПолучателямиИЛ.Регистратор", "NULL") + " КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовОборот + ВзаиморасчетыСПолучателямиИЛ.СуммаСборовОборот КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовРасход + ВзаиморасчетыСПолучателямиИЛ.СуммаСборовРасход КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыОрганизацийСПолучателямиИЛ.Обороты(
	|					&ДатаНач, 
	|					&ДатаКон, 
	|					" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",
	|					(&УдельныйВес ИЛИ &ВыплаченоДоходов)
	|					// Если включаем суммы удержаний по исполнительным листам по фактическому перечислению,
	|					// иначе удержания по ИЛ уже находятся в регистр накопления ВыплаченныеДоходыРаботникамОрганизацийНУ
	|					И Организация НЕ В (ВЫБРАТЬ
	|											УчетнаяПолитикаНУ.Организация
	|										ИЗ
	|											ВТ_УчетнаяПолитикаНУ КАК УчетнаяПолитикаНУ
	|										ГДЕ
	|											УчетнаяПолитикаНУ.ЗасчитыватьВВыплаченныеДоходыУдержанияПоИЛ)
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ДокументОснование.ФизЛицо.* КАК ФизЛицо}) КАК ВзаиморасчетыСПолучателямиИЛ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// выплата по исполнительным листам получателям сумм
	|   	ВзаиморасчетыСПолучателямиИЛ.Налогоплательщик,
	|   	ВзаиморасчетыСПолучателямиИЛ.СтруктурнаяЕдиница,
	|   	ВзаиморасчетыСПолучателямиИЛ.Организация,
	|		ВзаиморасчетыСПолучателямиИЛ.Получатель КАК ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСПолучателямиИЛ.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ИСТИНА КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовОстаток КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыОрганизацийСПолучателямиИЛ.Остатки(
	|				&ДатаНач,
	|				&УдельныйВес
	|				И &ВключитьПолучателейАлиментов
	|				И Получатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, Получатель.* КАК ФизЛицо}) КАК ВзаиморасчетыСПолучателямиИЛ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// выплата по исполнительным листам получателям сумм
	|   	ВзаиморасчетыСПолучателямиИЛ.Налогоплательщик,
	|   	ВзаиморасчетыСПолучателямиИЛ.СтруктурнаяЕдиница,
	|   	ВзаиморасчетыСПолучателямиИЛ.Организация,
	|		ВзаиморасчетыСПолучателямиИЛ.Получатель КАК ФизЛицо,
	|		ВзаиморасчетыСПолучателямиИЛ.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВзаиморасчетыСПолучателямиИЛ.ПериодВзаиморасчетов, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		" + ?(ЕстьДетализация, "ВзаиморасчетыСПолучателямиИЛ.Регистратор", "NULL") + " КАК Регистратор,
	|		ИСТИНА КАК ВыплатыПоИЛ,
	|
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовОборот КАК СуммаДохода,
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовПриход КАК НачисленоДоходов,
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовПриход КАК ДоходыНеОблагаемыеИПН,
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовПриход КАК ВыплатыНеОблагаемыеСН,
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовПриход КАК ДоходКВыплате,
	|		ВзаиморасчетыСПолучателямиИЛ.СуммаВзаиморасчетовРасход КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыОрганизацийСПолучателямиИЛ.Обороты(
	|				&ДатаНач, 
	|				&ДатаКон,
	|				" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",
	|				(&УдельныйВес ИЛИ &НачисленоДоходов ИЛИ &ДоходыНеОблагаемыеИПН ИЛИ &ВыплатыНеОблагаемыеСН ИЛИ &ВыплаченоДоходов)
	|				И &ВключитьПолучателейАлиментов
	|				И Получатель.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, Получатель.* КАК ФизЛицо}) КАК ВзаиморасчетыСПолучателямиИЛ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ИПН
	|		ИПНРасчетыСБюджетом.Налогоплательщик,
	|		ИПНРасчетыСБюджетом.СтруктурнаяЕдиница,
	|		ИПНРасчетыСБюджетом.Организация,
	|		ИПНРасчетыСБюджетом.ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, ДЕНЬ, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ИПНРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ИПНРасчетыСБюджетом.НалогОстаток КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ИПНРасчетыСБюджетом.Остатки(
	|					&ДатаНач,
	|					&УдельныйВес
	|					И ВЫБОР
	|					КОГДА &ВключитьИП
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВЫБОР
	|								КОГДА ФизЛицо ССЫЛКА Справочник.Контрагенты
	|								ТОГДА НЕ ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|	 			    КОНЕЦ
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ИПНРасчетыСБюджетом
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ИПН
	|		ИПНРасчетыСБюджетом.Налогоплательщик КАК Налогоплательщик,
	|		ИПНРасчетыСБюджетом.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ИПНРасчетыСБюджетом.Организация,
	|		ИПНРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
	|		ИПНРасчетыСБюджетом.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ИПНРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		СУММА(ВЫБОР
	|				КОГДА ИПНРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ИПНРасчетыСБюджетом.Налог
	|				ИНАЧЕ - ИПНРасчетыСБюджетом.Налог
	|			  КОНЕЦ) КАК СуммаИПН,
	|		СУММА(ВЫБОР
	|				КОГДА ИПНРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И ИПНРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Удержание)
	|					ТОГДА ИПНРасчетыСБюджетом.Налог
	|				ИНАЧЕ 0
	|			  КОНЕЦ) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ИПНРасчетыСБюджетом КАК ИПНРасчетыСБюджетом
	|	ГДЕ
	|		ИПНРасчетыСБюджетом.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		И &УдельныйВес
	|		И ВЫБОР
	|			КОГДА &ВключитьИП
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|						КОГДА ИПНРасчетыСБюджетом.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|						ТОГДА НЕ ИПНРасчетыСБюджетом.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|	  	   КОНЕЦ
	|	{ГДЕ
	|		Налогоплательщик.* КАК Налогоплательщик,
	|		СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|		ФизЛицо.* КАК ФизЛицо}
	|	СГРУППИРОВАТЬ ПО
	|		ИПНРасчетыСБюджетом.Налогоплательщик,
	|		ИПНРасчетыСБюджетом.СтруктурнаяЕдиница,
	|		ИПНРасчетыСБюджетом.Организация,
	|		ИПНРасчетыСБюджетом.ФизЛицо,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ИПНРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ),", "") + "
	|		ИПНРасчетыСБюджетом.Период
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ОПВ, подлежащим перечислению
	|		ОПВРасчетыСФондами.Налогоплательщик,
	|		ОПВРасчетыСФондами.СтруктурнаяЕдиница,
	|		ОПВРасчетыСФондами.Организация,
	|		ОПВРасчетыСФондами.ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОПВРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ОПВРасчетыСФондами.ВзносОстаток КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ОПВРасчетыСФондами.Остатки(
	|					&ДатаНач, 
	|					&УдельныйВес 
	|					И ВидПлатежа В (&парамВидыПлатежей)
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ОПВРасчетыСФондами
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ОПВ, подлежащим перечислению
	|		ОПВРасчетыСФондами.Налогоплательщик,
	|		ОПВРасчетыСФондами.СтруктурнаяЕдиница,
	|		ОПВРасчетыСФондами.Организация,
	|		ОПВРасчетыСФондами.ФизЛицо,
	|		ОПВРасчетыСФондами.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОПВРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ОПВРасчетыСФондами.ВзносОборот КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ОПВРасчетыСФондами.Обороты(
	|				&ДатаНач, 
	|				&ДатаКон, 
	|				МЕСЯЦ, 
	|				&УдельныйВес 
	|				И ВидПлатежа В (&парамВидыПлатежей)
	|				{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ОПВРасчетыСФондами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ОПВ, подлежащим перечислению
	|		ОПВПодлежитПеречислению.Налогоплательщик,
	|		ОПВПодлежитПеречислению.СтруктурнаяЕдиница,
	|		ОПВПодлежитПеречислению.Организация,
	|		ОПВПодлежитПеречислению.ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОПВПодлежитПеречислению.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|		
	|       - ОПВПодлежитПеречислению.ВзносОстаток КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ОПВПодлежитПеречислениюВФонды.Остатки(
	|					&ДатаНач,
	|					&УдельныйВес
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ОПВПодлежитПеречислению
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ОПВ, подлежащим перечислению
	|		ОПВПодлежитПеречислению.Налогоплательщик КАК Налогоплательщик,
	|		ОПВПодлежитПеречислению.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ОПВПодлежитПеречислению.Организация,
	|		ОПВПодлежитПеречислению.ФизЛицо КАК ФизЛицо,
	|		ОПВПодлежитПеречислению.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОПВПодлежитПеречислению.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|		
	|       - СУММА(ВЫБОР
	|					КОГДА ОПВПодлежитПеречислению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА ОПВПодлежитПеречислению.Взнос 
	|					ИНАЧЕ - ОПВПодлежитПеречислению.Взнос 
	|				КОНЕЦ) КАК СуммаОПВ,
	|		СУММА(ВЫБОР
	|				КОГДА ОПВПодлежитПеречислению.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Удержание)
	|						И ОПВПодлежитПеречислению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ОПВПодлежитПеречислению.Взнос
	|				ИНАЧЕ 0
	|			  КОНЕЦ) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ОПВПодлежитПеречислениюВФонды КАК ОПВПодлежитПеречислению
	|	ГДЕ
	|		ОПВПодлежитПеречислению.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		И &УдельныйВес
	|	{ГДЕ
	|		Налогоплательщик.* КАК Налогоплательщик,
	|		СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|		ФизЛицо.* КАК ФизЛицо}
	|	СГРУППИРОВАТЬ ПО
	|		ОПВПодлежитПеречислению.Налогоплательщик,
	|		ОПВПодлежитПеречислению.СтруктурнаяЕдиница,
	|		ОПВПодлежитПеречислению.Организация,
	|		ОПВПодлежитПеречислению.ФизЛицо,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОПВПодлежитПеречислению.МесяцНалоговогоПериода, МЕСЯЦ),", "") + "
	|		ОПВПодлежитПеречислению.Период	
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ВОСМС, подлежащим перечислению
	|		ВОСМСРасчетыСФондами.Налогоплательщик,
	|		ВОСМСРасчетыСФондами.СтруктурнаяЕдиница,
	|		ВОСМСРасчетыСФондами.Организация,
	|		ВОСМСРасчетыСФондами.ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВОСМСРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВОСМСРасчетыСФондами.ВзносОстаток КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВОСМСРасчетыСФондами.Остатки(
	|					&ДатаНач, 
	|					&УдельныйВес 
	|					И ВидПлатежа В (&парамВидыПлатежей)
	|					И ВЫБОР
	|						КОГДА &ВключитьИП
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ФизЛицо ССЫЛКА Справочник.Контрагенты
	|									ТОГДА НЕ ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|					КОНЕЦ
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВОСМСРасчетыСФондами
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ВОСМС, подлежащим перечислению
	|		ВОСМСРасчетыСФондами.Налогоплательщик,
	|		ВОСМСРасчетыСФондами.СтруктурнаяЕдиница,
	|		ВОСМСРасчетыСФондами.Организация,
	|		ВОСМСРасчетыСФондами.ФизЛицо,
	|		ВОСМСРасчетыСФондами.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВОСМСРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		ВОСМСРасчетыСФондами.ВзносОборот КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВОСМСРасчетыСФондами.Обороты(
	|				&ДатаНач, 
	|				&ДатаКон, 
	|				МЕСЯЦ, 
	|				&УдельныйВес 
	|				И ВидПлатежа В (&парамВидыПлатежей)
	|				И ВЫБОР
	|					КОГДА &ВключитьИП
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ФизЛицо ССЫЛКА Справочник.Контрагенты
	|								ТОГДА НЕ ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|				КОНЕЦ
	|				{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВОСМСРасчетыСФондами
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ВОСМС, подлежащим перечислению
	|		ВОСМСПодлежитПеречислениюВФонды.Налогоплательщик,
	|		ВОСМСПодлежитПеречислениюВФонды.СтруктурнаяЕдиница,
	|		ВОСМСПодлежитПеречислениюВФонды.Организация,
	|		ВОСМСПодлежитПеречислениюВФонды.ФизЛицо,
	|		ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1) КАК Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВОСМСПодлежитПеречислениюВФонды.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|		
	|       ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		 - ВОСМСПодлежитПеречислениюВФонды.ВзносОстаток  КАК СуммаВОСМС,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВОСМСПодлежитПеречислениюВФонды.Остатки(
	|					&ДатаНач,
	|					&УдельныйВес
	|					И ВЫБОР
	|						КОГДА &ВключитьИП
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ФизЛицо ССЫЛКА Справочник.Контрагенты
	|									ТОГДА НЕ ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|					КОНЕЦ
	|					{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВОСМСПодлежитПеречислениюВФонды
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		// остатки по ВОСМС, подлежащим перечислению
	|		ВОСМСПодлежитПеречислениюВФонды.Налогоплательщик КАК Налогоплательщик,
	|		ВОСМСПодлежитПеречислениюВФонды.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ВОСМСПодлежитПеречислениюВФонды.Организация,
	|		ВОСМСПодлежитПеречислениюВФонды.ФизЛицо КАК ФизЛицо,
	|		ВОСМСПодлежитПеречислениюВФонды.Период,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВОСМСПодлежитПеречислениюВФонды.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|		NULL КАК Регистратор,
	|		ЛОЖЬ КАК ВыплатыПоИЛ,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаДохода,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПН,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|		
	|       ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВ,
	|		ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		 - СУММА(ВЫБОР
	|					КОГДА ВОСМСПодлежитПеречислениюВФонды.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА ВОСМСПодлежитПеречислениюВФонды.Взнос 
	|					ИНАЧЕ - ВОСМСПодлежитПеречислениюВФонды.Взнос 
	|				КОНЕЦ) КАК СуммаВОСМС,
	|		СУММА(ВЫБОР
	|				КОГДА ВОСМСПодлежитПеречислениюВФонды.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Удержание)
	|						И ВОСМСПодлежитПеречислениюВФонды.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА ВОСМСПодлежитПеречислениюВФонды.Взнос
	|				ИНАЧЕ 0
	|			  КОНЕЦ) КАК СуммаВОСМСПодлежащихПеречислению
	|	ИЗ
	|		РегистрНакопления.ВОСМСПодлежитПеречислениюВФонды КАК ВОСМСПодлежитПеречислениюВФонды
	|	ГДЕ
	|		ВОСМСПодлежитПеречислениюВФонды.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		И &УдельныйВес
	|		И ВЫБОР
	|				КОГДА &ВключитьИП
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВОСМСПодлежитПеречислениюВФонды.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|							ТОГДА НЕ ВОСМСПодлежитПеречислениюВФонды.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			КОНЕЦ
	|	{ГДЕ
	|		Налогоплательщик.* КАК Налогоплательщик,
	|		СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|		ФизЛицо.* КАК ФизЛицо}
	|	СГРУППИРОВАТЬ ПО
	|		ВОСМСПодлежитПеречислениюВФонды.Налогоплательщик,
	|		ВОСМСПодлежитПеречислениюВФонды.СтруктурнаяЕдиница,
	|		ВОСМСПодлежитПеречислениюВФонды.Организация,
	|		ВОСМСПодлежитПеречислениюВФонды.ФизЛицо,
	|		" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВОСМСПодлежитПеречислениюВФонды.МесяцНалоговогоПериода, МЕСЯЦ),", "") + "
	|		ВОСМСПодлежитПеречислениюВФонды.Период
	// -куфиб- начало
	|) КАК ВложенныйЗапрос
	// -куфиб- конец
	|;
	|
	|//////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|		// Задолженность по доходам, невыплаченным физлицам, из текущих взаиморасчетов
	|		Взаиморасчеты.Налогоплательщик,
	|		Взаиморасчеты.СтруктурнаяЕдиница,
	|		Взаиморасчеты.Организация,
	|		Взаиморасчеты.ФизЛицо,
	|		Взаиморасчеты.Период,
	|		Взаиморасчеты.ПериодВзаиморасчетов,
	|		Взаиморасчеты.Регистратор,
	|		Взаиморасчеты.ВыплатыПоИЛ,
	|
	|		СУММА(Взаиморасчеты.СуммаДохода) КАК СуммаДохода,
	|		СУММА(Взаиморасчеты.НачисленоДоходов) КАК НачисленоДоходов,
	|		СУММА(Взаиморасчеты.ДоходыНеОблагаемыеИПН) КАК ДоходыНеОблагаемыеИПН,
	|		СУММА(Взаиморасчеты.ВыплатыНеОблагаемыеСН) КАК ВыплатыНеОблагаемыеСН,
	|		СУММА(Взаиморасчеты.ДоходКВыплате) КАК ДоходКВыплате,
	|		СУММА(Взаиморасчеты.ВыплаченоДоходов) КАК ВыплаченоДоходов,
	|
	|		СУММА(Взаиморасчеты.СуммаИПН) КАК СуммаИПН,
	|		СУММА(Взаиморасчеты.СуммаИПНПодлежащегоПеречислению) КАК СуммаИПНПодлежащегоПеречислению,
	|
	|		СУММА(Взаиморасчеты.СуммаОПВ) КАК СуммаОПВ,
	|		СУММА(Взаиморасчеты.СуммаОПВПодлежащихПеречислению) КАК СуммаОПВПодлежащихПеречислению,
	|
	|		СУММА(Взаиморасчеты.СуммаВОСМС) КАК СуммаВОСМС,
	|		СУММА(Взаиморасчеты.СуммаВОСМСПодлежащихПеречислению) КАК СуммаВОСМСПодлежащихПеречислению
	|
	|	ПОМЕСТИТЬ ВТ_СгруппированныеВзаиморасчеты
	|	ИЗ
	|		ВТ_Взаиморасчеты КАК Взаиморасчеты
	|
	|	СГРУППИРОВАТЬ ПО
	|		Взаиморасчеты.Налогоплательщик,
	|		Взаиморасчеты.СтруктурнаяЕдиница,
	|		Взаиморасчеты.Организация,
	|		Взаиморасчеты.ФизЛицо,
	|		Взаиморасчеты.Период,
	|		Взаиморасчеты.ПериодВзаиморасчетов,
	|		Взаиморасчеты.Регистратор,
	|		Взаиморасчеты.ВыплатыПоИЛ	
	|
	|	ИНДЕКСИРОВАТЬ ПО
	|		Период
	|;
	|
	|//////////////////////////////////////////////////////////////
	|// Начисленные, необлагаемые ИПН доходы, облагаемые ИПН доходы
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИПНСведенияОДоходах.Налогоплательщик КАК Налогоплательщик,
	|	ИПНСведенияОДоходах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ИПНСведенияОДоходах.Организация,
	|	ИПНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ИПНСведенияОДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ИПНСведенияОДоходах.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ИПНСведенияОДоходах.Период, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ИПНСведенияОДоходах.СуммаДоходаОборот КАК НачисленоДоходов,
	|	ИПНСведенияОДоходах.ПримененныйВычетОборот КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫБОР
	|		КОГДА ИПНСведенияОДоходах.ВидРасчета = ЗНАЧЕНИЕ(Справочник.ВычетыИПН.ПогашениеВознагражденияПоЖилищнымЗаймам)
	|			ТОГДА ИПНСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ПогашениеЖилищныхЗаймов,
	|	ВЫБОР
	|		КОГДА ИПНСведенияОДоходах.ВидРасчета = ЗНАЧЕНИЕ(Справочник.ВычетыИПН.СтраховыеПремииПоДоговорамНакопительногоСтрахования)
	|			ТОГДА ИПНСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СтраховыеПремии,
	|	ИПНСведенияОДоходах.ПримененнаяЛьготаОборот КАК Льгота,
	|	ВЫБОР 
	|		// для ИП, адвокатов и частных нотариусов как необлагаемые доходы не показываем
	|		КОГДА ИПНСведенияОДоходах.ФизЛицо ССЫЛКА Справочник.Контрагенты 
	|				И ИПНСведенияОДоходах.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) 
	|		КОГДА ИПНСведенияОДоходах.СпособНалогообложения = ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ИПНСведенияОДоходах.СуммаДоходаОборот
	|		КОГДА НЕ(ИПНСведенияОДоходах.ВидРасчета ССЫЛКА Справочник.ВычетыИПН)
	|			ТОГДА ИПНСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ДоходыНеОблагаемыеИПН,
	|	ВЫБОР 
	|		// для ИП, адвокатов и частных нотариусов как облагаемые доходы не показываем
	|		КОГДА ИПНСведенияОДоходах.ФизЛицо ССЫЛКА Справочник.Контрагенты 
	|				И ИПНСведенияОДоходах.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) 
	|		КОГДА ИПНСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|               И ИПНСведенияОДоходах.ВидРасчета <> ЗНАЧЕНИЕ(Справочник.ВычетыИПН.ПогашениеВознагражденияПоЖилищнымЗаймам)
	|			ТОГДА ИПНСведенияОДоходах.СуммаДоходаОборот - ИПНСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ДоходыОблагаемыеИПН,
	|	ВЫБОР 
	|		// для ИП, адвокатов и частных нотариусов как облагаемые доходы не показываем
	|		КОГДА ИПНСведенияОДоходах.ФизЛицо ССЫЛКА Справочник.Контрагенты 
	|				И ИПНСведенияОДоходах.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) 
	|		КОГДА ИПНСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ИПНСведенияОДоходах.СуммаДоходаОборот - ИПНСведенияОДоходах.СуммаВычетаОборот - (ИПНСведенияОДоходах.ПримененнаяЛьготаОборот + ИПНСведенияОДоходах.ПримененныйВычетОборот)
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫБОР 
	|		КОГДА ИПНСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ИПНСведенияОДоходах.ОблагаемаяБазаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ИПНСведенияОДоходах.СуммаДоходаОборот КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрНакопления.ИПНСведенияОДоходах.Обороты(
	|			&ДатаНач, 
	|			&ДатаКон, 
	|			" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",  
	|			(&НачисленоДоходов ИЛИ &НалоговыеВычеты ИЛИ &ПогашениеЖилищныхЗаймов ИЛИ &СтраховыеПремии ИЛИ &Льгота
	|					ИЛИ &ДоходыНеОблагаемыеИПН ИЛИ &ДоходыОблагаемыеИПН ИЛИ &ДоходыОблагаемыеИПНРасчет ИЛИ &УдельныйВес)
	|			И ВЫБОР
	|				КОГДА &ВключитьИП
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|							КОГДА ФизЛицо ССЫЛКА Справочник.Контрагенты
	|							ТОГДА НЕ ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|							ИНАЧЕ ИСТИНА
	|	 				КОНЕЦ
	|			КОНЕЦ
	|			{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ИПНСведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// налоговые взносы, доходы не облагаемые ИПН, доходы облагаемые ИПН, ИПН
	|ВЫБРАТЬ
	|	ИПНРасчетыСБюджетом.Налогоплательщик КАК Налогоплательщик,
	|	ИПНРасчетыСБюджетом.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ИПНРасчетыСБюджетом.Организация,
	|	ИПНРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ИПНРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ИПНРасчетыСБюджетом.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ИПНРасчетыСБюджетом.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ИПНРасчетыСБюджетом.Налог КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	- ИПНРасчетыСБюджетом.Налог КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.ИПНРасчетыСБюджетом КАК ИПНРасчетыСБюджетом
	|
	|ГДЕ
	|	ИПНРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон
	|	И ИПНРасчетыСБюджетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ИПНРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
	|	И (&ИндивидуальныйПодоходныйНалог ИЛИ &УдельныйВес)
	|	И ВЫБОР
	|		КОГДА &ВключитьИП
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ВЫБОР
	|					КОГДА ИПНРасчетыСБюджетом.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|					ТОГДА НЕ ИПНРасчетыСБюджетом.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|	  КОНЕЦ
	|{ГДЕ
	|	ИПНРасчетыСБюджетом.Налогоплательщик.* КАК Налогоплательщик,
	|	ИПНРасчетыСБюджетом.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ИПНРасчетыСБюджетом.ФизЛицо.* КАК ФизЛицо}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// доходы, облагаемые ОПВ и облагаемая база ОПВ
	|ВЫБРАТЬ 
	|	ОПВСведенияОДоходах.Налогоплательщик КАК Налогоплательщик,
	|	ОПВСведенияОДоходах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОПВСведенияОДоходах.Организация,
	|	ОПВСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ОПВСведенияОДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ОПВСведенияОДоходах.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОПВСведенияОДоходах.Период, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫБОР 
	|		КОГДА ОПВСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ОПВСведенияОДоходах.СуммаДоходаОборот - ОПВСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ДоходыОблагаемыеОПВ,
	|	ВЫБОР 
	|		КОГДА ОПВСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ОПВСведенияОДоходах.ОблагаемаяБазаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|
	|ИЗ
	|	РегистрНакопления.ОПВСведенияОДоходах.Обороты(
	|			&ДатаНач, 
	|			&ДатаКон, 
	|			" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",  
	|			(&ДоходыОблагаемыеОПВ ИЛИ &ОбъектИсчисленияОПВ)
	|			{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ОПВСведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ОПВ
	|ВЫБРАТЬ
	|	ОПВРасчетыСФондами.Налогоплательщик КАК Налогоплательщик,
	|	ОПВРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОПВРасчетыСФондами.Организация,
	|	ОПВРасчетыСФондами.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ОПВРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ОПВРасчетыСФондами.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОПВРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ОПВРасчетыСФондами.Взнос КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	- ОПВРасчетыСФондами.Взнос КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	- ОПВРасчетыСФондами.Взнос КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	- ОПВРасчетыСФондами.Взнос КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	- ОПВРасчетыСФондами.Взнос	 КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.ОПВРасчетыСФондами КАК ОПВРасчетыСФондами
	|
	|ГДЕ
	|	ОПВРасчетыСФондами.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон
	|	И ОПВРасчетыСФондами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ОПВРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)
	|	И ОПВРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
	|	И (&ОбязательныеПенсионныеВзносы ИЛИ &ВыплатыОблагаемыеСН ИЛИ &ДоходыОблагаемыеИПНРасчет ИЛИ &ДоходыОблагаемыеСО ИЛИ &УдельныйВес)
	|{ГДЕ
	|	ОПВРасчетыСФондами.Налогоплательщик.* КАК Налогоплательщик,
	|	ОПВРасчетыСФондами.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ОПВРасчетыСФондами.ФизЛицо.* КАК ФизЛицо}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// доходы, облагаемые и необлагаемые СН
	|ВЫБРАТЬ
	|	СНСведенияОДоходах.Налогоплательщик КАК Налогоплательщик,
	|	СНСведенияОДоходах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СНСведенияОДоходах.Организация,
	|	СНСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СНСведенияОДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "СНСведенияОДоходах.Регистратор", "NULL") + " КАК Регистратор,
	|	NULL КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫБОР
	|		КОГДА СНСведенияОДоходах.СпособНалогообложения = ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом) 
	|			ТОГДА СНСведенияОДоходах.СуммаДоходаОборот
	|		ИНАЧЕ СНСведенияОДоходах.СуммаВычетаОборот
	|	КОНЕЦ КАК ВыплатыНеОблагаемыеСН,
	|	ВЫБОР
	|		КОГДА СНСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА СНСведенияОДоходах.СуммаДоходаОборот - СНСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ВыплатыОблагаемыеСН,
	|	ВЫБОР
	|		КОГДА СНСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА СНСведенияОДоходах.ОблагаемаяБазаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.СНСведенияОДоходах.Обороты(
	|				&ДатаНач, 
	|				&ДатаКон, 
	|				" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",
	|				(&ВыплатыНеОблагаемыеСН ИЛИ &ВыплатыОблагаемыеСН ИЛИ &ОбъектИсчисленияСН)
	|				{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо})  КАК СНСведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// социальный налог
	|ВЫБРАТЬ
	|	СНИсчисленный.Налогоплательщик КАК Налогоплательщик,
	|	СНИсчисленный.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СНИсчисленный.Организация,
	|	СНИсчисленный.ФизЛицо КАК Физлицо,
	|	НАЧАЛОПЕРИОДА(СНИсчисленный.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "СНИсчисленный.Регистратор", "NULL") + " КАК Регистратор,
	|	NULL КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,	
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	СНИсчисленный.Налог КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.СНИсчисленный КАК СНИсчисленный 
	|
	|ГДЕ
	|	СНИсчисленный.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон 
	|	И (&СоциальныйНалог)
	|{ГДЕ
	|	СНИсчисленный.Налогоплательщик.* КАК Налогоплательщик,
	|	СНИсчисленный.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	СНИсчисленный.ФизЛицо.* КАК ФизЛицо}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// доходы, облагаемые социальными отчислениями и облагаемая база социальных отчислений
	|ВЫБРАТЬ 
	|	СОСведенияОДоходах.Налогоплательщик КАК Налогоплательщик,
	|	СОСведенияОДоходах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СОСведенияОДоходах.Организация,
	|	СОСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СОСведенияОДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "СОСведенияОДоходах.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(СОСведенияОДоходах.Период, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫБОР 
	|		КОГДА СОСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА СОСведенияОДоходах.СуммаДоходаОборот - СОСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ДоходыОблагаемыеСО,
	|	ВЫБОР 
	|		КОГДА СОСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА СОСведенияОДоходах.ОблагаемаяБазаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|
	|ИЗ
	|	РегистрНакопления.СОСведенияОДоходах.Обороты(
	|			&ДатаНач, 
	|			&ДатаКон, 
	|			" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",  
	|			(&ДоходыОблагаемыеСО ИЛИ &ОбъектИсчисленияСО)
	|			{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК СОСведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|// социальные отчисления
	|ВЫБРАТЬ
	|	СОРасчетыСФондами.Налогоплательщик КАК Налогоплательщик,
	|	СОРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СОРасчетыСФондами.Организация,
	|	СОРасчетыСФондами.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(СОРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "СОРасчетыСФондами.Регистратор", "NULL") + " КАК Регистратор,
	|	NULL КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	СОРасчетыСФондами.Отчисление КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.СОРасчетыСФондами КАК СОРасчетыСФондами
	|
	|ГДЕ
	|	СОРасчетыСФондами.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон
	|	И СОРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)
	|	И СОРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
	|	И (&СоциальныеОтчисления)
	|{ГДЕ
	|	СОРасчетыСФондами.Налогоплательщик.* КАК Налогоплательщик,
	|	СОРасчетыСФондами.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	СОРасчетыСФондами.ФизЛицо.* КАК ФизЛицо}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|// доходы, облагаемые ОППВ и облагаемая база ОППВ
	|ВЫБРАТЬ 
	|	ОППВСведенияОДоходах.Налогоплательщик КАК Налогоплательщик,
	|	ОППВСведенияОДоходах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОППВСведенияОДоходах.Организация,
	|	ОППВСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ОППВСведенияОДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ОППВСведенияОДоходах.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ОППВСведенияОДоходах.Период, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫБОР 
	|		КОГДА ОППВСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ОППВСведенияОДоходах.СуммаДоходаОборот - ОППВСведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ДоходыОблагаемыеОППВ,
	|	ВЫБОР 
	|		КОГДА ОППВСведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ОППВСведенияОДоходах.ОблагаемаяБазаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|
	|ИЗ
	|	РегистрНакопления.ОППВСведенияОДоходах.Обороты(
	|			&ДатаНач, 
	|			&ДатаКон, 
	|			" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",  
	|			(&ДоходыОблагаемыеОППВ ИЛИ &ОбъектИсчисленияОППВ)
	|			{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ОППВСведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|// ОППВ взносы
	|ВЫБРАТЬ
	|	ОППВРасчетыСФондами.Налогоплательщик КАК Налогоплательщик,
	|	ОППВРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОППВРасчетыСФондами.Организация,
	|	ОППВРасчетыСФондами.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ОППВРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ОППВРасчетыСФондами.Регистратор", "NULL") + " КАК Регистратор,
	|	NULL КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ОППВРасчетыСФондами.Взнос КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.ОППВРасчетыСФондами КАК ОППВРасчетыСФондами
	|
	|ГДЕ
	|	ОППВРасчетыСФондами.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон
	|	И ОППВРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)
	|	И ОППВРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
	|	И (&ОППВ)
	|{ГДЕ
	|	ОППВРасчетыСФондами.Налогоплательщик.* КАК Налогоплательщик,
	|	ОППВРасчетыСФондами.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ОППВРасчетыСФондами.ФизЛицо.* КАК ФизЛицо}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// доходы, облагаемые ВОСМС и облагаемая база ВОСМС
	|ВЫБРАТЬ 
	|	ВОСМССведенияОДоходах.Налогоплательщик КАК Налогоплательщик,
	|	ВОСМССведенияОДоходах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВОСМССведенияОДоходах.Организация,
	|	ВОСМССведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ВОСМССведенияОДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ВОСМССведенияОДоходах.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВОСМССведенияОДоходах.Период, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫБОР 
	|		КОГДА ВОСМССведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ВОСМССведенияОДоходах.СуммаДоходаОборот - ВОСМССведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ДоходыОблагаемыеВОСМС,
	|	ВЫБОР 
	|		КОГДА ВОСМССведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ВОСМССведенияОДоходах.ОблагаемаяБазаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|
	|ИЗ
	|	РегистрНакопления.ВОСМССведенияОДоходах.Обороты(
	|			&ДатаНач, 
	|			&ДатаКон, 
	|			" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",  
	|			(&ДоходыОблагаемыеВОСМС ИЛИ &ОбъектИсчисленияВОСМС)
	|			И ВЫБОР
	|				КОГДА &ВключитьИП
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ФизЛицо ССЫЛКА Справочник.Контрагенты
	|							ТОГДА НЕ ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			КОНЕЦ
	|			{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВОСМССведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ВОСМС
	|ВЫБРАТЬ
	|	ВОСМСРасчетыСФондами.Налогоплательщик КАК Налогоплательщик,
	|	ВОСМСРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВОСМСРасчетыСФондами.Организация,
	|	ВОСМСРасчетыСФондами.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ВОСМСРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ВОСМСРасчетыСФондами.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВОСМСРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫБОР
	|		КОГДА ВОСМСРасчетыСФондами.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|				И ВОСМСРасчетыСФондами.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ -ВОСМСРасчетыСФондами.Взнос
	|	КОНЕЦ КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВОСМСРасчетыСФондами.Взнос КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	- ВОСМСРасчетыСФондами.Взнос КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.ВОСМСРасчетыСФондами КАК ВОСМСРасчетыСФондами
	|
	|ГДЕ
	|	ВОСМСРасчетыСФондами.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВОСМСРасчетыСФондами.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ВОСМСРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)
	|	И ВОСМСРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
	|	И (&ВОСМС)
	|	И ВЫБОР
	|			КОГДА &ВключитьИП
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ВОСМСРасчетыСФондами.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|						ТОГДА НЕ ВОСМСРасчетыСФондами.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОНЕЦ
	|{ГДЕ
	|	ВОСМСРасчетыСФондами.Налогоплательщик.* КАК Налогоплательщик,
	|	ВОСМСРасчетыСФондами.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ВОСМСРасчетыСФондами.ФизЛицо.* КАК ФизЛицо}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// доходы, облагаемые ООСМС и облагаемая база ООСМС
	|ВЫБРАТЬ 
	|	ООСМССведенияОДоходах.Налогоплательщик КАК Налогоплательщик,
	|	ООСМССведенияОДоходах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ООСМССведенияОДоходах.Организация,
	|	ООСМССведенияОДоходах.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ООСМССведенияОДоходах.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ООСМССведенияОДоходах.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ООСМССведенияОДоходах.Период, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫБОР 
	|		КОГДА ООСМССведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ООСМССведенияОДоходах.СуммаДоходаОборот - ООСМССведенияОДоходах.СуммаВычетаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ  КАК ДоходыОблагаемыеООСМС,
	|	ВЫБОР 
	|		КОГДА ООСМССведенияОДоходах.СпособНалогообложения <> ЗНАЧЕНИЕ(Справочник.СпособыНалогообложенияДоходов.НеОблагаетсяЦеликом)
	|			ТОГДА ООСМССведенияОДоходах.ОблагаемаяБазаОборот
	|		ИНАЧЕ ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|
	|ИЗ
	|	РегистрНакопления.ООСМССведенияОДоходах.Обороты(
	|			&ДатаНач, 
	|			&ДатаКон, 
	|			" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",  
	|			(&ДоходыОблагаемыеООСМС ИЛИ &ОбъектИсчисленияООСМС)
	|			{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ООСМССведенияОДоходах
	|
	|ОБЪЕДИНИТЬ ВСЕ
    |
	|// ООСМС
	|ВЫБРАТЬ
	|	ООСМСРасчетыСФондами.Налогоплательщик КАК Налогоплательщик,
	|	ООСМСРасчетыСФондами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ООСМСРасчетыСФондами.Организация,
	|	ООСМСРасчетыСФондами.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ООСМСРасчетыСФондами.МесяцНалоговогоПериода, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ООСМСРасчетыСФондами.Регистратор", "NULL") + " КАК Регистратор,
	|	NULL КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ООСМСРасчетыСФондами.Отчисление КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.ООСМСРасчетыСФондами КАК ООСМСРасчетыСФондами
	|
	|ГДЕ
	|	ООСМСРасчетыСФондами.МесяцНалоговогоПериода МЕЖДУ &ДатаНач И &ДатаКон
	|	И ООСМСРасчетыСФондами.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВБюджетИФонды.Налог)
	|	И ООСМСРасчетыСФондами.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.РасчетыСБюджетомФондамиВидСтроки.Исчисление)
	|	И (&ООСМС)
	|{ГДЕ
	|	ООСМСРасчетыСФондами.Налогоплательщик.* КАК Налогоплательщик,
	|	ООСМСРасчетыСФондами.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ООСМСРасчетыСФондами.ФизЛицо.* КАК ФизЛицо}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// выплаченные доходы
	|ВЫБРАТЬ
	|	ВыплаченныеДоходы.Налогоплательщик КАК Налогоплательщик,
	|	ВыплаченныеДоходы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВыплаченныеДоходы.Организация,
	|	ВыплаченныеДоходы.ФизЛицо КАК ФизЛицо,
	|	НАЧАЛОПЕРИОДА(ВыплаченныеДоходы.Период, МЕСЯЦ) КАК МесяцНалоговогоПериода,
	|	" + ?(ЕстьДетализация, "ВыплаченныеДоходы.Регистратор", "NULL") + " КАК Регистратор,
	|	" + ?(ЕстьДетализация, "НАЧАЛОПЕРИОДА(ВыплаченныеДоходы.МесяцНалоговогоПериода, МЕСЯЦ)", "NULL") + " КАК ПериодВзаиморасчетов,
	|
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	ВыплаченныеДоходы.СуммаДоходаОборот КАК ВыплаченоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	ЛОЖЬ КАК ВыплатыПоИЛ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаИПНПодлежащегоПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаОПВПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходКВыплате,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВОСМСПодлежащихПеречислению,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонец,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	РегистрНакопления.ВыплаченныеДоходыРаботникамОрганизацийНУ.Обороты(
	|				&ДатаНач, 
	|				&ДатаКон, 
	|				" + ?(ЕстьДетализация, "РЕГИСТРАТОР", "МЕСЯЦ") + ",
	|				(&ВыплаченоДоходов ИЛИ &УдельныйВес)
	|				И ВЫБОР
	|					КОГДА &ВключитьИП
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВЫБОР
	|								КОГДА ФизЛицо ССЫЛКА Справочник.Контрагенты
	|								ТОГДА НЕ ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|	 			 КОНЕЦ
	|				{Налогоплательщик.* КАК Налогоплательщик, СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница, ФизЛицо.* КАК ФизЛицо}) КАК ВыплаченныеДоходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взаиморасчеты.Налогоплательщик,
	|	Взаиморасчеты.СтруктурнаяЕдиница,
	|	Взаиморасчеты.Организация,
	|	Взаиморасчеты.ФизЛицо,
	|	РеглКалендарь.НачМесяца КАК МесяцНалоговогоПериода,
	|	Взаиморасчеты.Регистратор,
	|	Взаиморасчеты.ПериодВзаиморасчетов,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.НачисленоДоходов
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК НачисленоДоходов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НалоговыеВычеты,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОПВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбязательныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДобровольныеПенсионныеВзносы,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ПогашениеЖилищныхЗаймов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СтраховыеПремии,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК Льгота,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.ДоходыНеОблагаемыеИПН
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ДоходыНеОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеИПНРасчет,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияИПН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ИндивидуальныйПодоходныйНалог,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.ВыплаченоДоходов
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ВыплаченоДоходов,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.ВыплатыНеОблагаемыеСН
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ВыплатыНеОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВыплатыОблагаемыеСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСН,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныйНалог,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияСО,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СоциальныеОтчисления,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОППВ,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ВОСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ДоходыОблагаемыеООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ОбъектИсчисленияООСМС,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК ООСМС,
	|	Взаиморасчеты.ВыплатыПоИЛ КАК ВыплатыПоИЛ,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.СуммаИПНПодлежащегоПеречислению
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК СуммаИПНПодлежащегоПеречислению,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.СуммаОПВПодлежащихПеречислению
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК СуммаОПВПодлежащихПеречислению,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < РеглКалендарь.НачМесяца
	|				ТОГДА Взаиморасчеты.СуммаДохода
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоДоходамНаНачало,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < &ДатаНач И РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаДохода
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.ДоходКВыплате
	|			ИНАЧЕ 0 
	|		  КОНЕЦ) КАК ДоходКВыплате,
	|
	|	СУММА(Взаиморасчеты.СуммаДохода) КАК ЗадолженностьПоДоходамНаКонец,
	|
	|	СУММА(ВЫБОР
	|			КОГДА РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаДохода
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < РеглКалендарь.НачМесяца
	|				ТОГДА Взаиморасчеты.СуммаИПН
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоИПННаНачало,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < &ДатаНач И РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаИПН
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|
	|	СУММА(Взаиморасчеты.СуммаИПН) КАК ЗадолженностьПоИПННаКонец,
	|
	|	СУММА(ВЫБОР
	|			КОГДА РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаИПН
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < РеглКалендарь.НачМесяца
	|				ТОГДА Взаиморасчеты.СуммаОПВ
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоОПВНаНачало,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < &ДатаНач И РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаОПВ
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|
	|	СУММА(Взаиморасчеты.СуммаОПВ) КАК ЗадолженностьПоОПВНаКонец,
	|
	|	СУММА(ВЫБОР
	|			КОГДА РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаОПВ
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период МЕЖДУ РеглКалендарь.НачМесяца И РеглКалендарь.КонМесяца
	|				ТОГДА Взаиморасчеты.СуммаВОСМСПодлежащихПеречислению
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК СуммаВОСМСПодлежащихПеречислению,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < РеглКалендарь.НачМесяца
	|				ТОГДА Взаиморасчеты.СуммаВОСМС
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоВОСМСНаНачало,
	|	СУММА(ВЫБОР
	|			КОГДА Взаиморасчеты.Период < &ДатаНач И РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаНач, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаВОСМС
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	СУММА(Взаиморасчеты.СуммаВОСМС) КАК ЗадолженностьПоВОСМСНаКонец,
	|	СУММА(ВЫБОР
	|			КОГДА РеглКалендарь.НачМесяца = НАЧАЛОПЕРИОДА(&ДатаКон, МЕСЯЦ)
	|				ТОГДА Взаиморасчеты.СуммаВОСМС
	|			ИНАЧЕ 0
	|		  КОНЕЦ) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|ИЗ
	|	ВТ_СгруппированныеВзаиморасчеты КАК Взаиморасчеты
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеглКалендарь КАК РеглКалендарь
	|		ПО Взаиморасчеты.Период <= РеглКалендарь.КонМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	Взаиморасчеты.Налогоплательщик,
	|	Взаиморасчеты.СтруктурнаяЕдиница,
	|	Взаиморасчеты.Организация,
	|	Взаиморасчеты.ФизЛицо,
	|	РеглКалендарь.НачМесяца,
	|	Взаиморасчеты.Регистратор,
	|	Взаиморасчеты.ПериодВзаиморасчетов,
	|	Взаиморасчеты.ВыплатыПоИЛ
	|;
	|
	|//////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Налогоплательщик,
	|	СтруктурнаяЕдиница,
	|	Организация,
	|	ФизЛицо,
	|	МесяцНалоговогоПериода,
	|	Регистратор,
	|	ПериодВзаиморасчетов,
	|	ВыплатыПоИЛ,
	|
	|	СУММА(НачисленоДоходов) КАК НачисленоДоходов,
	|	СУММА(НалоговыеВычеты) КАК НалоговыеВычеты,
	|	СУММА(ДоходыОблагаемыеОПВ) КАК ДоходыОблагаемыеОПВ,	
	|	СУММА(ОбъектИсчисленияОПВ) КАК ОбъектИсчисленияОПВ,
	|	СУММА(ОбязательныеПенсионныеВзносы) КАК ОбязательныеПенсионныеВзносы,
	|	СУММА(ДобровольныеПенсионныеВзносы) КАК ДобровольныеПенсионныеВзносы,
	|	СУММА(ПогашениеЖилищныхЗаймов) КАК ПогашениеЖилищныхЗаймов,
	|	СУММА(СтраховыеПремии) КАК СтраховыеПремии,
	|	СУММА(Льгота) КАК Льгота,	
	|	СУММА(ДоходыНеОблагаемыеИПН) КАК ДоходыНеОблагаемыеИПН,
	|	СУММА(ДоходыОблагаемыеИПН) КАК ДоходыОблагаемыеИПН,
	|	СУММА(ДоходыОблагаемыеИПНРасчет) КАК ДоходыОблагаемыеИПНРасчет,
	|	СУММА(ОбъектИсчисленияИПН) КАК ОбъектИсчисленияИПН,
	|	СУММА(ИндивидуальныйПодоходныйНалог) КАК ИндивидуальныйПодоходныйНалог,
	|	СУММА(ВыплаченоДоходов) КАК ВыплаченоДоходов,
	|	СУММА(ВыплатыНеОблагаемыеСН) КАК ВыплатыНеОблагаемыеСН,
	|	СУММА(ВыплатыОблагаемыеСН) КАК ВыплатыОблагаемыеСН,
	|	СУММА(ОбъектИсчисленияСН) КАК ОбъектИсчисленияСН,
	|	СУММА(СоциальныйНалог) КАК СоциальныйНалог,
	|	СУММА(ДоходыОблагаемыеСО) КАК ДоходыОблагаемыеСО,
	|	СУММА(ОбъектИсчисленияСО) КАК ОбъектИсчисленияСО,
	|	СУММА(СоциальныеОтчисления) КАК СоциальныеОтчисления,
	|	СУММА(ДоходыОблагаемыеОППВ) КАК ДоходыОблагаемыеОППВ,
	|	СУММА(ОбъектИсчисленияОППВ) КАК ОбъектИсчисленияОППВ,
	|	СУММА(ОППВ) КАК ОППВ,
	|	СУММА(ДоходыОблагаемыеВОСМС) КАК ДоходыОблагаемыеВОСМС,
	|	СУММА(ОбъектИсчисленияВОСМС) КАК ОбъектИсчисленияВОСМС,
	|	СУММА(ВОСМС) КАК ВОСМС,
	|	СУММА(ДоходыОблагаемыеООСМС) КАК ДоходыОблагаемыеООСМС,
	|	СУММА(ОбъектИсчисленияООСМС) КАК ОбъектИсчисленияООСМС,
	|	СУММА(ООСМС) КАК ООСМС,
	|	СУММА(СуммаИПНПодлежащегоПеречислению) КАК СуммаИПНПодлежащегоПеречислению,
	|	СУММА(СуммаОПВПодлежащихПеречислению) КАК СуммаОПВПодлежащихПеречислению,
	|	СУММА(ЗадолженностьПоДоходамНаНачало) КАК ЗадолженностьПоДоходамНаНачало,
	|	СУММА(ЗадолженностьПоДоходамНаНачалоПервогоМесяца) КАК ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	СУММА(ДоходКВыплате) КАК ДоходКВыплате,
	|	СУММА(ЗадолженностьПоДоходамНаКонец) КАК ЗадолженностьПоДоходамНаКонец,
	|	СУММА(ЗадолженностьПоДоходамНаКонецПоследнегоМесяца) КАК ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	СУММА(ЗадолженностьПоИПННаНачало) КАК ЗадолженностьПоИПННаНачало,
	|	СУММА(ЗадолженностьПоИПННаНачалоПервогоМесяца) КАК ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	СУММА(ЗадолженностьПоИПННаКонец) КАК ЗадолженностьПоИПННаКонец,
	|	СУММА(ЗадолженностьПоИПННаКонецПоследнегоМесяца) КАК ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	СУММА(ЗадолженностьПоОПВНаНачало) КАК ЗадолженностьПоОПВНаНачало,
	|	СУММА(ЗадолженностьПоОПВНаНачалоПервогоМесяца) КАК ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	СУММА(ЗадолженностьПоОПВНаКонец) КАК ЗадолженностьПоОПВНаКонец,
	|	СУММА(ЗадолженностьПоОПВНаКонецПоследнегоМесяца) КАК ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	СУММА(СуммаВОСМСПодлежащихПеречислению) КАК СуммаВОСМСПодлежащихПеречислению,
	|	СУММА(ЗадолженностьПоВОСМСНаНачало) КАК ЗадолженностьПоВОСМСНаНачало,
	|	СУММА(ЗадолженностьПоВОСМСНаНачалоПервогоМесяца) КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	СУММА(ЗадолженностьПоВОСМСНаКонец) КАК ЗадолженностьПоВОСМСНаКонец,
	|	СУММА(ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца) КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца
	|
	|ПОМЕСТИТЬ ВТ_СгруппированныеДанные
	|ИЗ
	|	ВТ_Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	Налогоплательщик,
	|	СтруктурнаяЕдиница,
	|	Организация,
	|	ФизЛицо,
	|	МесяцНалоговогоПериода,
	|	Регистратор,
	|	ПериодВзаиморасчетов,
	|	ВыплатыПоИЛ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|//////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ИсчислениеНалогов.НалоговыйКомитет, Организации.НалоговыйКомитет) КАК НалоговыйКомитет
	|
	|ПОМЕСТИТЬ ВТ_ИсчислениеНалогов
	|ИЗ
	|	Справочник.Организации КАК Организации
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсчислениеНалоговСтруктурныхЕдиниц КАК ИсчислениеНалогов
	|		ПО Организации.Ссылка = ИсчислениеНалогов.СтруктурнаяЕдиница
	|			И ИсчислениеНалогов.РазделНалоговогоУчета = ЗНАЧЕНИЕ(Перечисление.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты)
	|
	|ОБЪЕДИНИТЬ // выбираем только различные
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПодразделенияОрганизаций.ЯвляетсяСтруктурнымПодразделением
	|			ТОГДА ПодразделенияОрганизаций.Ссылка
	|		ИНАЧЕ ПодразделенияОрганизаций.Владелец
	|	КОНЕЦ КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ИсчислениеНалогов_Подр.НалоговыйКомитет, 
	|					ЕСТЬNULL(ИсчислениеНалогов_Орг.НалоговыйКомитет, ПодразделенияОрганизаций.Владелец.НалоговыйКомитет)) КАК НалоговыйКомитет
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсчислениеНалоговСтруктурныхЕдиниц КАК ИсчислениеНалогов_Подр
	|		ПО ПодразделенияОрганизаций.Ссылка = ИсчислениеНалогов_Подр.СтруктурнаяЕдиница
	|			И ИсчислениеНалогов_Подр.РазделНалоговогоУчета = ЗНАЧЕНИЕ(Перечисление.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсчислениеНалоговСтруктурныхЕдиниц КАК ИсчислениеНалогов_Орг
	|		ПО ПодразделенияОрганизаций.Владелец = ИсчислениеНалогов_Орг.СтруктурнаяЕдиница
	|			И ИсчислениеНалогов_Орг.РазделНалоговогоУчета = ЗНАЧЕНИЕ(Перечисление.РазделыНалоговогоУчета.НалогиСЗаработнойПлаты)	
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтруктурнаяЕдиница
	|;
	|//////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ЕСТЬNULL(РаботникиОрганизаций.Сотрудник.Код, """")) КАК ТабельныйНомер,
	|	Данные.Налогоплательщик КАК Налогоплательщик,
	|	Данные.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Данные.ФизЛицо КАК ФизЛицо
	|ПОМЕСТИТЬ ВТ_ДанныеРаботников
	|ИЗ
	|	ВТ_СгруппированныеДанные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаКон, Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК РаботникиОрганизаций
	|		ПО Данные.ФизЛицо = РаботникиОрганизаций.Сотрудник.Физлицо
	|			И Данные.Организация = РаботникиОрганизаций.ОбособленноеПодразделение
	|{ГДЕ
	|	Данные.ФизЛицо.* КАК ФизЛицо}
    |
	|СГРУППИРОВАТЬ ПО
	|	Данные.Налогоплательщик,
	|	Данные.СтруктурнаяЕдиница,
	|	Данные.ФизЛицо
    |
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Налогоплательщик,
	|	СтруктурнаяЕдиница	
	|;
	|
	|//////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1 КАК КоличествоЗаписей,
	|	Данные.НачисленоДоходов,
	|	Данные.НалоговыеВычеты,
	|	Данные.ДоходыОблагаемыеОПВ,
	|	Данные.ОбъектИсчисленияОПВ,
	|	Данные.ОбязательныеПенсионныеВзносы,
	|	Данные.ДобровольныеПенсионныеВзносы,
	|	Данные.ПогашениеЖилищныхЗаймов,
	|	Данные.СтраховыеПремии,
	|	Данные.Льгота,
	|	Данные.ДоходыНеОблагаемыеИПН,
	|	Данные.ДоходыОблагаемыеИПН, 
	|	Данные.ДоходыОблагаемыеИПНРасчет,	
	|	Данные.ОбъектИсчисленияИПН,
	|	Данные.ИндивидуальныйПодоходныйНалог,
	|	Данные.ВыплаченоДоходов,
	|	Данные.ВыплатыНеОблагаемыеСН,
	|	Данные.ВыплатыОблагаемыеСН,
	|	Данные.ОбъектИсчисленияСН,
	|	Данные.СоциальныйНалог,
	|	Данные.ДоходыОблагаемыеСО,
	|	Данные.ОбъектИсчисленияСО,
	|	Данные.СоциальныеОтчисления,
	|	Данные.ДоходыОблагаемыеОППВ,
	|	Данные.ОбъектИсчисленияОППВ,
	|	Данные.ОППВ,
	|	Данные.ДоходыОблагаемыеВОСМС,
	|	Данные.ОбъектИсчисленияВОСМС,
	|	Данные.ВОСМС,
	|	Данные.ДоходыОблагаемыеООСМС,
	|	Данные.ОбъектИсчисленияООСМС,
	|	Данные.ООСМС,
	|	Данные.ВыплатыПоИЛ,
	|	ВЫБОР
	|		КОГДА НЕ Данные.ВыплатыПоИЛ
	|					И Данные.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|					И Данные.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ИСТИНА 
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИндивидуальныйПредпринимательАдвокатЧастныйНотариус,
	|	Данные.СуммаИПНПодлежащегоПеречислению,
	|	Данные.СуммаОПВПодлежащихПеречислению,
	|	Данные.ЗадолженностьПоДоходамНаНачало,
	|	Данные.ЗадолженностьПоДоходамНаНачалоПервогоМесяца,
	|	Данные.ДоходКВыплате,
	|	Данные.ЗадолженностьПоДоходамНаКонец,
	|	Данные.ЗадолженностьПоДоходамНаКонецПоследнегоМесяца,
	|	Данные.ЗадолженностьПоИПННаНачало,
	|	Данные.ЗадолженностьПоИПННаНачалоПервогоМесяца,
	|	Данные.ЗадолженностьПоИПННаКонец,
	|	Данные.ЗадолженностьПоИПННаКонецПоследнегоМесяца,
	|	Данные.ЗадолженностьПоОПВНаНачало,
	|	Данные.ЗадолженностьПоОПВНаНачалоПервогоМесяца,
	|	Данные.ЗадолженностьПоОПВНаКонец,
	|	Данные.ЗадолженностьПоОПВНаКонецПоследнегоМесяца,
	|	Данные.СуммаВОСМСПодлежащихПеречислению КАК СуммаВОСМСПодлежащихПеречислению,
	|	Данные.ЗадолженностьПоВОСМСНаНачало КАК ЗадолженностьПоВОСМСНаНачало,
	|	Данные.ЗадолженностьПоВОСМСНаНачалоПервогоМесяца КАК ЗадолженностьПоВОСМСНаНачалоПервогоМесяца,
	|	Данные.ЗадолженностьПоВОСМСНаКонец КАК ЗадолженностьПоВОСМСНаКонец,
	|	Данные.ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца КАК ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца,
	|	Данные.ФизЛицо.РНН КАК РНН,
	|	Данные.ФизЛицо.ИдентификационныйКодЛичности КАК ИИН,
	|	ЕСТЬNULL(ДанныеРаботников.ТабельныйНомер, """") КАК ТабельныйНомер,
	|	Данные.Налогоплательщик,
	|	Данные.СтруктурнаяЕдиница,
	|	ИсчислениеНалогов.НалоговыйКомитет,
	|	Данные.ФизЛицо,
	|	Данные.МесяцНалоговогоПериода, // месяц, на начало которого была задолженность
	|	Данные.Регистратор, 
	|	Данные.ПериодВзаиморасчетов // в доп. развороте указываем за какой месяц осталась задолженность
	|
	|ИЗ
	|	ВТ_СгруппированныеДанные КАК Данные
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсчислениеНалогов КАК ИсчислениеНалогов
	|		ПО Данные.СтруктурнаяЕдиница = ИсчислениеНалогов.СтруктурнаяЕдиница
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеРаботников КАК ДанныеРаботников
	|		ПО Данные.ФизЛицо = ДанныеРаботников.ФизЛицо
	|		И Данные.Налогоплательщик = ДанныеРаботников.Налогоплательщик
	|		И Данные.СтруктурнаяЕдиница = ДанныеРаботников.СтруктурнаяЕдиница
	|
	|	{ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГражданствоФизЛиц КАК ГражданствоФизЛиц
	|		ПО (ВЫБОР
    |				КОГДА Данные.ФизЛицо ССЫЛКА Справочник.Контрагенты
    |						И Данные.ФизЛицо.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
    |					ТОГДА Данные.ФизЛицо.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
    |				ИНАЧЕ Данные.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
    |			КОНЕЦ)                                              
	|			И Данные.МесяцНалоговогоПериода = ГражданствоФизЛиц.НачМесяца
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц.СрезПоследних(&ДатаКон) КАК СведенияОбИнвалидностиФизЛиц
	|		ПО Данные.ФизЛицо = СведенияОбИнвалидностиФизЛиц.ФизЛицо
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОФизлицахУчастникахВОВ.СрезПоследних(&ДатаКон) КАК СведенияОФизлицахУчастникахВОВ
	|		ПО Данные.ФизЛицо = СведенияОФизлицахУчастникахВОВ.ФизЛицо}
	|
	|ГДЕ
	|	НачисленоДоходов <> 0
	|	ИЛИ НалоговыеВычеты <> 0
	|	ИЛИ ДоходыОблагаемыеОПВ <> 0
	|	ИЛИ ОбъектИсчисленияОПВ <> 0
	|	ИЛИ ОбязательныеПенсионныеВзносы <> 0
	|	ИЛИ ДобровольныеПенсионныеВзносы <> 0
	|	ИЛИ ПогашениеЖилищныхЗаймов <> 0
	|	ИЛИ СтраховыеПремии <> 0
	|	ИЛИ Льгота <> 0
	|	ИЛИ ДоходыНеОблагаемыеИПН <> 0
	|	ИЛИ ДоходыОблагаемыеИПН <> 0
	|	ИЛИ ИндивидуальныйПодоходныйНалог <> 0
	|	ИЛИ ВыплаченоДоходов <> 0
	|	ИЛИ ВыплатыНеОблагаемыеСН <> 0
	|	ИЛИ ВыплатыОблагаемыеСН <> 0
	|	ИЛИ ОбъектИсчисленияСН <> 0
	|	ИЛИ СоциальныйНалог <> 0
	|	ИЛИ ДоходыОблагаемыеСО <> 0
	|	ИЛИ ОбъектИсчисленияСО <> 0
	|	ИЛИ СоциальныеОтчисления <> 0
	|	ИЛИ ДоходыОблагаемыеОППВ <> 0
	|	ИЛИ ОбъектИсчисленияОППВ <> 0
	|	ИЛИ ОППВ <> 0
	|	ИЛИ ДоходыОблагаемыеВОСМС <> 0
	|	ИЛИ ОбъектИсчисленияВОСМС <> 0
	|	ИЛИ ВОСМС <> 0
	|	ИЛИ ДоходыОблагаемыеООСМС <> 0
	|	ИЛИ ОбъектИсчисленияООСМС <> 0
	|	ИЛИ ООСМС <> 0
	|	ИЛИ СуммаИПНПодлежащегоПеречислению <> 0
	|	ИЛИ СуммаОПВПодлежащихПеречислению <> 0
	|	ИЛИ ЗадолженностьПоДоходамНаНачало <> 0
	|	ИЛИ ДоходКВыплате <> 0
	|	ИЛИ ЗадолженностьПоДоходамНаКонец <> 0
	|	ИЛИ ЗадолженностьПоИПННаНачало <> 0
	|	ИЛИ ЗадолженностьПоИПННаКонец <> 0
	|	ИЛИ ЗадолженностьПоОПВНаНачало <> 0
	|	ИЛИ ЗадолженностьПоОПВНаКонец <> 0
	|	ИЛИ СуммаВОСМСПодлежащихПеречислению <> 0
	|	ИЛИ ЗадолженностьПоВОСМСНаНачало <> 0
	|	ИЛИ ЗадолженностьПоВОСМСНаНачалоПервогоМесяца <> 0
	|	ИЛИ ЗадолженностьПоВОСМСНаКонец <> 0
	|	ИЛИ ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца <> 0
	|
	|{ГДЕ
	|	Данные.Налогоплательщик.* КАК Налогоплательщик,
	|	Данные.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ИсчислениеНалогов.НалоговыйКомитет.* КАК НалоговыйКомитет,
	|	Данные.ФизЛицо.* КАК ФизЛицо,
	|	Данные.МесяцНалоговогоПериода, // месяц, на начало которого была задолженность
	|	ВЫБОР
	|		КОГДА Данные.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|			И Данные.ФизЛицо.ФизЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(Данные.ФизЛицо КАК Справочник.Контрагенты).СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Казахстан)
	|					ИНАЧЕ ВЫРАЗИТЬ(Данные.ФизЛицо КАК Справочник.Контрагенты).СтранаРезидентства
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ГражданствоФизЛиц.Страна ЕСТЬ NULL
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Казахстан)
	|				КОГДА ГражданствоФизЛиц.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|					ТОГДА ""Лицо без гражданства""
	|				ИНАЧЕ ГражданствоФизЛиц.Страна
	|			КОНЕЦ
	|	КОНЕЦ КАК Страна,
	|	ЕСТЬNULL(ГражданствоФизЛиц.НеИмеетПравоНаПенсию, ЛОЖЬ) КАК НеИмеетПравоНаПенсию,
	|	ЕСТЬNULL(ГражданствоФизЛиц.НеПодлежитСоциальномуСтрахованию, ЛОЖЬ) КАК НеПодлежитСоциальномуСтрахованию,
	|	ЕСТЬNULL(ГражданствоФизЛиц.НеЯвляетсяНалоговымРезидентомРК, ЛОЖЬ) КАК НеЯвляетсяНалоговымРезидентомРК,
	|	ЕСТЬNULL(ГражданствоФизЛиц.ИностранныйСпециалист, ЛОЖЬ) КАК ИностранныйСпециалист,
	|	ЕСТЬNULL(ГражданствоФизЛиц.НомерНалоговойРегистрацииВСтранеРезидентства, """") КАК НомерНалоговойРегистрацииВСтранеРезидентства,
	|	ЕСТЬNULL(СведенияОбИнвалидностиФизлиц.ОтношениеКИнвалидности, ЗНАЧЕНИЕ(Перечисление.ОтношениеКИнвалидности.ПустаяСсылка)) КАК ОтношениеКИнвалидности,
	|	ЕСТЬNULL(СведенияОФизлицахУчастникахВОВ.Статус, ЗНАЧЕНИЕ(Перечисление.КатегорииФизлицУчастниковВОВ.ПустаяСсылка)) КАК СтатусУчастникаВОВ,
	|	Данные.ВыплатыПоИЛ,
	|	ВЫБОР
	|		КОГДА НЕ Данные.ВыплатыПоИЛ
	|					И Данные.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|					И Данные.ФизЛицо.ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|			ТОГДА ИСТИНА 
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИндивидуальныйПредпринимательАдвокатЧастныйНотариус
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Данные.Налогоплательщик.* КАК Налогоплательщик,
	|	Данные.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ИсчислениеНалогов.НалоговыйКомитет.* КАК НалоговыйКомитет,
	|	Данные.МесяцНалоговогоПериода, // месяц, на начало которого была задолженность
	|	Данные.ФизЛицо.* КАК ФизЛицо,
	|	Данные.ПериодВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА Данные.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|			И Данные.ФизЛицо.ФизЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(Данные.ФизЛицо КАК Справочник.Контрагенты).СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Казахстан)
	|					ИНАЧЕ ВЫРАЗИТЬ(Данные.ФизЛицо КАК Справочник.Контрагенты).СтранаРезидентства
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ГражданствоФизЛиц.Страна ЕСТЬ NULL
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Казахстан)
	|				КОГДА ГражданствоФизЛиц.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|					ТОГДА ""Лицо без гражданства""
	|				ИНАЧЕ ГражданствоФизЛиц.Страна
	|			КОНЕЦ
	|	КОНЕЦ КАК Страна
	|}
	|{ИТОГИ ПО
	|	Данные.Налогоплательщик.* КАК Налогоплательщик,
	|	Данные.СтруктурнаяЕдиница.* КАК СтруктурнаяЕдиница,
	|	ИсчислениеНалогов.НалоговыйКомитет.* КАК НалоговыйКомитет,
	|	Данные.МесяцНалоговогоПериода, // месяц, на начало которого была задолженность
	|	Данные.ФизЛицо,
	|	Данные.Регистратор,
	|	Данные.ПериодВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА Данные.ФизЛицо ССЫЛКА Справочник.Контрагенты
	|			И Данные.ФизЛицо.ФизЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(Данные.ФизЛицо КАК Справочник.Контрагенты).СтранаРезидентства = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|						ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Казахстан)
	|					ИНАЧЕ ВЫРАЗИТЬ(Данные.ФизЛицо КАК Справочник.Контрагенты).СтранаРезидентства
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ГражданствоФизЛиц.Страна ЕСТЬ NULL
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Казахстан)
	|				КОГДА ГражданствоФизЛиц.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)
	|					ТОГДА ""Лицо без гражданства""
	|				ИНАЧЕ ГражданствоФизЛиц.Страна
	|			КОНЕЦ
	|	КОНЕЦ КАК Страна
	|}
	|ИТОГИ 
	|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей,
	|	МАКСИМУМ(РНН),
	|	МАКСИМУМ(ИИН),
	|	МАКСИМУМ(ТабельныйНомер),
	|	СУММА(НачисленоДоходов),
	|	СУММА(НалоговыеВычеты),
	|	СУММА(ДоходыОблагаемыеОПВ),
	|	СУММА(ОбъектИсчисленияОПВ),
	|	СУММА(ОбязательныеПенсионныеВзносы),
	|	СУММА(ДобровольныеПенсионныеВзносы),
	|	СУММА(ПогашениеЖилищныхЗаймов),
	|	СУММА(СтраховыеПремии),
	|	СУММА(Льгота),
	|	СУММА(ДоходыНеОблагаемыеИПН),
	|	СУММА(ДоходыОблагаемыеИПН), 
	|	СУММА(ДоходыОблагаемыеИПНРасчет),
	|	СУММА(ОбъектИсчисленияИПН),
	|	СУММА(ИндивидуальныйПодоходныйНалог),
	|	СУММА(ВыплаченоДоходов),
	|	СУММА(ВыплатыНеОблагаемыеСН),
	|	СУММА(ВыплатыОблагаемыеСН),
	|	СУММА(ОбъектИсчисленияСН),
	|	СУММА(СоциальныйНалог),
	|	СУММА(ДоходыОблагаемыеСО),
	|	СУММА(ОбъектИсчисленияСО),
	|	СУММА(СоциальныеОтчисления),
	|	СУММА(ДоходыОблагаемыеОППВ),
	|	СУММА(ОбъектИсчисленияОППВ),
	|	СУММА(ОППВ),
	|	СУММА(ДоходыОблагаемыеВОСМС),
	|	СУММА(ОбъектИсчисленияВОСМС),
	|	СУММА(ВОСМС),
	|	СУММА(ДоходыОблагаемыеООСМС),
	|	СУММА(ОбъектИсчисленияООСМС),
	|	СУММА(ООСМС),
	|	СУММА(СуммаИПНПодлежащегоПеречислению),
	|	СУММА(СуммаОПВПодлежащихПеречислению),
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ // на уровне 'в целом' за период отчет (без доп. деления по месяцам налогового периода)
	|			ТОГДА СУММА(ЗадолженностьПоДоходамНаНачалоПервогоМесяца) // расчет нач. сальдо на первый месяц периода отчета
	|		ИНАЧЕ СУММА(ЗадолженностьПоДоходамНаНачало) // расчет нач. сальдо внутри одного месяца периода отчета
	|	КОНЕЦ КАК ЗадолженностьПоДоходамНаНачало,
	|	СУММА(ДоходКВыплате),
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ
	|			ТОГДА СУММА(ЗадолженностьПоДоходамНаКонецПоследнегоМесяца)
	|		ИНАЧЕ СУММА(ЗадолженностьПоДоходамНаКонец)
	|	КОНЕЦ КАК ЗадолженностьПоДоходамНаКонец,
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ
	|			ТОГДА СУММА(ЗадолженностьПоИПННаНачалоПервогоМесяца)
	|		ИНАЧЕ СУММА(ЗадолженностьПоИПННаНачало)
	|	КОНЕЦ КАК ЗадолженностьПоИПННаНачало,
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ
	|			ТОГДА СУММА(ЗадолженностьПоИПННаКонецПоследнегоМесяца)
	|		ИНАЧЕ СУММА(ЗадолженностьПоИПННаКонец)
	|	КОНЕЦ КАК ЗадолженностьПоИПННаКонец,
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ
	|			ТОГДА СУММА(ЗадолженностьПоОПВНаНачалоПервогоМесяца)
	|		ИНАЧЕ СУММА(ЗадолженностьПоОПВНаНачало)
	|	КОНЕЦ КАК ЗадолженностьПоОПВНаНачало,
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ
	|			ТОГДА СУММА(ЗадолженностьПоОПВНаКонецПоследнегоМесяца)
	|		ИНАЧЕ СУММА(ЗадолженностьПоОПВНаКонец)
	|	КОНЕЦ КАК ЗадолженностьПоОПВНаКонец,
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ
	|			ТОГДА СУММА(ЗадолженностьПоВОСМСНаНачалоПервогоМесяца)
	|		ИНАЧЕ СУММА(ЗадолженностьПоВОСМСНаНачало)
	|	КОНЕЦ КАК ЗадолженностьПоВОСМСНаНачало,
	|	ВЫБОР
	|		КОГДА (МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ
	|			ТОГДА СУММА(ЗадолженностьПоВОСМСНаКонецПоследнегоМесяца)
	|		ИНАЧЕ СУММА(ЗадолженностьПоВОСМСНаКонец)
	|	КОНЕЦ КАК ЗадолженностьПоВОСМСНаКонец,
	|	СУММА(СуммаВОСМСПодлежащихПеречислению)
	|ПО ОБЩИЕ,
	|	МесяцНалоговогоПериода
	|";
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	МассивОтбора = Новый Массив;

	МассивОтбора.Добавить("Налогоплательщик");
	МассивОтбора.Добавить("НалоговыйКомитет");
	МассивОтбора.Добавить("ФизЛицо");
	МассивОтбора.Добавить("Страна");
	МассивОтбора.Добавить("НеЯвляетсяНалоговымРезидентомРК");
	
    СтруктураПоказателей = Новый Структура();
    
	СтруктураПоказателей.Вставить("НачисленоДоходов", "Начислено доходов"); 
	СтруктураПоказателей.Вставить("ДоходыНеОблагаемыеИПН", "Доходы, не облагаемые ИПН"); 
	СтруктураПоказателей.Вставить("НалоговыеВычеты", "Налоговые вычеты");
	СтруктураПоказателей.Вставить("ПогашениеЖилищныхЗаймов", "Суммы, направленные на погашение вознаграждения по жилищным займам");   
	СтруктураПоказателей.Вставить("СтраховыеПремии", "Страховые премии");               	
	СтруктураПоказателей.Вставить("Льгота", "Предоставленная льгота"); 		
	СтруктураПоказателей.Вставить("ДоходыОблагаемыеОПВ", "Доходы, облагаемые ОПВ");   
	СтруктураПоказателей.Вставить("ОбъектИсчисленияОПВ", "Объект исчисления ОПВ");   
	СтруктураПоказателей.Вставить("ОбязательныеПенсионныеВзносы", "ОПВ");   
	СтруктураПоказателей.Вставить("ДоходыОблагаемыеИПН", "Доходы, облагаемые ИПН");  
	СтруктураПоказателей.Вставить("ДоходыОблагаемыеИПНРасчет", "Доходы, облагаемыеИПН, с учетом корректировок"); 		
	СтруктураПоказателей.Вставить("ОбъектИсчисленияИПН", "Объект исчисления ИПН");   	
	СтруктураПоказателей.Вставить("ИндивидуальныйПодоходныйНалог", "ИПН");   
	СтруктураПоказателей.Вставить("ВыплаченоДоходов", "Выплачено доходов");   
	СтруктураПоказателей.Вставить("ВыплатыНеОблагаемыеСН", "Выплаты, не облагаемые СН");
	СтруктураПоказателей.Вставить("ВыплатыОблагаемыеСН", "Выплаты облагаемые СН");
	СтруктураПоказателей.Вставить("ОбъектИсчисленияСН", "Объект исчисления СН"); 
	СтруктураПоказателей.Вставить("СоциальныйНалог", "СН");  
	СтруктураПоказателей.Вставить("ДоходыОблагаемыеСО", "Доходы, облагаемые СО"); 
	СтруктураПоказателей.Вставить("ОбъектИсчисленияСО", "Объект исчисления СО"); 
	СтруктураПоказателей.Вставить("СоциальныеОтчисления", "СО");
	СтруктураПоказателей.Вставить("ДоходыОблагаемыеОППВ", "Доходы, облагаемые ОППВ"); 
	СтруктураПоказателей.Вставить("ОбъектИсчисленияОППВ", "Объект исчисления ОППВ"); 
	СтруктураПоказателей.Вставить("ОППВ", "ОППВ");
	СтруктураПоказателей.Вставить("СоциальныйНалог", "СН");  
	СтруктураПоказателей.Вставить("ДоходыОблагаемыеВОСМС", "Доходы, облагаемые взносами ОСМС"); 
	СтруктураПоказателей.Вставить("ОбъектИсчисленияВОСМС", "Объект исчисления взносов ОСМС"); 
	СтруктураПоказателей.Вставить("ВОСМС", "Взносы ОСМС");
	СтруктураПоказателей.Вставить("ДоходыОблагаемыеООСМС", "Доходы, облагаемые отчислениями ОСМС"); 
	СтруктураПоказателей.Вставить("ОбъектИсчисленияООСМС", "Объект исчисления отчислений ОСМС"); 
	СтруктураПоказателей.Вставить("ООСМС", "Отчисления ОСМС");

	СтруктураПоказателей.Вставить("УдельныйВес", "Удельный вес выплаченных доходов и подлежащие перечислению суммы ИПН, ОПВ и ВОСМС");
	
	Показатели.Очистить();
	Для Каждого Показатель Из СтруктураПоказателей Цикл
		НоваяСтрока 				= Показатели.Добавить();
		НоваяСтрока.Использование 	= Истина;
		НоваяСтрока.Имя 			= Показатель.Ключ;
		НоваяСтрока.Представление 	=	Показатель.Значение;
	КонецЦикла;
	
	// группировки по умолчанию
	ПостроительОтчета.ИзмеренияСтроки.Очистить();
	
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Налогоплательщик");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("МесяцНалоговогоПериода");
	Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		ПостроительОтчета.ИзмеренияСтроки.Добавить("НалоговыйКомитет");
		ПостроительОтчета.ИзмеренияСтроки.Добавить("СтруктурнаяЕдиница");
	КонецЕсли;
	ПостроительОтчета.ИзмеренияСтроки.Добавить("ФизЛицо");
	
	// Сортировка по умолчанию
	ПостроительОтчета.Порядок.Добавить("Налогоплательщик.Наименование");
	ПостроительОтчета.Порядок.Добавить("МесяцНалоговогоПериода");
	Если мПоддержкаРаботыСоСтруктурнымиПодразделениями Тогда
		ПостроительОтчета.Порядок.Добавить("НалоговыйКомитет.Наименование");
		ПостроительОтчета.Порядок.Добавить("СтруктурнаяЕдиница.Наименование");
	КонецЕсли;
	ПостроительОтчета.Порядок.Добавить("ФизЛицо.Наименование");
	ПостроительОтчета.Порядок.Добавить("ПериодВзаиморасчетов");
	
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);

	мСтруктураПредставлениеПолей.Вставить("ФизЛицо", "Работник");
	мСтруктураПредставлениеПолей.Вставить("СтруктурнаяЕдиница", "Структурная единица");
	мСтруктураПредставлениеПолей.Вставить("МесяцНалоговогоПериода", "Месяц налогового периода");
	мСтруктураПредставлениеПолей.Вставить("НалоговыйКомитет", "Налоговый комитет");
	мСтруктураПредставлениеПолей.Вставить("Регистратор", "Детализация: документ движения (регистратор)");
	мСтруктураПредставлениеПолей.Вставить("ПериодВзаиморасчетов", "Детализация: период взаиморасчетов");
	мСтруктураПредставлениеПолей.Вставить("Страна", "Страна гражданства");
	мСтруктураПредставлениеПолей.Вставить("НеИмеетПравоНаПенсию", "Работник не имеет права на пенсию");
	мСтруктураПредставлениеПолей.Вставить("НеПодлежитСоциальномуСтрахованию", "Работник не подлежит социальному страхованию");
	мСтруктураПредставлениеПолей.Вставить("НеЯвляетсяНалоговымРезидентомРК", "Не является налоговым резидентом РК");
	мСтруктураПредставлениеПолей.Вставить("ИностранныйСпециалист", "Работник является иностранным специалистом");
	мСтруктураПредставлениеПолей.Вставить("НомерНалоговойРегистрацииВСтранеРезидентства", "Номер налоговой регистрации в стране резидентства");
	мСтруктураПредставлениеПолей.Вставить("ОтношениеКИнвалидности", "Инвалидность");
	мСтруктураПредставлениеПолей.Вставить("СтатусУчастникаВОВ", "Статус участника ВОВ");
	мСтруктураПредставлениеПолей.Вставить("ВыплатыПоИЛ", "Получатель по исполнительным листам");
	мСтруктураПредставлениеПолей.Вставить("ИндивидуальныйПредпринимательАдвокатЧастныйНотариус", "Является индивидуальным предпринимателем, адвокатом или частным нотариусом");
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(мСтруктураПредставлениеПолей, ПостроительОтчета);
	
	Если ИзмененВидОтчета Тогда

		// постараемся восстановить сохраненные настройки
		Попытка
			ПостроительОтчета.УстановитьНастройки(СохраненныеНастройкиПостроителя);
		Исключение
		КонецПопытки;
	
	Иначе
		Если НЕ ЗначениеЗаполнено(РежимФормированияОтчета) Тогда
			// по умолчанию строим без детализации, чтобы быстрее формировался
		    РежимФормированияОтчета = "БезДетализации";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь, ПоказыватьПодписи = Ложь) Экспорт

	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.Очистить();

	// подготовка временных вспомогательных переменных
	Макет = ПолучитьМакет("Макет");

	ОбластьЗаголовок = СформироватьЗаголовок(Макет);
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ВысотаЗаголовка = ОбластьЗаголовок.ВысотаТаблицы;

	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область(1,,ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;
	      
    // определим возможные расшифровывающие измерения
    РасшифровкаПоРегистратору = Ложь;
    РасшифровкаПоПериодуВзаиморасчетов = Ложь;
	
	ИзмерениеФизЛицо = ПостроительОтчета.ИзмеренияСтроки.Найти("ФизЛицо");
	Если ИзмерениеФизЛицо = Неопределено Тогда
		ЕстьИзмерениеФизЛицо = Ложь;
	Иначе
		ЕстьИзмерениеФизЛицо = Истина;
	КонецЕсли;
	
	ИзмерениеРегистратор = ПостроительОтчета.ИзмеренияСтроки.Найти("Регистратор");
	ИзмерениеПериодВзаиморасчетов = ПостроительОтчета.ИзмеренияСтроки.Найти("ПериодВзаиморасчетов");
	
	Если РежимФормированияОтчета = "Детальный" Тогда
		
		// обязательно должны быть группировки по физлицу, периоду взаиморасчетов и регистратору
		Если НЕ ЕстьИзмерениеФизЛицо Тогда
			ПостроительОтчета.ИзмеренияСтроки.Добавить("ФизЛицо");
			ЕстьИзмерениеФизЛицо = Истина;
		КонецЕсли;
		
		// добавляем под группировку ФизЛицо группировки по Регистратору и ПериодуВзаиморасчетов,
		// причем для корректной сортировки сначала по ПериодВзаиморасчетов, а потом по Регистратору
		Если ИзмерениеПериодВзаиморасчетов <> Неопределено Тогда
			ПостроительОтчета.ИзмеренияСтроки.Удалить(ИзмерениеПериодВзаиморасчетов);
		КонецЕсли;
		ПостроительОтчета.ИзмеренияСтроки.Добавить("ПериодВзаиморасчетов");
		
		Если ИзмерениеРегистратор <> Неопределено Тогда
			ПостроительОтчета.ИзмеренияСтроки.Удалить(ИзмерениеРегистратор);
		КонецЕсли;
		ПостроительОтчета.ИзмеренияСтроки.Добавить("Регистратор");
		
	Иначе
		// удалим группировки Регистратор и ПериодВзаиморасчетов, т.к. выбран быстрый режим формирования отчета
		Если ИзмерениеПериодВзаиморасчетов <> Неопределено Тогда
			ПостроительОтчета.ИзмеренияСтроки.Удалить(ИзмерениеПериодВзаиморасчетов);
		КонецЕсли;
		
		Если ИзмерениеРегистратор <> Неопределено Тогда
			ПостроительОтчета.ИзмеренияСтроки.Удалить(ИзмерениеРегистратор);
		КонецЕсли;
	
	КонецЕсли;
	
	// определим итоговое состояние группировок, после всех вспомогательных преобразований
	Если ЕстьИзмерениеФизЛицо
			И ПостроительОтчета.ИзмеренияСтроки.Найти("МесяцНалоговогоПериода") <> Неопределено
			И ПостроительОтчета.ИзмеренияСтроки.Найти("ПериодВзаиморасчетов") <> Неопределено
			И (ПостроительОтчета.ИзмеренияСтроки.Найти("Налогоплательщик") <> Неопределено
					Или ПостроительОтчета.ИзмеренияСтроки.Найти("СтруктурнаяЕдиница") <> Неопределено) Тогда
		РасшифровкаПоПериодуВзаиморасчетов = Истина;
	КонецЕсли;

	Если ЕстьИзмерениеФизЛицо
			И ПостроительОтчета.ИзмеренияСтроки.Найти("Регистратор") <> Неопределено Тогда
		РасшифровкаПоРегистратору = Истина;
	КонецЕсли;
	
	// определим общее количество группировок, чтобы потом от него будем вести нумерацию детальных строк
	ОбщееКоличествоГруппировок = 0; 
	ИмяСамойГлубокоВложеннойГруппировки = "";
	Для Н = 0 По ПостроительОтчета.ИзмеренияСтроки.Количество() - 1 Цикл
		ИзмерениеСтроки = ПостроительОтчета.ИзмеренияСтроки[Н];
		Если ИзмерениеСтроки.Имя <> "Регистратор"
				И ИзмерениеСтроки.Имя <> "ПериодВзаиморасчетов" Тогда
				
			ИмяСамойГлубокоВложеннойГруппировки = ИзмерениеСтроки.Имя;
			Если ПустаяСтрока(ИмяСамойГлубокоВложеннойГруппировки) Тогда
				ИмяСамойГлубокоВложеннойГруппировки = ИзмерениеСтроки.ПутьКДанным;
			КонецЕсли;
			ОбщееКоличествоГруппировок = ОбщееКоличествоГруппировок + 1;
		КонецЕсли;
	КонецЦикла;
	
	ДокументРезультат.ФиксацияСлева = 2; // всегда на экране № п/п и наименование

	// определим порядок вывода показателей в отчет
	МассивОбластейШапки = Новый Массив();
	МассивОбластейГруппировки = Новый Массив();
	МассивОбластейСтроки = Новый Массив();
	МассивОбластейРасшифровки = Новый Массив();
	СтруктураСтрокРасшифровки = Новый Структура();
	
	// во все массивы сразу добавим первую область "Начало"
	МассивОбластейШапки.Добавить(Макет.ПолучитьОбласть("ШапкаТаблицы|Начало"));
	МассивОбластейГруппировки.Добавить(Макет.ПолучитьОбласть("Группировка|Начало"));
	МассивОбластейСтроки.Добавить(Макет.ПолучитьОбласть("Строка|Начало"));
	МассивОбластейРасшифровки.Добавить(Макет.ПолучитьОбласть("Расшифровка|Начало"));

	// остальные области добавляем в зависимости от установленного признака вывода соответствующего показателя
	НомерКолонки = МассивОбластейШапки[0].ШиринаТаблицы + 1; // первые колонки -  № п/п и Наименование, таб№ и ИИН, РНН
	Инд = 1;
	Для Каждого Показатель Из Показатели Цикл
		Если Показатель.Использование Тогда
		
			ЕстьДопОбласть = ?(Показатель.Имя <> "УдельныйВес", Истина, Ложь) И РасшифровкаПоРегистратору;
		
			МассивОбластейШапки.Добавить(Макет.ПолучитьОбласть("ШапкаТаблицы|" + Показатель.Имя));
			Если ЕстьДопОбласть Тогда
				МассивОбластейШапки.Добавить(Макет.ПолучитьОбласть("ШапкаТаблицы|" + Показатель.Имя + "1"));	
			КонецЕсли;
			
			МассивОбластейГруппировки.Добавить(Макет.ПолучитьОбласть("Группировка|" + Показатель.Имя));
			Если ЕстьДопОбласть Тогда
				МассивОбластейГруппировки.Добавить(Макет.ПолучитьОбласть("Группировка|" + Показатель.Имя + "1"));
			КонецЕсли;
			
			МассивОбластейСтроки.Добавить(Макет.ПолучитьОбласть("Строка|" + Показатель.Имя));
			Если ЕстьДопОбласть Тогда
				МассивОбластейСтроки.Добавить(Макет.ПолучитьОбласть("Строка|" + Показатель.Имя + "1"));
			КонецЕсли;
			
			МассивОбластейРасшифровки.Добавить(Макет.ПолучитьОбласть("Расшифровка|" + Показатель.Имя));
            Если ЕстьДопОбласть Тогда
				МассивОбластейРасшифровки.Добавить(Макет.ПолучитьОбласть("Расшифровка|" + Показатель.Имя + "1"));
			КонецЕсли;
			
			// для каждой колонки расшифровки храним собственный номер строки, начиная с которой выводятся данные
			СтруктураСтрокРасшифровки.Вставить(Показатель.Имя, Новый Структура("НомерКолонки, НомерСтроки", НомерКолонки, 0)); 
			НомерКолонки = НомерКолонки + МассивОбластейШапки[Инд].ШиринаТаблицы + ?(ЕстьДопОбласть, МассивОбластейШапки[Инд+1].ШиринаТаблицы, 0); 
			Инд = Инд + ?(ЕстьДопОбласть, 2, 1);
		КонецЕсли;
	КонецЦикла;

	Если МассивОбластейШапки.Количество() = 1 Тогда
		Сообщить("Не выбран ни один показатель для вывода в отчет!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;

	// для правильного расчета остатков на начало и конец первого/последнего месяца для расчета удельного веса
	// проверим наличие среди ИТОГов МесяцаНалоговогоПериода
	ТекстЗапросаБылИзменен = Ложь;
	Если ПостроительОтчета.ИзмеренияСтроки.Найти("МесяцНалоговогоПериода") = Неопределено Тогда
		// сохраним текущие настройки построителя
		НастрокиПостроителя = ПостроительОтчета.ПолучитьНастройки(Истина, Истина, Истина, Истина);
		
		ПостроительОтчета.Текст = СтрЗаменить(ПостроительОтчета.Текст, "(МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ", "ИСТИНА//ОСОБЫЙ_ИТОГ");
		
		ТекстЗапросаБылИзменен = Истина;
		
		// восстановим прежние настройки
		ПостроительОтчета.УстановитьНастройки(НастрокиПостроителя, Истина, Истина, Истина, Истина);
	КонецЕсли;
	
	// установим параметры запроса
	ПостроительОтчета.Параметры.Вставить("ДатаНач", НачалоМесяца(ДатаНач));
	ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецМесяца(ДатаКон));

	СписокВидовПлатежей = Новый Массив();
	СписокВидовПлатежей.Добавить(Перечисления.ВидыПлатежейВБюджетИФонды.Налог);
	СписокВидовПлатежей.Добавить(Перечисления.ВидыПлатежейВБюджетИФонды.НалогАкт);
	СписокВидовПлатежей.Добавить(Перечисления.ВидыПлатежейВБюджетИФонды.НалогСам);
	ПостроительОтчета.Параметры.Вставить("парамВидыПлатежей", СписокВидовПлатежей);
	
	ПостроительОтчета.Параметры.Вставить("ВключитьИП", ВключитьИП);
	ПостроительОтчета.Параметры.Вставить("ВключитьПолучателейАлиментов", ВключитьПолучателейАлиментов);

	// передадим в запрос параметрами какие показатели используются, чтобы не обращаться к лишним таблицам
	Для Каждого Показатель Из Показатели Цикл
		ПостроительОтчета.Параметры.Вставить(Показатель.Имя, Показатель.Использование);
	КонецЦикла;

	// формирование отчета
	Состояние("Получение данных...");
	ПостроительОтчета.Выполнить();

	РезультатЗапроса = ПостроительОтчета.Результат;
	
	// восстановим первоначальный текст запроса построителя
	Если ТекстЗапросаБылИзменен Тогда
		// сохраним текущие настройки построителя
		НастрокиПостроителя = ПостроительОтчета.ПолучитьНастройки(Истина, Истина, Истина, Истина);
		
		ПостроительОтчета.Текст = СтрЗаменить(ПостроительОтчета.Текст, "ИСТИНА//ОСОБЫЙ_ИТОГ", "(МесяцНалоговогоПериода ЕСТЬ NULL)//ОСОБЫЙ_ИТОГ");
		
		ТекстЗапросаБылИзменен = Ложь;
		
		// восстановим прежние настройки
		ПостроительОтчета.УстановитьНастройки(НастрокиПостроителя, Истина, Истина, Истина, Истина);
		УправлениеОтчетами.ЗаполнитьПредставленияПолей(мСтруктураПредставлениеПолей, ПостроительОтчета);
	КонецЕсли;
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Нет данных!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;

	ТаблДокументРасшифровка = Новый ТабличныйДокумент;
	ТаблДокументРасшифровкаПустышка = Новый ТабличныйДокумент;

	// выводим строки-пустышек расшифровки, первоначально 20, потом если понадобиться больше - еще выведем
	МаксКоличествоЗаписейВПустышке = 20;
	Для Н = 1 По МаксКоличествоЗаписейВПустышке Цикл
		Для Инд = 1 По МассивОбластейРасшифровки.Количество() Цикл
			ТекущаяОбласть = МассивОбластейРасшифровки[Инд - 1];
			Если Инд = 1 Тогда
				ТаблДокументРасшифровкаПустышка.Вывести(ТекущаяОбласть);
			Иначе
				ТаблДокументРасшифровкаПустышка.Присоединить(ТекущаяОбласть);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	// шапка таблицы
	ВысотаДокументаДоШапки = ДокументРезультат.ВысотаТаблицы;
	Инд = 0;
	Пока Инд < МассивОбластейШапки.Количество() Цикл
		Если Инд = 0 Тогда
			ДокументРезультат.Вывести(МассивОбластейШапки[Инд]);
		ИначеЕсли МассивОбластейШапки[Инд].ШиринаТаблицы = 1 Тогда
			// первую колонку из области выводим как суммовое поле, вторую - как расшифровку
			ДокументРезультат.Присоединить(МассивОбластейШапки[Инд]);
			Если РасшифровкаПоРегистратору Тогда
				ДокументРезультат.НачатьГруппуКолонок(, Ложь);
				ДокументРезультат.Присоединить(МассивОбластейШапки[Инд+1]);
				ДокументРезультат.ЗакончитьГруппуКолонок();
				Инд = Инд + 1;
			КонецЕсли;
		Иначе
			// область колонок "Удельный вес"
			ДокументРезультат.Присоединить(МассивОбластейШапки[Инд]);
		КонецЕсли;
		Инд = Инд + 1;
	КонецЦикла;
	ДокументРезультат.ФиксацияСверху = ДокументРезультат.ВысотаТаблицы;
	ДокументРезультат.ПовторятьПриПечатиСтроки = ДокументРезультат.Область(ВысотаДокументаДоШапки, , ДокументРезультат.ВысотаТаблицы);

	// тело отчета
	Выборка = РезультатЗапроса.Выбрать();
	УровеньПредыдущейЗаписи = 0;
	КоличествоОткрытыхГруппировок = 0;
	ПредыдущееЗначениеГруппировки = NULL;
	СтрокаФормата = "ЧЦ=15; ЧДЦ=2; ЧРГ=";
	УдельныйВесРассчитывался = Ложь;
	НомерПП = 0;
	ПервыйВыведенныйНалогоплательщик = Неопределено;
	ПерваяВыведеннаяОрганизация = Неопределено;
	ПерваяВыведеннаяСтруктурнаяЕдиница = Неопределено;
	
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ТипЗаписи()  <> ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			
			ИмяТекущейГруппировки = Выборка.Группировка();
			
			Если Выборка.ТипЗаписи() <> ТипЗаписиЗапроса.ОбщийИтог Тогда
				ЗначениеТекущейГруппировки = Выборка[ИмяТекущейГруппировки];
			Иначе
				ЗначениеТекущейГруппировки = NULL;
			КонецЕсли;

			// для группировок, связанных с налогоплательщиком, структурной единицей и организацией, 
			// запомним значение первого встретившегося значения, чтобы потом использовать его реквизиты для шапки отчета
			
			Если Найти(ВРег(ИмяТекущейГруппировки), "НАЛОГОПЛАТЕЛЬЩИК") > 0 Тогда
				Если НЕ ЗначениеЗаполнено(ПервыйВыведенныйНалогоплательщик) Тогда
					ПервыйВыведенныйНалогоплательщик = ЗначениеТекущейГруппировки;
				КонецЕсли;
			КонецЕсли;
			
			Если Найти(ВРег(ИмяТекущейГруппировки), "СТРУКТУРНАЯЕДИНИЦА") > 0 Тогда
				Если НЕ ЗначениеЗаполнено(ПерваяВыведеннаяСтруктурнаяЕдиница) Тогда
					ПерваяВыведеннаяСтруктурнаяЕдиница = ЗначениеТекущейГруппировки;
				КонецЕсли;
			КонецЕсли;

			Если Найти(ВРег(ИмяТекущейГруппировки), "ОРГАНИЗАЦИЯ") > 0 Тогда
				Если НЕ ЗначениеЗаполнено(ПерваяВыведеннаяОрганизация) Тогда
					ПерваяВыведеннаяОрганизация = ЗначениеТекущейГруппировки;
				КонецЕсли;
			КонецЕсли;
			
			Если ИмяТекущейГруппировки <> "Регистратор" 
					И ИмяТекущейГруппировки <> "ПериодВзаиморасчетов" Тогда
				
				Если РасшифровкаПоРегистратору ИЛИ РасшифровкаПоПериодуВзаиморасчетов Тогда
				
					Если ПредыдущееЗначениеГруппировки <> NULL  Тогда
					
						Если ПредыдущееЗначениеГруппировки <> ЗначениеТекущейГруппировки 
								И ТаблДокументРасшифровка.ВысотаТаблицы <> 0 Тогда
							// выводим расшифровку по предыдущему значению группировки - столько строк, сколько реально использовали
							МаксНомерСтроки = 0;
							Для Каждого СтрокаРасшифровки Из СтруктураСтрокРасшифровки Цикл
								МаксНомерСтроки = Макс(МаксНомерСтроки, СтрокаРасшифровки.Значение.НомерСтроки);
							Конеццикла;
							Если МаксНомерСтроки > 0 Тогда
								ДокументРезультат.НачатьГруппуСтрок(, Ложь);
								ДокументРезультат.Вывести(ТаблДокументРасшифровка.ПолучитьОбласть(1, , МаксНомерСтроки));
								ДокументРезультат.ЗакончитьГруппуСтрок();
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;

					Если ИмяТекущейГруппировки = ИмяСамойГлубокоВложеннойГруппировки Тогда

						// очищаем текущий вспомогательный документ-расшифровку
						ТаблДокументРасшифровка.Очистить();
						Для Каждого СтрокаРасшифровки Из СтруктураСтрокРасшифровки Цикл
							СтрокаРасшифровки.Значение.НомерСтроки = 0;
						КонецЦикла;
						
						// при необходимости увеличим число строки для расшифровки сразу в пустышке
						МаксКоличествоЗаписей = Макс(?(Выборка.КоличествоЗаписей = NULL, 0, Выборка.КоличествоЗаписей*2), МаксКоличествоЗаписейВПустышке);
						Для Н = МаксКоличествоЗаписейВПустышке + 1 По МаксКоличествоЗаписей Цикл
							Для Инд = 1 По МассивОбластейРасшифровки.Количество() Цикл
								ТекущаяОбласть = МассивОбластейРасшифровки[Инд - 1];
								Если Инд = 1 Тогда
									ТаблДокументРасшифровкаПустышка.Вывести(ТекущаяОбласть);
								Иначе
									ТаблДокументРасшифровкаПустышка.Присоединить(ТекущаяОбласть);
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
						МаксКоличествоЗаписейВПустышке = МаксКоличествоЗаписей;

						// копируем пустышку в документ для расшифровки
						ТаблДокументРасшифровка.Вывести(ТаблДокументРасшифровкаПустышка);
						
						// очистим массивы областей-расшифровок
						Для Инд = 1 По МассивОбластейРасшифровки.Количество() Цикл
							ПараметрыОбласти = МассивОбластейРасшифровки[Инд-1].Параметры;
							Для Н = 1 По ПараметрыОбласти.Количество() Цикл
								ПараметрыОбласти.Установить(Н - 1, "");
							КонецЦикла;
						КонецЦикла;
						
						ПредыдущееЗначениеГруппировки = ЗначениеТекущейГруппировки;
						Состояние(Выборка.ФизЛицоПредставление);
					Иначе
						ПредыдущееЗначениеГруппировки = NULL;
					КонецЕсли;

				КонецЕсли; // Если РасшифровкаПоРегистратору ИЛИ РасшифровкаПоПериодуВзаиморасчетов Тогда
			
				// закроем ранее открытые группировки, если сменился уровень записи
				// самые глубоко вложенные группировки - нумеруем по порядку
				УровеньТекущейЗаписи = Выборка.Уровень();
				
				ВыводитьНомерПП = Ложь;
				Если УровеньТекущейЗаписи = ОбщееКоличествоГруппировок Тогда
					ВыводитьНомерПП = Истина;
					НомерПП = НомерПП + 1;
				КонецЕсли;
				
				Если УровеньТекущейЗаписи < УровеньПредыдущейЗаписи Тогда
					РазностьУровней = УровеньТекущейЗаписи - УровеньПредыдущейЗаписи;
					Пока РазностьУровней < 0 И КоличествоОткрытыхГруппировок > 0 Цикл
						ДокументРезультат.ЗакончитьГруппуСтрок();
						КоличествоОткрытыхГруппировок = КоличествоОткрытыхГруппировок - 1;
						РазностьУровней = РазностьУровней + 1;
					КонецЦикла;
				ИначеЕсли УровеньТекущейЗаписи > УровеньПредыдущейЗаписи Тогда
					ДокументРезультат.НачатьГруппуСтрок();				
					КоличествоОткрытыхГруппировок = КоличествоОткрытыхГруппировок + 1;
				КонецЕсли;
				УровеньПредыдущейЗаписи = УровеньТекущейЗаписи;
			
				Если ИмяТекущейГруппировки = ИмяСамойГлубокоВложеннойГруппировки Тогда
					МассивОбластей = МассивОбластейСтроки;
				Иначе
					МассивОбластей = МассивОбластейГруппировки;
				КонецЕсли;
				
				// вывод всех отмеченных областей
				Для Инд = 1 По МассивОбластей.Количество() Цикл
					ТекущаяОбласть = МассивОбластей[Инд - 1];
					ТекущаяОбласть.Параметры.Заполнить(Выборка);
					Если Инд = 1 Тогда
						// номер по порядку
						Если ВыводитьНомерПП Тогда
							ТекущаяОбласть.Параметры.НомерПП = НомерПП;
						Иначе
							ТекущаяОбласть.Параметры.НомерПП = 0;
						КонецЕсли;
						
						Если ЗначениеТекущейГруппировки = NULL Тогда // ИТОГИ ПО ОБЩИЕ
							ТекущаяОбласть.Параметры.Измерение = "Итого";
						ИначеЕсли ТипЗнч(Выборка[ИмяТекущейГруппировки]) = Тип("Дата") Тогда
							ТекущаяОбласть.Параметры.Измерение = Формат(Выборка[ИмяТекущейГруппировки], "ДФ='ММММ гггг'");
						ИначеЕсли РезультатЗапроса.Колонки.Найти(ИмяТекущейГруппировки + "Представление") <> Неопределено Тогда
							ТекущаяОбласть.Параметры.Измерение = Выборка[ИмяТекущейГруппировки + "Представление"];
						Иначе
							ТекущаяОбласть.Параметры.Измерение = ЗначениеТекущейГруппировки;
						КонецЕсли;
						ТекущаяОбласть.Параметры.ИзмерениеРасшифровка = ЗначениеТекущейГруппировки;
						ДокументРезультат.Вывести(ТекущаяОбласть);
					Иначе
						ДокументРезультат.Присоединить(ТекущаяОбласть);
					КонецЕсли;
				КонецЦикла;
			
			ИначеЕсли ИмяТекущейГруппировки = "Регистратор"
						И РасшифровкаПоРегистратору Тогда // дополнительный разворот используется как детализация отдельных граф 
				
				Если Выборка.Регистратор <> NULL Тогда // если разворот - документ регистратор
					
					Для Каждого СтрокаРасшифровки Из СтруктураСтрокРасшифровки Цикл
						Если СтрокаРасшифровки.Ключ <> "УдельныйВес" Тогда
							Величина = Выборка[СтрокаРасшифровки.Ключ];
							Если Величина <> 0 Тогда
								СтрокаРасшифровки.Значение.НомерСтроки = СтрокаРасшифровки.Значение.НомерСтроки + 1;
								
								ТекущаяОбласть = ТаблДокументРасшифровка.Область(СтрокаРасшифровки.Значение.НомерСтроки, СтрокаРасшифровки.Значение.НомерКолонки);
								ТекущаяОбласть.Текст = Формат(Величина, СтрокаФормата);
								
								ТекущаяОбласть = ТаблДокументРасшифровка.Область(СтрокаРасшифровки.Значение.НомерСтроки, СтрокаРасшифровки.Значение.НомерКолонки + 1);
								ТекущаяОбласть.Текст = Выборка.РегистраторПредставление;
								ТекущаяОбласть.Расшифровка = Выборка.Регистратор;
								
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			ИначеЕсли ИмяТекущейГруппировки = "ПериодВзаиморасчетов"
						И РасшифровкаПоПериодуВзаиморасчетов 
						И Выборка.ПериодВзаиморасчетов <> NULL
						И СтруктураСтрокРасшифровки.Свойство("УдельныйВес") Тогда // расшифровка используется для области "УдельныйВес"
				
				// определим, выводили ли уже такой месяц
				СтрокаРасшифровки = СтруктураСтрокРасшифровки.УдельныйВес;
				НомерКолонки = СтрокаРасшифровки.НомерКолонки;
				
				НомерСтроки = 0;
				Для Инд = 1 По СтрокаРасшифровки.НомерСтроки Цикл
					Если ТаблДокументРасшифровка.Область(НомерКолонки, Инд).Расшифровка = Выборка.ПериодВзаиморасчетов Тогда
						НомерСтроки = Инд + 1; // на первой строке выводим название месяца, на второй - данные за месяц
						Прервать;
					КонецЕсли;
				КонецЦикла;
			
				Если НомерСтроки = 0 Тогда // такой месяц еще не встречался - выводим
					НомерСтроки = СтрокаРасшифровки.НомерСтроки + 1;
					СтрокаРасшифровки.НомерСтроки = СтрокаРасшифровки.НомерСтроки + 2;
					ТекущаяОбласть = ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки + 12);
					ТекущаяОбласть.Объединить();
					ТекущаяОбласть.Текст = " за " + УправлениеОтчетами.ПолноеОписаниеПериода(НачалоМесяца(Выборка.ПериодВзаиморасчетов), КонецМесяца(Выборка.ПериодВзаиморасчетов), Ложь);
					ТекущаяОбласть.Расшифровка = Выборка.ПериодВзаиморасчетов;
					ТекущаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
					ТекущаяОбласть.ЦветФона = WindowsЦвета.Подсказка;
					НомерСтроки = НомерСтроки + 1;
				КонецЕсли;
				
				// выводим все ячейки за соответствующий месяц
				
				// выплаченные доходы
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки).Текст = Формат(Выборка.ЗадолженностьПоДоходамНаНачало, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 1).Текст = Формат(Выборка.ДоходКВыплате, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 2).Текст = Формат(Выборка.ВыплаченоДоходов, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 3).Текст = Формат(Выборка.ЗадолженностьПоДоходамНаКонец, СтрокаФормата);
				
				Если Выборка.ЗадолженностьПоДоходамНаНачало + Выборка.ДоходКВыплате <> 0 Тогда
					УдельныйВес = Выборка.ВыплаченоДоходов / (Выборка.ЗадолженностьПоДоходамНаНачало + Выборка.ДоходКВыплате);
				Иначе
					УдельныйВес = 0;
				КонецЕсли;					
				УдельныйВесРассчитывался = Истина;
				
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 4).Текст = Формат(УдельныйВес, "ЧЦ=15; ЧДЦ=6; ЧРГ=");
				
				// Расчет суммы ИПН, подлежащей перечислению
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 5).Текст = Формат(Выборка.ЗадолженностьПоИПННаНачало, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 6).Текст = Формат(Выборка.ИндивидуальныйПодоходныйНалог, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 7).Текст = Формат(Выборка.СуммаИПНПодлежащегоПеречислению, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 8).Текст = Формат(Выборка.ЗадолженностьПоИПННаКонец, СтрокаФормата);
				
				// Расчет суммы ОПВ, подлежащей перечислению
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 9).Текст = Формат(Выборка.ЗадолженностьПоОПВНаНачало, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 10).Текст = Формат(Выборка.ОбязательныеПенсионныеВзносы, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 11).Текст = Формат(Выборка.СуммаОПВПодлежащихПеречислению, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 12).Текст = Формат(Выборка.ЗадолженностьПоОПВНаКонец, СтрокаФормата);
				
				// Расчет суммы ВОСМС, подлежащей перечислению
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 13).Текст = Формат(Выборка.ЗадолженностьПоВОСМСНаНачало, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 14).Текст = Формат(Выборка.ВОСМС, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 15).Текст = Формат(Выборка.СуммаВОСМСПодлежащихПеречислению, СтрокаФормата);
				ТаблДокументРасшифровка.Область(НомерСтроки, НомерКолонки + 16).Текст = Формат(Выборка.ЗадолженностьПоВОСМСНаКонец, СтрокаФормата);

			КонецЕсли;
			
		КонецЕсли; // Если Выборка.ТипЗаписи()  <> ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
		
		ОбработкаПрерыванияПользователя();
		
	КонецЦикла; // Пока Выборка.Следующий() Цикл

	// завершим расшифровку по предыдущему значению группировки
	Если РасшифровкаПоРегистратору Или РасшифровкаПоПериодуВзаиморасчетов Тогда
		Если ТаблДокументРасшифровка.ВысотаТаблицы <> 0 Тогда
			МаксНомерСтроки = 0;
			Для Каждого НомерСтрокиРасшифровки Из СтруктураСтрокРасшифровки Цикл
				МаксНомерСтроки = Макс(МаксНомерСтроки, НомерСтрокиРасшифровки.Значение.НомерСтроки);
			Конеццикла;
			Если МаксНомерСтроки > 0 Тогда
				ДокументРезультат.НачатьГруппуСтрок(, Ложь);
				ДокументРезультат.Вывести(ТаблДокументРасшифровка.ПолучитьОбласть(1, , МаксНомерСтроки));
				ДокументРезультат.ЗакончитьГруппуСтрок();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// закроем все открытые группы
	Пока КоличествоОткрытыхГруппировок > 0 Цикл
		ДокументРезультат.ЗакончитьГруппуСтрок();
		КоличествоОткрытыхГруппировок = КоличествоОткрытыхГруппировок - 1;
	КонецЦикла;

	Если СтруктураСтрокРасшифровки.Свойство("УдельныйВес") И Не УдельныйВесРассчитывался Тогда
		// удельный вес считается в разрезе периодов взаиморасчетов, если такую группировку не использовали,
		// то вес не считали, поэтому удалим пустую колонку
		НомерКолонки = СтруктураСтрокРасшифровки.УдельныйВес.НомерКолонки + 4; 
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(, НомерКолонки, , НомерКолонки), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;

	// если не выводятся РНН/табельный номер, то удалим соответствующие столбцы
	Если Не ВыводитьРНН Или Не ЕстьИзмерениеФизЛицо Тогда
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(, 5, , 5), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	// если не выводятся ИИН/табельный номер, то удалим соответствующие столбцы
	Если Не ВыводитьИИН Или Не ЕстьИзмерениеФизЛицо Тогда
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(, 4, , 4), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	Если Не ВыводитьТабельныйНомер Или Не ЕстьИзмерениеФизЛицо Тогда
		ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(, 3, , 3), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	// пронумеруем графы после всех преобразований
	НомерСледущейГрафы = 0;
	Для Н = 1 По ДокументРезультат.ШиринаТаблицы Цикл
		ЯчейкаНомераШапки = ДокументРезультат.Область(ВысотаДокументаДоШапки + 3, Н);
		Если ЯчейкаНомераШапки.Текст = "НомерГрафы" Тогда
			НомерСледущейГрафы = НомерСледущейГрафы + 1;
			ЯчейкаНомераШапки.Текст = Формат(НомерСледущейГрафы, "ЧГ=");
		КонецЕсли;
	КонецЦикла;
	
	// Подписи выводим всегда, потом в форме если кнопка "Подписи" отжата, то скроется.
	// Делаем так, чтобы можно было включать/отключать подписи без переформирования всей остальной ведомости.
	
	ОсновнойНалогоплательщик = ОпределитьОсновногоНалогоплательщика(ПервыйВыведенныйНалогоплательщик,
																	ПерваяВыведеннаяОрганизация,
																	ПерваяВыведеннаяСтруктурнаяЕдиница);
	Если ЗначениеЗаполнено(ОсновнойНалогоплательщик) Тогда
		СведенияОНалогоплательщике = ОбщегоНазначения.СведенияОЮрФизЛице(ОсновнойНалогоплательщик, ДатаКон);
		ДокументРезультат.Области.БИН_ИИН.Текст = СведенияОНалогоплательщике.БИН_ИИН;
		ДокументРезультат.Области.НаименованиеНалогоплательщика.Текст = СведенияОНалогоплательщике.ПолноеНаименование;
	КонецЕсли;
																	
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");

	ОтветЛица = ОбщегоНазначения.ОтветственныеЛицаОрганизаций(ОсновнойНалогоплательщик, ДатаКон, глЗначениеПеременной("глТекущийПользователь").ФизЛицо);
	ОбластьПодписи.Параметры.Заполнить(ОтветЛица);
	ДокументРезультат.Вывести(ОбластьПодписи);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, "Регистр налогового учета по индивидуальному подоходному налогу и социальному налогу", Строка(глЗначениеПеременной("глТекущийПользователь")));
КонецПроцедуры

// Формирует табличку-заголовок
//
Функция СформироватьЗаголовок(МакетОтчета)

	// Формирование макета заголовка отчета
	ЗаголовокОтчета = МакетОтчета.ПолучитьОбласть("Заголовок");

	Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда
		ОписаниеПериода     = "Период не установлен";

	Иначе
		Если ДатаНач = '00010101000000' ИЛИ ДатаКон = '00010101000000' Тогда
			ОписаниеПериода = "" + Формат(ДатаНач, "ДФ = ""дд.ММ.гггг""; ДП = ""...""") 
			+ " - "      + Формат(ДатаКон, "ДФ = ""дд.ММ.гггг""; ДП = ""...""");

		Иначе
			Если ДатаНач <= ДатаКон Тогда
				ОписаниеПериода = "" + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "ФП = Истина");
			Иначе
				ОписаниеПериода = "Неправильно задан период!"
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
		
	СписокОтбор = "";
	Для Сч=0 По ПостроительОтчета.Отбор.Количество()-1 Цикл

		Если ПостроительОтчета.Отбор[Сч].Имя = "Налогоплательщик" Тогда
			Продолжить;
		КонецЕсли;

		Если ПостроительОтчета.Отбор[Сч].Использование И Не ПостроительОтчета.Отбор[Сч].Имя = "Периодичность" Тогда

			СписокОтбор = СписокОтбор +", "+ ПостроительОтчета.Отбор[Сч].Представление 
			+" "+ ПостроительОтчета.Отбор[Сч].ВидСравнения +" ";
			
			ТекущийВидСравнения = ПостроительОтчета.Отбор[Сч].ВидСравнения;
			
			Если 
				ТекущийВидСравнения = ВидСравнения.Интервал Или 
				ТекущийВидСравнения = ВидСравнения.ИнтервалВключаяГраницы Или 
				ТекущийВидСравнения = ВидСравнения.ИнтервалВключаяНачало Или 
				ТекущийВидСравнения = ВидСравнения.ИнтервалВключаяОкончание Тогда
				СписокОтбор = СписокОтбор + ПостроительОтчета.Отбор[Сч].ЗначениеС + " - " + ПостроительОтчета.Отбор[Сч].ЗначениеПо;								
			Иначе
				СписокОтбор = СписокОтбор + ПостроительОтчета.Отбор[Сч].Значение;
			КонецЕсли;
			
		КонецЕсли; 
	
	КонецЦикла; 

	ЗаголовокОтчета.Параметры.Период     = ОписаниеПериода;
	ЗаголовокОтчета.Параметры.Отбор      = ?(ПустаяСтрока(СписокОтбор), "Отбор:"    +Сред(СписокОтбор,2), "");

	Возврат ЗаголовокОтчета;
КонецФункции // СформироватьЗаголовок()

//////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ОБЪЕКТА 

мПоддержкаРаботыСоСтруктурнымиПодразделениями = Константы.ПоддержкаРаботыСоСтруктурнымиПодразделениями.Получить();
мСтруктураПредставлениеПолей = Новый Структура();

#КонецЕсли
