// Процедура - обработчик нажатия любой из дополнительных кнопок печати
// Параметры:
//    Форма       : Форма, вызвавшая процедуру
//Процедура ПечатьПоДополнительнойКнопке(ДеревоМакетов, Объект, Форма, ТекстКнопки) Экспорт
Процедура ПечатьПоДополнительнойКнопкеСервер(Объект) Экспорт
	Попытка 
		ФормаОбработкиОбменаДаннымиПоОрганизацииИДокументами = ПолучитьФорму("Обработка.ОбменДаннымиПоОрганизацииИДокументами.Форма");
		Если ФормаОбработкиОбменаДаннымиПоОрганизацииИДокументами.Открыта() Тогда
			СписокОткрытыхОбектов = ФормаОбработкиОбменаДаннымиПоОрганизацииИДокументами.ЭтотОбъект.мСписокОткрытыхОбъектов;
			Если СписокОткрытыхОбектов.НайтиПоЗначению(Объект) <> Неопределено Тогда
				Сообщить("Печать документов, загруженных обработкой ""Обмен данными(по организации) и документами"" запрещена!", СтатусСообщения.Важное);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция ПечатьПоДополнительнойКнопкеСервер2(Объект,ТекстКнопки,ЗаголовокДокумента)
	Попытка
		СтруктураВнутреннихПечатныхФорм = Объект.ПолучитьСтруктуруПечатныхФорм()
	Исключение
		СтруктураВнутреннихПечатныхФорм = Новый Структура;
	КонецПопытки;
	СтрокаКнопки = куфиб_УниверсальныеМеханизмыПечатиСервер.ПолучитСтрокиДереваМакетов(Объект.Ссылка, СтруктураВнутреннихПечатныхФорм,ТекстКнопки);
	Если СтрокаКнопки = Неопределено Тогда
		куфиб_ОбщегоНазначения.СообщитьПользователю("Печать не доступна. Изменился набор реквизитов!");
		Возврат неопределено;
	КонецЕсли; 
	НаПринтер = куфиб_ОбщегоНазначения.ПолучитьЗначениеПоУмолчанию(ПользователиКлиентСервер.ТекущийПользователь(), "ПечатьДокументовБезПредварительногоПросмотра") = Истина;
	Если ТипЗнч(СтрокаКнопки) = Тип("Структура") Тогда
		ТабДокумент = ПолучитьИзВременногоХранилища(куфиб_УниверсальныеМеханизмыПечатиСервер.НапечататьВнешнююФорму(Объект.Ссылка, СтрокаКнопки));
		Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.НематериальныеАктивы") ИЛИ ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			//НапечататьДокумент(ТабДокумент, , НаПринтер, ,Объект.Ссылка);
			общ_ОбщегоНазначенияКлиент.НапечататьДокумент(ТабДокумент, , НаПринтер, ,Объект.Ссылка);
		Иначе
			//НапечататьДокумент(ТабДокумент, , НаПринтер, ЗаголовокДокумента,Объект.Ссылка);
			общ_ОбщегоНазначенияКлиент.НапечататьДокумент(ТабДокумент, , НаПринтер, ЗаголовокДокумента,Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
Возврат Неопределено;
КонецФункции

// Выводит на печать подготовленный макет 
//
// Параметры:
//  ПечДокумент           - ТабличыйДокумент, макет на печать,
//  КоличествоЭкземпляров - Число, количество экземпляров на печать,
//  НаПринтер             - Булево, Если истина, то выводим сразу на принтер.
//  Заголовок             - Заголовок окна табличного документа
//
Процедура НапечататьДокумент(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", Ссылка = Неопределено) Экспорт
	ЗащитаТаблиц = куфиб_ОбщегоНазначения.ЗащитаТаблиц();
	Если ПечДокумент = Неопределено тогда
		Возврат; 
	КонецЕсли;
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров < 1 Тогда
		ПечДокумент.КоличествоЭкземпляров = 1;
	Иначе
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	Если НЕ ПечДокумент.АвтоМасштаб
	   И НЕ ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;
	Если НаПринтер Тогда
		ПечДокумент.Напечатать();
	Иначе
		// Отобразить печатный документ на экране
		Попытка
			ФормаПечати = ПолучитьФорму("ОбщаяФорма.фин_ПечатьДокументов",,);
			//ФормаПечати = ПолучитьФорму("ОбщаяФорма.ПечатьДокументов",, Новый УникальныйИдентификатор);
			//ФормаПечати = ПолучитьФорму("ОбщаяФорма.общ_ФормаОтчетов",, Новый УникальныйИдентификатор);
			ФормаПечати.ОбъектПечати     = Ссылка;
			ФормаПечати.ПечатныйДокумент = ПечДокумент;
			ФормаПечати.Заголовок        = Заголовок;
			ФормаПечати.Защита           = ЗащитаТаблиц;
			ФормаПечати.Открыть();
			// сохраним ссылку на последнюю открытую форму печати в глобальной переменной, 
			// чтобы потом к ней можно было программно обращаться
			//финЗначениеПеременнойУстановить("глПоследняяОткрытаяФормаПечатьДокументов", ФормаПечати);
		Исключение
			ПечДокумент.ОтображатьЗаголовки = Ложь;
			ПечДокумент.ОтображатьСетку     = Ложь;
			ПечДокумент.Защита              = ЗащитаТаблиц;
			ПечДокумент.ТолькоПросмотр      = Истина;
			ПечДокумент.Показать(Заголовок);
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры // НапечататьДокумент()

Процедура ПечатьПоДополнительнойКнопке(Знач Объект,ТекстКнопки) Экспорт
	ПечатьПоДополнительнойКнопкеСервер(Объект);
	ЗаголовокДокумента = "";
	ПечатьПоДополнительнойКнопкеСервер2(Объект,ТекстКнопки, ЗаголовокДокумента);
КонецПроцедуры // ПечатьПоДополнительнойКнопке()

Процедура ОсновныеДействияФормыПечатьПоУмолчаниюСервер(Адрес,Знач Объект,Заголовок) Экспорт
	ПечатьПоДополнительнойКнопке(Объект,Заголовок);
КонецПроцедуры // ОсновныеДействияФормыПечатьПоУмолчанию()
