
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ТекущийОбъект.Профиль) И ЗначениеЗаполнено(ТекущийОбъект.Пользователь) Тогда
		Если ТекущийОбъект.Профиль.ВидПрофиляДоступа = Перечисления.общ_ВидыПрофилейДоступа.РолиИнформационнойБазы Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	общ_СоставПрофилейДоступа.Профиль
				|ИЗ
				|	РегистрСведений.общ_СоставПрофилейДоступа КАК общ_СоставПрофилейДоступа
				|ГДЕ
				|	общ_СоставПрофилейДоступа.Пользователь = &Пользователь
				|	И общ_СоставПрофилейДоступа.Профиль <> &Профиль";

			Запрос.УстановитьПараметр("Пользователь", 	ТекущийОбъект.Пользователь);
			Запрос.УстановитьПараметр("Профиль", 		ТекущийОбъект.Профиль);

			Результат = Запрос.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				Отказ = Истина;
				куфиб_ОбщегоНазначения.СообщитьПользователю("Пользователь уже включен в профиль доступа:");
			КонецЕсли;

			ВыборкаДетальныеЗаписи = Результат.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				куфиб_ОбщегоНазначения.СообщитьПользователю(Строка(ВыборкаДетальныеЗаписи.Профиль));
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Профиль.ВидПрофиляДоступа = Перечисления.общ_ВидыПрофилейДоступа.РолиИнформационнойБазы Тогда
		общ_УправлениеПрофилямиДоступа.ПрименитьПараметрыПрофиляДоступаКИнформационнойБазе(ТекущийОбъект.Пользователь,ТекущийОбъект.Профиль);
	КонецЕсли;
КонецПроцедуры
