
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВсеРазрезы = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ВсеРазрезы();
	АктивныеРазрезы = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПолучитьПолныйСписокРазрезов();
	Для Каждого Разрез Из ВсеРазрезы Цикл
		Если Разрез = "Номенклатура" Тогда
			Продолжить;
		КонецЕсли;
		Элементы[Разрез].Видимость = АктивныеРазрезы.НайтиПоЗначению(Перечисления.фин_ФактическиеПоказателиБюджетирования[Разрез])<>Неопределено;
		Элементы[Разрез].Заголовок = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПредставлениеРазреза(Перечисления.фин_ФактическиеПоказателиБюджетирования[Разрез]);
	КонецЦикла;
КонецПроцедуры
