
&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ПоставщикПриИзмененииНаСервере();
КонецПроцедуры

Процедура ПоставщикПриИзмененииНаСервере()	
	
	ЦС_ОбщийПереопределяемый.УстановитьБанковскийСчет(Объект.СчетКонтрагента, Объект.Поставщик, ЦС_ОбщегоНазначенияКлиентСерверПовтИсп.ВалютаРегУчета());

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.СтруктурноеПодразделение = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Док = РеквизитФормыВЗначение("Объект");
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	Элементы.Организация.ТолькоПросмотр = Не УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ЦС_ОбщегоНазначенияКлиентСерверПовтИсп.ТекущийПользователь(), "УчетПоВсемОрганизациям");
	Если ЦС_ОбщегоНазначенияКлиентСерверПовтИсп.ПолучитьПризнакОтображенияСтруктурныхПодразделений() Тогда
		Элементы.СтруктурноеПодразделение.Видимость = Истина;
	КонецЕсли;

//	НастройкаПравДоступа.УстановитьДоступностьФормыДляРедактирования(Док, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьГарантияНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
//	ЦС_ОбщийПереопределяемый.ОткрытьГарантию(ЭтаФорма, цс_ГарантияФЗ);
    СтандартнаяОбработка = Ложь;

	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) ИЛИ Модифицированность Тогда
		ОбъектЗаписан = Записать();
		
		Если НЕ ОбъектЗаписан Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(цс_ГарантияФЗ) Тогда
		Параметры = Новый Структура("Ключ", цс_ГарантияФЗ);
	Иначе
		Если Объект.ПометкаУдаления Тогда
			Предупреждение(НСтр("ru = 'Гарантию нельзя вводить на основании документа, помеченного на удаление.'"));
			Возврат;
		КонецЕсли;

		ПараметрыФормы = Новый Структура("Основание", Параметры.Ключ);
	КонецЕсли;
	
	ФормаСФ = ОткрытьФорму("Документ.цс_ГарантияФЗ.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
		
	ЗаполнитьТекстПроГарантию(ЭтаФорма);	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТекстПроГарантию(Форма)
	
	Объект = Форма.Объект;
	ЗаполнитьЗначенияСвойств(Форма, ЦС_ОбщегоНазначенияБПКлиентСервер.ДанныеНадписиОГарантии( Объект.Ссылка, Истина));
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)	
	мДлинаСуток = 86400; // в секундах

    РазнДат =Окр((НачалоДня(Объект.СрокИсполненияДоговора)- НачалоДня(Объект.ДоговорКонтрагента.ДатаДоговора))/мДлинаСуток)*0.05 / 365;

	Объект.СуммаКомиссии = Объект.СуммаДокумента*РазнДат;	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	//	Объект.СуммаДокумента = 0;
	мДлинаСуток = 86400; // в секундах
	
	РазнДат =Окр((НачалоДня(Объект.СрокИсполненияДоговора)- НачалоДня(Объект.ДоговорКонтрагента.ДатаДоговора))/мДлинаСуток)*0.05 / 365;
	
	Объект.СуммаКомиссии = Объект.СуммаДокумента*РазнДат;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_цс_ГарантияФЗ" И Параметр.ДокументыОснования <> Неопределено Тогда
		ЗаполнитьТекстПроГарантию(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтруктурноеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура("Организация, ОргИзменять", Объект.Организация,Элементы.Организация.ТолькоПросмотр);
	ВыбранныйЭлем = ОткрытьФормуМодально("ОбщаяФорма.ЦС_ФормаВыбораСтрукЕдУпр", СтруктураПараметров);

	Если ВыбранныйЭлем <> Неопределено Тогда
		Объект.СтруктурноеПодразделение	= ВыбранныйЭлем.СтруктурноеПодразделение;
		Если Объект.Организация <> ВыбранныйЭлем.организация Тогда
			 Объект.Организация = ВыбранныйЭлем.организация
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
