////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриОткрытии формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Макет = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
	Макет = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");	
	Макет.Параметры.Расшифровка = Истина; // чтобы работала расшифровка
	ТабличныйДокумент = ПолеТабличногоДокумента;
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Макет);
	ТабличныйДокумент.ФиксацияСверху      = ТабличныйДокумент.Области.ОбластьРасшифровки.Верх - 1;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;
КонецПроцедуры


// Обработчик события ОбработкаРасшифровки элемента ПолеТабличногоДокумента.
//
&НаКлиенте
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// Получение значений полей выбранной строки.
	ТабличныйДокумент = ПолеТабличногоДокумента;
	ТекущаяОбласть    = ТабличныйДокумент.ТекущаяОбласть;
	ОбластьКодЧисловой         = ТабличныйДокумент.Области.КодЧисловой;
	ОбластьНаименованиеКраткое = ТабличныйДокумент.Области.НаименованиеКраткое;
	ОбластьНаименованиеПолное  = ТабличныйДокумент.Области.НаименованиеПолное;
	КодЧисловой         = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.        Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.        Право).Текст;
	НаименованиеКраткое = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	НаименованиеПолное  = ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное. Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное. Право).Текст;
	// Проверка наличия выбранной единицы измерения.
	Ссылка = СправочникиКлассификаторЕдиницИзмеренияНайтиПоКоду(КодЧисловой);
	Если НЕ Ссылка.Пустая() Тогда
		Вопрос = "В справочнике ""Классификатор единиц измерения"" уже существует элемент с кодом """ + КодЧисловой + """! Открыть существующий?";
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );
		Если      Ответ = КодВозвратаДиалога.Да Тогда
			//Ссылка.ПолучитьФорму( , ВладелецФормы, ).Открыть();
			//ОткрытьФорму(Ссылка,,ВладелецФормы);
			ОткрытьЗначение(Ссылка);
			Возврат;
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Создание новой единицы измерения.
	//ФормаНовогоЭлемента = Справочники.КлассификаторЕдиницИзмерения.ПолучитьФормуНовогоЭлемента(, ВладелецФормы, );
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Код",КодЧисловой);
	ПараметрыФормы.Вставить("Наименование",СтрПолучитьСтроку(НаименованиеКраткое, 1));
	ПараметрыФормы.Вставить("НаименованиеПолное",СтрПолучитьСтроку(НаименованиеПолное, 1));
	ФормаНовогоЭлемента = ОткрытьФорму("Справочник.КлассификаторЕдиницИзмерения.ФормаОбъекта",ПараметрыФормы, ВладелецФормы );
	
	//ФормаНовогоЭлемента = ПолучитьФорму("Справочник.КлассификаторЕдиницИзмерения.ФормаОбъекта", ВладелецФормы, );
	//ФормаНовогоЭлемента.Код                = КодЧисловой;
	//ФормаНовогоЭлемента.Наименование       = СтрПолучитьСтроку(НаименованиеКраткое, 1);
	//ФормаНовогоЭлемента.НаименованиеПолное = СтрПолучитьСтроку(НаименованиеПолное, 1);
	//ФормаНовогоЭлемента.Открыть();
КонецПроцедуры

&НаСервере
Функция СправочникиКлассификаторЕдиницИзмеренияНайтиПоКоду(КодЧисловой);
	Возврат Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодЧисловой);	
КонецФункции

