
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	фин_ПроцедрыРаботыСОбъектамиПереопределяемый.СписокПриСозданииНаСервере(ЭтотОбъект);
	
	фин_ОбщегоНазначенияСервер.УстановитьОтборПоОсновнойОрганизации(ЭтотОбъект);
	
	фин_БюджетированиеОбщегоНазначения.НастроитьОформлениеТабличногоПоля(Элементы.Список);
	
	Если Метаданные.ПодпискиНаСобытия.Найти("фин_ВводРасчетныхДокументовПремирования")<>Неопределено Тогда
		ИсточникПодписки = Метаданные.ПодпискиНаСобытия.Найти("фин_ВводРасчетныхДокументовПремирования").Источник;
		Для Каждого Документ Из Метаданные.Документы Цикл
			Если ИсточникПодписки.СодержитТип(Тип("ДокументОбъект."+Документ.Имя)) Тогда
				НоваяКоманда = Команды.Добавить(Документ.Имя);
				НоваяКоманда.Заголовок = Документ.Синоним;
				НоваяКоманда.Картинка = БиблиотекаКартинок.ВводНаОсновании;
				НоваяКоманда.Отображение= ОтображениеКнопки.КартинкаИТекст;
				НоваяКоманда.Действие = "ВвестиНаОснованииДокумент";
				КП = Элементы.Добавить(Документ.Имя,Тип("КнопкаФормы"),Элементы.СоздатьНаОсновании);
				КП.Заголовок = Документ.Синоним;
				КП.Картинка = БиблиотекаКартинок.ВводНаОсновании;
				КП.Отображение= ОтображениеКнопки.КартинкаИТекст;
				КП.ИмяКоманды = Документ.Имя;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.СоздатьНаОсновании.Видимость=Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВвестиНаОснованииДокумент(Команда)
	//Вставить содержимое обработчика.
	Если Элементы.Список.ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Основание",Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Документ."+Команда.Имя+".ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаСервере
Функция СоздатьДокумент(ИмяДокумента,Ссылка)
	Документ = Документы[ИмяДокумента].СоздатьДокумент();
	Документ.Заполнить(Ссылка);
	Возврат Документ;	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СПИСОК

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	Если фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("БюджетированиеПоОрганизациям") Тогда
		фин_ОбщегоНазначенияСервер.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	фин_ПроцедурыРаботыСОбъектамиКлиентПереопределяемый.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать
