////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции объекта

////////////////////////////////////////////////////////////////////////////////
// Процедуры, функции для работы формы документа

#Если ТолстыйКлиентОбычноеПриложение Тогда

Процедура ПриОткрытииФормыДополнительно(ЭтаФорма, НастраиватьОтборПоОрганизации = Истина) Экспорт

	ТабличноеПолеДокументСписок = ЭтаФорма.ЭлементыФормы.ДокументСписок;
	
	МестоВставки = ТабличноеПолеДокументСписок.Колонки.Индекс(ТабличноеПолеДокументСписок.Колонки["Контрагент"]);
	РаботаСДиалогами.ВставитьКолонкуВТабличноеПоле(МестоВставки, ТабличноеПолеДокументСписок, "ВидОперации", "Вид операции", "ВидОперации");
	
	МестоВставки = ТабличноеПолеДокументСписок.Колонки.Индекс(ТабличноеПолеДокументСписок.Колонки["СуммаДокумента"]);
	РаботаСДиалогами.ВставитьКолонкуВТабличноеПоле(МестоВставки + 1, ТабличноеПолеДокументСписок, "ВалютаДокумента", "Валюта", "ВалютаДокумента");

КонецПроцедуры

Функция ПолучитьЗаголовокФормы() Экспорт
	
	Возврат "Приходные кассовые ордера";
	
КонецФункции

Процедура ПередОткрытиемФормыДополнительно(Форма, ДополнительныеОбработчики) Экспорт
	
	ПриходныйКассовыйОрдерДополнительный.ПередОткрытиемФормыДополнительно(Форма, ДополнительныеОбработчики);
	
КонецПроцедуры

Процедура УстановитьВидимостьДополнительно(ЭлементыФормыДокумента, ВидОперации) Экспорт
	
	ПриходныйКассовыйОрдерДополнительный.УстановитьВидимостьДополнительно(ЭлементыФормыДокумента, ВидОперации);
	
КонецПроцедуры // УстановитьВидимостьДополнительно()

Процедура РасчетныйДокументНачалоВыбораДополнительно(РасчетныйДокумент, Контрагент, ФормаДокумента, Элемент, СтандартнаяОбработка) Экспорт
	
	ПриходныйКассовыйОрдерДополнительный.РасчетныйДокументНачалоВыбораДополнительно(РасчетныйДокумент, Контрагент, ФормаДокумента, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // РасчетныйДокументНачалоВыбораДополнительно()

Процедура ДополнительныеДействияПриИзмененииДополнительно(РасчетныйДокумент, Элемент) Экспорт
	
	ПриходныйКассовыйОрдерДополнительный.ДополнительныеДействияПриИзмененииДополнительно(РасчетныйДокумент, Элемент);
	
КонецПроцедуры // ДополнительныеДействияПриИзмененииДополнительно()
 
Процедура ДополнительныеДействияОчисткаДополнительно(Элемент, СтандартнаяОбработка) Экспорт
	
	ПриходныйКассовыйОрдерДополнительный.ДополнительныеДействияОчисткаДополнительно(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // ДополнительныеДействияОчисткаДополнительно()

#КонецЕсли