// Процедура - обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаСведенийВОВ Из ЭтотОбъект Цикл
		
		Если СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ИнвалидВОВ
			И СтрокаСведенийВОВ.Период >= Дата(2020, 5, 1) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Категория ""Лицо с инвалидностью ВОВ (до мая 2020)"" используется до мая 2020 года'"), , , , Отказ);
			
		ИначеЕсли (СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ВетераныБоевыхДействийНаТерриторииДругихГосударств
			ИЛИ СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ВетераныТруда)
			И СтрокаСведенийВОВ.Период < Дата(2020, 5, 1) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Категории ""Ветераны боевых действий на территории других государств"", ""Ветераны труда"" используются с мая 2020 года'"), , , , Отказ);
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры