Функция ПолучитьДолжностьИсполнителя(ПараметрКоманды)
	//+++ Oleg SmartT. 2021-02-11
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&НаДату,
		|			Сотрудник.Физлицо = &ПараметрФизЛицо
		|				И ПричинаИзмененияСостояния <> &ПричинаУвольнение) КАК РаботникиОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", ПараметрКоманды.Дата);
	Запрос.УстановитьПараметр("ПараметрФизЛицо", ПараметрКоманды.Автор.ФизЛицо);
	Запрос.УстановитьПараметр("ПричинаУвольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат СтрЗаменить(ВыборкаДетальныеЗаписи.Должность,"департамента","") + " департамента казначейства";
	КонецЦикла;
	//--- Oleg SmartT. 2021-02-11
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.АвтоМасштаб = Истина;

	ПечатьРесстр(ПараметрКоманды,ТабДок);
	КоличествоЭкземпляров = 1;
	НаПринтер = Ложь;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ПараметрКоманды,"Реестр платежей "));	
КонецПроцедуры

&НаСервере
Процедура ПечатьРесстр(ПараметрКоманды,ТабДок)
	ТабДок.Очистить();
	// Получаем валюты чтоб рассчитать курс
	KZT = Справочники.Валюты.НайтиПоКоду("398");
	USD = Справочники.Валюты.НайтиПоКоду("840");
	RUB = Справочники.Валюты.НайтиПоКоду("643");
	
		
	ДатаДок = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");

	//+++ Oleg SmartT. 2021-02-11
	Если ПараметрКоманды.ТипПлатежа = Перечисления.ВидыВнутреннихПереводов.КонвертацияВалюты Тогда
		Макет = БизнесПроцессы.ВнутренниеПереводыПоЦА.ПолучитьМакет("Реестр");
	Иначе
		Макет = БизнесПроцессы.ВнутренниеПереводыПоЦА.ПолучитьМакет("РеестрПереводы");
	КонецЕсли;
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заголовок = "Реестр внутренних переводов на " + ДатаДок + " года";
	//Рамиль +
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеПереводыПоЦАПлатежи.Валюта
		|ИЗ
		|	БизнесПроцесс.ВнутренниеПереводыПоЦА.Платежи КАК ВнутренниеПереводыПоЦАПлатежи
		|ГДЕ
		|	ВнутренниеПереводыПоЦАПлатежи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Валюта = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Валюта = ВыборкаДетальныеЗаписи.Валюта;
	КонецЦикла;
	
	Шапка.Параметры.Валюта = Валюта;
	//Рамиль -
	ТабДок.Вывести(Шапка);
	
	ОблСтрока = Макет.ПолучитьОбласть("Строки");
	Подвал    = Макет.ПолучитьОбласть("Подвал");
	//--- Oleg SmartT. 2021-02-11
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутренниеПереводыПоЦАПлатежи.Ссылка,
	|	ВнутренниеПереводыПоЦАПлатежи.НомерСтроки,
	|	ВнутренниеПереводыПоЦАПлатежи.РасчетныйСчет,
	|	ВнутренниеПереводыПоЦАПлатежи.Получатель,
	|	ВнутренниеПереводыПоЦАПлатежи.НазначениеПлатежа КАК Назначение,
	|	ВнутренниеПереводыПоЦАПлатежи.СуммаПлатежа,
	|	ВнутренниеПереводыПоЦАПлатежи.Валюта,
	|	ВнутренниеПереводыПоЦАПлатежи.КурсНацбанка,
	|	ВнутренниеПереводыПоЦАПлатежи.КурсТекущегоБанка,
	|	ЕСТЬNULL(ВнутренниеПереводыПоЦАПлатежи.СуммаВВалюте, 0) КАК СуммаВВалюте,
	|	ВнутренниеПереводыПоЦАПлатежи.КомментарийСогласующего,
	|	ВнутренниеПереводыПоЦАПлатежи.РасчетныйСчет.Банк КАК БанкОтправитель,
	|	ВнутренниеПереводыПоЦАПлатежи.РасчетныйСчет.НомерСчета КАК СчетОтправитель,
	|	ВнутренниеПереводыПоЦАПлатежи.СчетПолучатель.Банк КАК БанкПолучатель,
	|	ВнутренниеПереводыПоЦАПлатежи.СчетПолучатель.НомерСчета КАК СчетПолучатель,
	|	ВнутренниеПереводыПоЦАПлатежи.Ссылка.ПроверкаДиректоромФДВыполнена
	|ИЗ
	|	БизнесПроцесс.ВнутренниеПереводыПоЦА.Платежи КАК ВнутренниеПереводыПоЦАПлатежи
	|ГДЕ
	|	ВнутренниеПереводыПоЦАПлатежи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    НомерСтроки = 0;
	СуммаТенге  = 0;
	СуммаВалютная = 0;
	//Рамиль +
	ПроверкаВыполнена = Ложь;
	//Рамиль -
	Пока Выборка.Следующий() Цикл 
		
		//Рамиль +
		ПроверкаВыполнена = Выборка.ПроверкаДиректоромФДВыполнена;
		//Рамиль -

		ОблСтрока.Параметры.Заполнить(Выборка);
		СуммаТенге = СуммаТенге + Выборка.СуммаПлатежа;
		СуммаВалютная = СуммаВалютная + Выборка.СуммаВВалюте;
		ОблСтрока.Параметры.Получатель = ?(ЗначениеЗаполнено(Выборка.Получатель),Выборка.Получатель,Справочники.Организации.НайтиПоКоду("000000001")); //осн. орг. //+++ Oleg SmartT. 2021-02-11
		ТабДок.Вывести(ОблСтрока);
	КонецЦикла;
	
	// выводим итоговые суммы 	
	Подвал.Параметры.ИтогоТг = СуммаТенге;
	
	Если ПараметрКоманды.ТипПлатежа = Перечисления.ВидыВнутреннихПереводов.КонвертацияВалюты Тогда
		Подвал.Параметры.ИтогоВал  = СуммаВалютная;
	КонецЕсли;
	
	//+++ Oleg SmartT. 2021-05-04	
	пДДК         = ПроцедурыУправленияПерсоналом.ПользовательНаЭтапеМаршрута(Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемКД);
	ДДК          = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, пДДК.ФизЛицо, ПараметрКоманды.Дата).Представление;
	ДолжностьДДК = ПроцедурыУправленияПерсоналом.ДанныеДолжности(ПараметрКоманды.Организация, пДДК.ФизЛицо, ПараметрКоманды.Дата).Должность;
	//Рамиль +
	Если Не ПроверкаВыполнена = Ложь Тогда
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бит_АдресацияУведомленийПоКомандировкам.Адресат
		|ИЗ
		|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
		|ГДЕ
		|	Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута";
	
	Запрос.УстановитьПараметр("ЭтапМаршрута", Справочники.ЦС_ЭтапыМаршрутовБП.НайтиПоНаименованию("Согласование с руководителем ДК"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СотрудникВПодпись = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СотрудникВПодпись = ВыборкаДетальныеЗаписи.Адресат;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		Подвал.Параметры.ФИОФиндира       = СотрудникВПодпись; 
		Подвал.Параметры.ДолжностьФиндира = "Согласование реестра с Директором ДК";
	Иначе
		Подвал.Параметры.ФИОФиндира       = ДДК; 
		Подвал.Параметры.ДолжностьФиндира = ДолжностьДДК;
	КонецЕсли;
	//Рамиль -
	
	Подвал.Параметры.Исполнитель = ПараметрКоманды.Автор;
	Подвал.Параметры.ДолжностьИсполнителя = ПолучитьДолжностьИсполнителя(ПараметрКоманды); 
	Подвал.Параметры.Телефон     = ПараметрКоманды.Телефон;
	
	Подвал.Параметры.ДатаДиректор  = Формат(ПараметрКоманды.Подписи[ПараметрКоманды.Подписи.Количество()-1].Дата,"ДФ=dd.MM.yyyy");
	Подвал.Параметры.ВремяДиректор = Формат(ПараметрКоманды.Подписи[ПараметрКоманды.Подписи.Количество()-1].Дата,"ДЛФ=T") + Символы.ПС + "согласовано"; 
	
	Подвал.Параметры.ДатаИсполнитель  = Формат(ПараметрКоманды.Подписи[1].Дата,"ДФ=dd.MM.yyyy");
	Подвал.Параметры.ВремяИсполнитель = Формат(ПараметрКоманды.Подписи[1].Дата,"ДЛФ=T"); 
	//--- Oleg SmartT. 2021-05-04	
	
	ТабДок.Вывести(Подвал);
	
КонецПроцедуры	
