
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.ПорядокРасчета = ?(Запись.СпособЗаполнения=Перечисления.фин_СпособыЗаполненияСтатейПриСценарныхРасчетах.НеЗаполнять ИЛИ Запись.СпособЗаполнения=Перечисления.фин_СпособыЗаполненияСтатейПриСценарныхРасчетах.ПоОбщемуПравилу,
								Строка(Запись.СпособЗаполнения),
								"По данным сценария"+?(ЗначениеЗаполнено(Запись.ИсходныйСценарий)," """+Строка(Запись.ИсходныйСценарий)+"""","")+", "+
									?(Запись.СпособЗаполнения=Перечисления.фин_СпособыЗаполненияСтатейПриСценарныхРасчетах.СПрименениемКоэффициента,
									" К. сум.: "+Строка(Запись.ПоправочныйКоэффициентКСумме)+", К. кол.: "+Строка(Запись.ПоправочныйКоэффициентККоличеству)+", Лаг: "+Строка(Запись.Лаг),
									?(ЗначениеЗаполнено(Запись.ФормулаКоличество),"Кол. по ф-ле: "+Строка(Запись.ФормулаКоличество)+", ","")+?(Запись.СуммаПоРасценкам,"Сумма по расценкам","Сум. по ф-ле: "+Строка(Запись.Формула))));
	КонецЦикла;
КонецПроцедуры
