
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Адрес") Тогда
		Адрес = Параметры.Адрес;
		Если ЗначениеЗаполнено(Адрес) Тогда 
			Позиция = Найти(Адрес, ".");
			Параметры.Корень = Лев(Адрес,Позиция - 1);
			Адрес = Прав(Адрес,СтрДлина(Адрес) - Позиция); 
			Позиция = Найти(Адрес, ".");
			Параметры.Объект = Лев(Адрес,Позиция - 1);
			Адрес = Прав(Адрес,СтрДлина(Адрес) - Позиция); 
			Параметры.Реквизит = Адрес;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ВыбранныйОбъект") Тогда 
		ВыбранныйОбъект = Параметры.ВыбранныйОбъект;
	Иначе
		ВыбранныйОбъект = Неопределено;
	КонецЕсли;
	
	мМетаданныеКонфигурации = РеквизитФормыВЗначение("МетаданныеКонфигурации");
	мМетаданныеКонфигурации.Строки.Очистить();
	НоваяСтрокаКорень = мМетаданныеКонфигурации.Строки.Добавить();
	НоваяСтрокаКорень.Объекты = "Справочники";
	НоваяСтрокаКорень.КартинкаОбъекты = 0;
	Для Каждого ОбъектМетаданных из Метаданные.Справочники Цикл
		Если Не ВыбранныйОбъект = Неопределено и ОбъектМетаданных.Ссылка = ВыбранныйОбъект Тогда
			
		КонецЕсли;

		НоваяСтрока = НоваяСтрокаКорень.Строки.Добавить();
		НоваяСтрока.Объекты = ОбъектМетаданных.Имя;
		НоваяСтрока.КартинкаОбъекты = 0;
		Для Каждого Реквизит Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			НоваяПодстрока = НоваяСтрока.Строки.Добавить();
			НоваяПодстрока.Объекты = Реквизит.Имя;
			НоваяПодстрока.КартинкаОбъекты = 1;
		КонецЦикла;
		Для Каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
			НоваяПодстрока = НоваяСтрока.Строки.Добавить();
			НоваяПодстрока.Объекты = Реквизит.Имя;
			НоваяПодстрока.КартинкаОбъекты = 1;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(мМетаданныеКонфигурации,"МетаданныеКонфигурации");
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ТекущиеДанные = Элементы.МетаданныеКонфигурации.ТекущиеДанные;
	ТекущийОбъект = ТекущиеДанные;
	//Адрес = ТекущийОбъект.Объекты;
	Адрес = "";
	Пока Не ТекущийОбъект = Неопределено Цикл
		Если Адрес = "" Тогда
			Адрес = ТекущийОбъект.Объекты;
		Иначе
			Адрес = ТекущийОбъект.Объекты + "." + Адрес;
		КонецЕсли;
		ТекущийОбъект = ТекущийОбъект.ПолучитьРодителя();
	КонецЦикла;
	Оповестить("ВыборМетаданных",Новый Структура("Адрес,Вид",Адрес,Параметры.Вид));
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого ЭлементКорня Из МетаданныеКонфигурации.ПолучитьЭлементы() Цикл
		Если ЭлементКорня.Объекты = Параметры.Корень Тогда 
			Идентификатор = ЭлементКорня.ПолучитьИдентификатор();
			Элементы.МетаданныеКонфигурации.Развернуть(Идентификатор,Ложь);
			Для Каждого ЭлементОбъекта Из ЭлементКорня.ПолучитьЭлементы() Цикл
				Если ЭлементОбъекта.Объекты = Параметры.Объект Тогда
					Идентификатор = ЭлементОбъекта.ПолучитьИдентификатор();
					Элементы.МетаданныеКонфигурации.Развернуть(Идентификатор,Ложь);
					Для Каждого ЭлементРеквизита Из ЭлементОбъекта.ПолучитьЭлементы() Цикл
						Если ЭлементРеквизита.Объекты = Параметры.Реквизит Тогда
							Идентификатор = ЭлементРеквизита.ПолучитьИдентификатор();
							Элементы.МетаданныеКонфигурации.ТекущаяСтрока = Идентификатор;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
