Функция ИспользуетсяСогласованиеДокумента(ОбъектПроверки) Экспорт
	Возврат усд_ПроцедурыСогласованияВызовСервераПовтИсп.СогласуемыеТипыИОбъекты().Найти(ОбъектПроверки)<>Неопределено;	
КонецФункции

Функция СогласуемыеТипыИОбъекты() Экспорт
	МассивСогласуемыхОбъектовИТипов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	фин_ВидыДокументов.ПрограммныйИдентификатор,
		|	фин_ВидыДокументов.Ссылка
		|ИЗ
		|	Справочник.усд_МаршрутыДвиженияДокументов КАК усд_МаршрутыДвиженияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.фин_ВидыДокументов КАК фин_ВидыДокументов
		|		ПО усд_МаршрутыДвиженияДокументов.Владелец = фин_ВидыДокументов.Ссылка
		|ГДЕ
		|	усд_МаршрутыДвиженияДокументов.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Метаданные.Документы.Найти(ВыборкаДетальныеЗаписи.ПрограммныйИдентификатор)=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивСогласуемыхОбъектовИТипов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		МассивСогласуемыхОбъектовИТипов.Добавить(ВыборкаДетальныеЗаписи.ПрограммныйИдентификатор);
		МассивСогласуемыхОбъектовИТипов.Добавить(Новый(Тип("ДокументСсылка."+ВыборкаДетальныеЗаписи.ПрограммныйИдентификатор)));
	КонецЦикла;
	
	Возврат МассивСогласуемыхОбъектовИТипов;
	
КонецФункции