////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ДействияФормыДействиеПечать(Кнопка)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ТекущийРаботник = Элементы.Список.ТекущиеДанные;
        Если Не ТекущийРаботник.ЭтоГруппа Тогда
			ТекущийРаботник.ПолучитьОбъект().Печать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Элементы.Дерево.ТекущаяСтрока = Элементы.Список.ТекущийРодитель;
	
КонецПроцедуры


