
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Типовой 
	Движения.Типовой.Записывать = Истина;
	Движения.Типовой.Очистить();
	Для Каждого ТекСтрокаТаблицаОблигаций Из ТаблицаОблигаций Цикл
		Движение = Движения.Типовой.Добавить();
		Движение.СчетДт = ПланыСчетов.Типовой.РасходыПоВознаграждениямпоЦеннымБумагамВыпущенным;
		Движение.СчетКт = ПланыСчетов.Типовой.НачисленныеРасходыВВидевознагрожденийПоВыпущеннымЦеннымБумагам;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сумма = ТекСтрокаТаблицаОблигаций.Сумма;
		Движение.Содержание = "Начисление вознаграждений по облигациям";
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.СтатьиЗатрат] = Справочники.СтатьиЗатрат.НайтиПоНаименованию("по облигациям");
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.Контрагенты] = ТекСтрокаТаблицаОблигаций.ДержательОблигаций;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.Договоры] = ТекСтрокаТаблицаОблигаций.Договор;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоТиповые.ЦенныеБумаги] = ТекСтрокаТаблицаОблигаций.Облигация;
	КонецЦикла;

КонецПроцедуры
