////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит список структурных единиц, по которым строится отчет
Перем мСписокСтруктурныхЕдиниц Экспорт; // (отчет)

//Процедура устанавливает текст заголовка отчета
//
Процедура УстановитьТекстЗаголовка() Экспорт 

	ПараметрыВывода = КомпоновщикНастроек.Настройки.ПараметрыВывода;
	
	ПараметрыВыводаЗаголовка = ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"));
	ПараметрыВыводаЗаголовка.Использование = Истина;
	ПараметрыВыводаЗаголовка.Значение = ТипВыводаТекстаКомпоновкиДанных.Выводить;
	
	ПараметрТекстаЗаголовка = ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));
	ПараметрТекстаЗаголовка.Использование = Истина;
	ТекстЗаголовка = "Реестр исполнения договоров по государственным закупкам товаров, работ и услуг
					|
					|";
	
	ПараметрТекстаЗаголовка.Значение = ТекстЗаголовка;
	
	Настройки = КомпоновщикНастроек.Настройки;	

КонецПроцедуры //УстановитьТекстЗаголовка

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
