
Процедура РезультатПроверкиМенеджеромБюджетированияОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура РезультатМенеджераКазначействаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура РезультатДиректораФинДепОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура РезультатУправляющегоДиректораОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
КонецПроцедуры
