
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		Для Каждого ЭлементЗаполнения Из ДанныеЗаполнения Цикл
			Если Метаданные().Реквизиты.Найти(ЭлементЗаполнения.Ключ)<>Неопределено ИЛИ ЭлементЗаполнения.Ключ = "Владелец"  Тогда
				ЭтотОбъект[ЭлементЗаполнения.Ключ] = ЭлементЗаполнения.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из НаборШаблонов Цикл
		Если СтрокаТЧ.УсловиеПримененияШаблона.Пустая() И (СтрокаТЧ.СпособИспользования = Перечисления.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.ВсегдаЕслиУдовлетворяетУсловию ИЛИ СтрокаТЧ.СпособИспользования = Перечисления.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.ЕслиУдовлетворяетУсловию) Тогда 
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Элемент справочника """+Метаданные().Синоним+"""
			|	"+Ссылка+": не записан, так как в строке №"+Строка(СтрокаТЧ.НомерСтроки)+" не указано условие использования!'");
			Поле = "НаборШаблонов" + "[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].УсловиеПримененияШаблона";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
