
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мВид = Объект.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	фин_РаботаСДиалогамиБюджетирование.ОбработатьВыборВидаДокументаДляОтраженияВБюджетировании(Элемент,СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Если мВид <> Объект.Владелец Тогда
		мВид = Объект.Владелец;
	    Объект.НаборШаблонов.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборШаблоновПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Владелец.Пустая() Тогда
		ПоказатьПредупреждение(,"Не указан вид документов!",120);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборШаблоновПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.НаборШаблонов.ТекущиеДанные.СпособИспользования = ПредопределенноеЗначение("Перечисление.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.Всегда");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаборШаблоновСпособИспользованияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НаборШаблонов.ТекущиеДанные;
	Если ТекущиеДанные.СпособИспользования = ПредопределенноеЗначение("Перечисление.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.Всегда")
		ИЛИ ТекущиеДанные.СпособИспользования = ПредопределенноеЗначение("Перечисление.фин_СпособИспользованияШаблонаОтраженияВБюджетировании.ЕслиНеНайденУдовлетворяющийУсловиюШаблон") Тогда
		ТекущиеДанные.УсловиеПримененияШаблона = ПредопределенноеЗначение("Справочник.усд_УсловияВыполненияОперацийПоДокументам.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьНабораСхемОтражения",Новый Структура("Объект,Наименование",Объект.Ссылка,Объект.Наименование));
КонецПроцедуры
