
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТипДиаграммыОтчета.ОграничениеТипа=Новый ОписаниеТипов("ТипДиаграммы");
	Элементы.ДекорацияОбщаяНастройка.Видимость=ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.фин_ВидыОтчетовПоБюджетам");
	ИспользованиеТаблицыВШаблонахОтчетов.Параметры.УстановитьЗначениеПараметра("Таблица",Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ТипДиаграммыОтчетаПриИзменении(Элемент)
	Для Каждого ТД Из ТипДиаграммы Цикл
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТипДиаграммы = Новый ХранилищеЗначения(ТипДиаграммыОтчета);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТипДиаграммыОтчета = ТекущийОбъект.ТипДиаграммы.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Элементы.ДекорацияОбщаяНастройка.Видимость=ТипЗнч(Объект.Владелец)=Тип("СправочникСсылка.фин_ВидыОтчетовПоБюджетам");
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ИспользованиеТаблицыВШаблонахОтчетов.Параметры.УстановитьЗначениеПараметра("Таблица",Объект.Ссылка);
КонецПроцедуры
