
//Текст запроса временные таблицы документа
//
Функция ТекстЗапросаВременныеТаблицыДокумента(ИмяОбъектаМетаданных,НомераТаблиц, Реквизиты, ИсключаемыеТЧ = Неопределено) Экспорт

	ТекстЗапроса = "";
	
	Для Каждого ТабличнаяЧасть Из Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти Цикл
		
		ИмяТЧ = ТабличнаяЧасть.Имя;
		
		Если ИсключаемыеТЧ<>Неопределено И ИсключаемыеТЧ.Найти(ИмяТЧ)<>Неопределено Тогда
			Продолжить;
		КонецЕсли;
	
		Если Реквизиты["Есть"+ИмяТЧ]=Истина Тогда 
			НомераТаблиц.Вставить("ВременнаяТаблица"+ИмяТЧ, НомераТаблиц.Количество());
			
			ИмяТаблицыЗапроса = "Таблица"+ИмяТЧ;
			
			ТекстЗапроса = ТекстЗапроса + 
			"ВЫБРАТЬ
			|	"+ИмяТаблицыЗапроса+".Ссылка,
			|	"+ИмяТаблицыЗапроса+".НомерСтроки";
			Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			ТекстЗапроса = ТекстЗапроса + ",
			|	"+ИмяТаблицыЗапроса+"."+Реквизит.Имя;
			КонецЦикла;
			ТекстЗапроса = ТекстЗапроса + "
			|ПОМЕСТИТЬ "+ИмяТаблицыЗапроса+"
			|ИЗ
			|	Документ."+ИмяОбъектаМетаданных+"."+ИмяТЧ+" КАК "+ИмяТаблицыЗапроса+"
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
			|		ПО "+ИмяТаблицыЗапроса+".Ссылка = Реквизиты.Ссылка"
			+ фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();
		КонецЕсли;
	
	КонецЦикла;

	Возврат ТекстЗапроса;

КонецФункции

//Текст запроса реквизиты документа
//
Функция ТекстЗапросаРеквизитыДокумента(ИмяОбъектаМетаданных,НомераТаблиц,ТребуютсяРегламентированныеПоказатели = Ложь) Экспорт
	
	НомераТаблиц.Вставить("ВременнаяТаблицаСоставДокумента", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	Если Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти.Количество()>0 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|";
		Первая = Истина;
		Для Каждого ТабличнаяЧасть Из Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти Цикл
			
			ИмяТЧ = ТабличнаяЧасть.Имя;
			
			ТекстЗапроса = ТекстЗапроса + ?(Первая,"",",")+ "
			|	МАКСИМУМ(СоставДокумента.Есть"+ИмяТЧ+") КАК Есть"+ИмяТЧ;
			Первая = Ложь;
		КонецЦикла;
		
		ТекстЗапроса =  ТекстЗапроса + "
		|ПОМЕСТИТЬ СоставДокумента
		|ИЗ
		|	(";
		
		ПерваяТЧ = Истина;
		Для Каждого ТабличнаяЧасть Из Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти Цикл
			
			ИмяТЧ = ТабличнаяЧасть.Имя;
			
			ТекстЗапроса = ТекстЗапроса + ?(ПерваяТЧ,"","
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	") + "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|";
			
			ПерваяТЧКор = Истина;
			Для Каждого ТабличнаяЧастьКорреспондирующая Из Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти Цикл
				
				ИмяТЧКор = ТабличнаяЧастьКорреспондирующая.Имя;
				ТекстЗапроса =  ТекстЗапроса + ?(ПерваяТЧКор,"",",") +"
				|		"+?(ИмяТЧ = ИмяТЧКор,"ИСТИНА","ЛОЖЬ")+" КАК Есть"+ИмяТЧКор;
				
				ПерваяТЧКор = Ложь;
			КонецЦикла;
			ТекстЗапроса =  ТекстЗапроса + "
			|	ИЗ
			|		Документ."+ИмяОбъектаМетаданных+"."+ИмяТЧ+" КАК ТаблицаДокумента
			|	ГДЕ
			|		ТаблицаДокумента.Ссылка = &Ссылка";
			
			ПерваяТЧ = Ложь;
		КонецЦикла;
		
		ТекстЗапроса =  ТекстЗапроса + "
		|) КАК СоставДокумента
		|;
		|";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	1 КАК Поле1
		|ПОМЕСТИТЬ СоставДокумента
		|;
		|";
	КонецЕсли;

	ЕстьОрганизация = Метаданные.Документы[ИмяОбъектаМетаданных].Реквизиты.Найти("Организация")<>Неопределено;
	
	ТекстЗапроса = ТекстЗапроса+"	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Дата,";
//	|	Реквизиты.Организация КАК Организация,
	Если ЕстьОрганизация Тогда
		ТекстЗапроса = ТекстЗапроса+"	
		|	Реквизиты.Организация КАК Налогоплательщик,
		|	"+?(фин_ОбщегоНазначенияВызовСервераПовтИсп.ЕстьРеквизитГоловнаяОрганизация(),"ВЫБОР
		|		КОГДА Реквизиты.Организация.ГоловнаяОрганизация ЕСТЬ NULL 
		|				ИЛИ Реквизиты.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА Реквизиты.Организация
		|		ИНАЧЕ Реквизиты.Организация.ГоловнаяОрганизация
		|	КОНЕЦ","Реквизиты.Организация")+" КАК ГоловнаяОрганизация,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса+"	
	|	&ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета";
	Для Каждого Реквизит Из Метаданные.Документы[ИмяОбъектаМетаданных].Реквизиты Цикл
			
		ТекстЗапроса =  ТекстЗапроса + ",
		|	Реквизиты."+Реквизит.Имя+" КАК "+Реквизит.Имя;
	КонецЦикла;
	
	Если ТребуютсяРегламентированныеПоказатели Тогда
		ТекстЗапроса =  ТекстЗапроса + ",
		|	РеглПоказатели.РазмерМЗП,
		|	РеглПоказатели.РазмерМРП,
		|	РеглПоказатели.РазмерНеоблагаемогоИПНДоходаИнвалидов1_2Группы,
		|	РеглПоказатели.РазмерНеоблагаемогоИПНДоходаИнвалидов3Группы,
		|	РеглПоказатели.РазмерМЗПДляЦелейНалогообложения,
		|	РеглПоказатели.РазмерМРПДляЦелейНалогообложения";
	КонецЕсли;
	
	ТекстЗапроса =  ТекстЗапроса + "
	|ПОМЕСТИТЬ Реквизиты
	|ИЗ
	|	Документ."+ИмяОбъектаМетаданных+" КАК Реквизиты";
	
	Если ТребуютсяРегламентированныеПоказатели Тогда
		ТекстЗапроса =  ТекстЗапроса + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныеРасчетныеПоказатели.СрезПоследних(&ДатаРеглПоказателей,) КАК РеглПоказатели
		|		ПО ИСТИНА";
	КонецЕсли;
	
	ТекстЗапроса =  ТекстЗапроса + "
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Дата КАК Дата,";
	Если ЕстьОрганизация Тогда
		ТекстЗапроса =  ТекстЗапроса + "
		|	Реквизиты.Организация КАК Налогоплательщик,
		|	"+?(фин_ОбщегоНазначенияВызовСервераПовтИсп.ЕстьРеквизитГоловнаяОрганизация(),"ВЫБОР
		|		КОГДА Реквизиты.Организация.ГоловнаяОрганизация ЕСТЬ NULL 
		|				ИЛИ Реквизиты.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА Реквизиты.Организация
		|		ИНАЧЕ Реквизиты.Организация.ГоловнаяОрганизация
		|	КОНЕЦ","Реквизиты.Организация")+" КАК ГоловнаяОрганизация,";
	КонецЕсли;
	ТекстЗапроса =  ТекстЗапроса + "
	|	Реквизиты.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета";
	Для Каждого Реквизит Из Метаданные.Документы[ИмяОбъектаМетаданных].Реквизиты Цикл
			
		ТекстЗапроса =  ТекстЗапроса + ",
		|	Реквизиты."+Реквизит.Имя+" КАК "+Реквизит.Имя;
	КонецЦикла;
	Для Каждого ТабличнаяЧасть Из Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти Цикл
		
		ИмяТЧ = ТабличнаяЧасть.Имя;
		
		ТекстЗапроса = ТекстЗапроса + ",
		|	ЕСТЬNULL(СоставДокумента.Есть"+ИмяТЧ+", ЛОЖЬ) КАК Есть"+ИмяТЧ;
		
	КонецЦикла;
	Если ТребуютсяРегламентированныеПоказатели Тогда
		ТекстЗапроса =  ТекстЗапроса + ",
		|	Реквизиты.РазмерМЗП,
		|	Реквизиты.РазмерМРП,
		|	Реквизиты.РазмерНеоблагаемогоИПНДоходаИнвалидов1_2Группы,
		|	Реквизиты.РазмерНеоблагаемогоИПНДоходаИнвалидов3Группы,
		|	Реквизиты.РазмерМЗПДляЦелейНалогообложения,
		|	Реквизиты.РазмерМРПДляЦелейНалогообложения";
	КонецЕсли;
	ТекстЗапроса =  ТекстЗапроса + "
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоставДокумента КАК СоставДокумента
	|		ПО (ИСТИНА)";

	Возврат ТекстЗапроса + фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();
	
КонецФункции

//Подготовить параметры проведения
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ , БУ = Ложь, НУ = Ложь , ДополнительныеДанныеИУчетныеПолитики = Неопределено,ТребуютсяРегламентированныеПоказатели = Ложь,ПолеДатыПолученияРеглПоказателей = Неопределено,ПереопределяемыеТаблицы = Неопределено,ДополнительныеПараметрыЗапросов = Неопределено,ДополнительныеЗапросы = Неопределено) Экспорт
	
	ЕстьВзаиморасчеты = Ложь;
	
	Если ДополнительныеДанныеИУчетныеПолитики <> Неопределено Тогда
		Если ДополнительныеДанныеИУчетныеПолитики.Свойство("ЕстьВзаиморасчеты") Тогда
			ЕстьВзаиморасчеты = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИмяОбъектаМетаданных = ДокументСсылка.Метаданные().Имя;
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета",	фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета"));
	Если ТребуютсяРегламентированныеПоказатели=Истина Тогда
		Запрос.УстановитьПараметр("ДатаРеглПоказателей",	ДокументСсылка[ПолеДатыПолученияРеглПоказателей]);
	КонецЕсли;
	Если ДополнительныеПараметрыЗапросов<>Неопределено Тогда
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметрыЗапросов Цикл
			Запрос.УстановитьПараметр(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(ИмяОбъектаМетаданных,НомераТаблиц,ТребуютсяРегламентированныеПоказатели);
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	ПараметрыПроведения.Вставить("Реквизиты", ТаблицаРеквизиты);
	
	Реквизиты = фин_ОбщегоНазначенияСервер.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
	//
	//Если БУ И НЕ УчетнаяПолитикаСервер.Существует(Реквизиты.Организация, Реквизиты.Период, "БУ", Истина, ДокументСсылка) Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	//
	//Если НУ И НЕ УчетнаяПолитикаСервер.Существует(Реквизиты.Организация, Реквизиты.Период, "НУ", Истина, ДокументСсылка) Тогда
	//	Отказ = Истина;
	//КонецЕсли;
	
	Если Отказ Тогда
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	
	Если ЕстьВзаиморасчеты Тогда
		//Реквизиты.Вставить("РасчетыВВалюте", Реквизиты.ВалютаВзаиморасчетов <> Реквизиты.ВалютаРегламентированногоУчета);
		//Запрос.УстановитьПараметр("РасчетыВВалюте",  Реквизиты.РасчетыВВалюте);
		//
		//Если Реквизиты.РасчетыВВалюте Тогда
		//	ПодготовитьТаблицыДокументаРасчетыВВалюте(Запрос, Реквизиты);  // см. Авансовый отчет
		//Иначе
		//	Запрос.Текст = ТекстЗапросаВременныеТаблицыДокумента(НомераТаблиц, Реквизиты);
		//	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда 
		//		Результат    = Запрос.ВыполнитьПакет();
		//	КонецЕсли;
		//КонецЕсли;
	Иначе
		Запрос.Текст = ТекстЗапросаВременныеТаблицыДокумента(ИмяОбъектаМетаданных,НомераТаблиц, Реквизиты);
		Если НЕ ПустаяСтрока(Запрос.Текст) Тогда 
			Результат    = Запрос.ВыполнитьПакет();
		КонецЕсли;
	КонецЕсли;
	//
	//Если НУ Тогда
	//	
	//	ПроверитьДобавитьКолонку(ПараметрыПроведения.Реквизиты,"НеобходимостьОтраженияВНУ");
	//	ПроверитьДобавитьКолонку(ПараметрыПроведения.Реквизиты,"ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль");
	//	ПроверитьДобавитьКолонку(ПараметрыПроведения.Реквизиты,"ВедениеУчетаВременныхРазницБалансовымМетодом");
	//	ПроверитьДобавитьКолонку(ПараметрыПроведения.Реквизиты,"Налогоплательщик");
	//	ПроверитьДобавитьКолонку(ПараметрыПроведения.Реквизиты,"ОрганизацияПлательщикНалогаНаПрибыль");
	//	
	//	ОрганизацияПлательщикНалогаНаПрибыль 			= ПроцедурыНалоговогоУчета.ПолучитьПризнакПлательщикаНалогаНаПрибыль(Реквизиты.Организация, Реквизиты.Период);
	//	ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль 	= ОрганизацияПлательщикНалогаНаПрибыль И ПроцедурыНалоговогоУчета.ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль(Реквизиты.Организация, Реквизиты.Период);
	//	
	//	НеобходимостьОтраженияВНУ 						= ОрганизацияПлательщикНалогаНаПрибыль И ?(Реквизиты.Свойство("УчитыватьКПН"),Реквизиты.УчитыватьКПН И (ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль ИЛИ Реквизиты.ВидУчетаНУ = Справочники.ВидыУчетаНУ.НУ),Истина);
	//	ВедениеУчетаВременныхРазницБалансовымМетодом    = УчетнаяПолитикаСервер.ВедетсяУчетВременныхРазницБалансовымМетодом(Реквизиты.Организация, Реквизиты.Период);
	//	
	//	Реквизиты.Вставить("ОрганизацияПлательщикНалогаНаПрибыль", 			 ОрганизацияПлательщикНалогаНаПрибыль);
	//	Реквизиты.Вставить("ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль", ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль);
	//	Реквизиты.Вставить("НеобходимостьОтраженияВНУ", 					 НеобходимостьОтраженияВНУ);
	//	Реквизиты.Вставить("ВедениеУчетаВременныхРазницБалансовымМетодом", 	 ВедениеУчетаВременныхРазницБалансовымМетодом);
	//	
	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(НеобходимостьОтраженияВНУ,  				    "НеобходимостьОтраженияВНУ");
	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль, "ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль");
	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ВедениеУчетаВременныхРазницБалансовымМетодом,   "ВедениеУчетаВременныхРазницБалансовымМетодом");
	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ОрганизацияПлательщикНалогаНаПрибыль, 			"ОрганизацияПлательщикНалогаНаПрибыль");
	//	
	//	Налогоплательщик = Реквизиты.Организация;
	//	Если фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПризнакОтображенияСтруктурныхПодразделений()  Тогда
	//		Налогоплательщик = ПроцедурыНалоговогоУчетаВызовСервераПовтИсп.ПолучитьНалогоплательщикаСтруктурнойЕдиницы(?(Реквизиты.Свойство("СтруктурноеПодразделение"),Реквизиты.СтруктурноеПодразделение,?(Реквизиты.Свойство("СтруктурноеПодразделениеОтправитель"),Реквизиты.СтруктурноеПодразделениеОтправитель,Справочники.ПодразделенияОрганизаций.ПустаяСсылка())),
	//									Реквизиты.Организация,
	//									Перечисления.РазделыНалоговогоУчета.НДС);
	//	КонецЕсли;	
	//	
	//	Реквизиты.Вставить("Налогоплательщик", Налогоплательщик);
	//	Запрос.УстановитьПараметр("ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль", ПоддержкаУчетаВременныхРазницПоНалогуНаПрибыль);

	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(Налогоплательщик, "Налогоплательщик");
	//КонецЕсли;
	
	Если ДополнительныеДанныеИУчетныеПолитики <> Неопределено Тогда
		Для Каждого РегистрУчетнойПолитики Из ДополнительныеДанныеИУчетныеПолитики Цикл
			СтруктураПараметровУУ = Новый Структура;
			Для Каждого Ресурс Из Метаданные.РегистрыСведений[РегистрУчетнойПолитики.Ключ].Ресурсы Цикл
				СтруктураПараметровУУ.Вставить(Ресурс.Имя,Ресурс.Тип.ПривестиЗначение(Неопределено));
			КонецЦикла;
	
			ЗапросУУ = Новый Запрос;
			ЗапросУУ.Текст = 
				"ВЫБРАТЬ
				|	УчетнаяПолитика.*
				|ИЗ
				|	РегистрСведений."+РегистрУчетнойПолитики.Ключ+".СрезПоследних(&Период, "+?(Метаданные.РегистрыСведений[РегистрУчетнойПолитики.Ключ].Измерения.Найти("Организация")<>Неопределено,"Организация = &Организация","")+") КАК УчетнаяПолитика";
			
			ЗапросУУ.УстановитьПараметр("Организация", 	Реквизиты.Организация);
			ЗапросУУ.УстановитьПараметр("Период", 		?(ТипЗнч(РегистрУчетнойПолитики.Значение)=Тип("Дата"),РегистрУчетнойПолитики.Значение,Реквизиты.Дата));
			
			РезультатЗапросаУУ = ЗапросУУ.Выполнить();
			
			ВыборкаДетальныеЗаписиУУ = РезультатЗапросаУУ.Выбрать();
			
			Пока ВыборкаДетальныеЗаписиУУ.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(СтруктураПараметровУУ,ВыборкаДетальныеЗаписиУУ);
			КонецЦикла;
			
			Для Каждого ЭлементСтруктуры Из СтруктураПараметровУУ Цикл
				ПроверитьДобавитьКолонку(ПараметрыПроведения.Реквизиты,ЭлементСтруктуры.Ключ);
				Реквизиты.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
				ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ЭлементСтруктуры.Значение, ЭлементСтруктуры.Ключ);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	//Если Реквизиты.ЕстьВыплатаЗаработнойПлаты ИЛИ
	//	 Реквизиты.ЕстьОплатаПоИсполнительнымЛистам ИЛИ
	//	 Реквизиты.ЕстьПеречислениеПенсионныхВзносов ИЛИ
	//	 Реквизиты.ЕстьПеречислениеПрофессиональныхПенсионныхВзносов ИЛИ
	//	 Реквизиты.ЕстьПеречислениеСоциальныхОтчислений Тогда

	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ОбщегоНазначенияБК.ПолучитьПризнакВеденияУчетаПоСотрудникам(), "ВедениеУчетаПоСотрудникам");
	//	
	//	ПризнакиРаспределенияНалогов = УчетнаяПолитикаСервер.ПолучитьПризнакиРаспределенияНалогов(Реквизиты.Организация, Реквизиты.Дата);
	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ПризнакиРаспределенияНалогов.РаспределятьНалогиПоСтруктурнымЕдиницам, "РаспределятьНалогиПоСтруктурнымЕдиницам");
	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(ПризнакиРаспределенияНалогов.РаспределятьНалогиПоПодразделениямОрганизаций, "РаспределятьНалогиПоПодразделениямОрганизаций");
	//	ПараметрыПроведения.Реквизиты.ЗаполнитьЗначения(фин_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПризнакОтображенияСтруктурныхПодразделений(), "ПоддержкаРаботыСоСтруктурнымиПодразделениями");	
	//
	//	Запрос.УстановитьПараметр("Дата", Реквизиты.Дата);
	//КонецЕсли;
		
	НомераТаблиц = Новый Структура;
	Запрос.Текст = "";
					
	Для Каждого ТабличнаяЧасть Из Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти Цикл
		
		ИмяТЧ = ТабличнаяЧасть.Имя;
		
		Если ПереопределяемыеТаблицы<>Неопределено И ПереопределяемыеТаблицы.Найти(ИмяТЧ)<>Неопределено Тогда
			Запрос.Текст = Запрос.Текст + Вычислить("Документы."+ИмяОбъектаМетаданных+".ТекстЗапроса"+ИмяТЧ+"(НомераТаблиц, ПараметрыПроведения, Реквизиты)");
		Иначе	
			Запрос.Текст = Запрос.Текст + ТекстЗапросаТабличнаяЧасть(ИмяОбъектаМетаданных,ИмяТЧ, НомераТаблиц, ПараметрыПроведения, Реквизиты);
		КонецЕсли;
	КонецЦикла;
	
	Если ДополнительныеЗапросы<>Неопределено Тогда
		Для Каждого ДополнительныйЗапрос Из ДополнительныеЗапросы Цикл
			Запрос.Текст = Запрос.Текст + Вычислить("Документы."+ИмяОбъектаМетаданных+".ТекстЗапроса"+ДополнительныйЗапрос+"(НомераТаблиц, ПараметрыПроведения, Реквизиты)");
		КонецЦикла;
	КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	//Запрос.УстановитьПараметр("НеобходимостьОтраженияВНУ",	НеобходимостьОтраженияВНУ);
	//Запрос.УстановитьПараметр("ВедениеУчетаВременныхРазницБалансовымМетодом",	ВедениеУчетаВременныхРазницБалансовымМетодом);

	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда 
		Результат = Запрос.ВыполнитьПакет();
		Для Каждого НомерТаблицы Из НомераТаблиц Цикл
			ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, ?(НомерТаблицы.Значение=Неопределено,Неопределено,Результат[НомерТаблицы.Значение].Выгрузить()));
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыПроведения;

КонецФункции

//Проверить добавить колонку
//
Процедура ПроверитьДобавитьКолонку(ТаблицаРеквизиты,ИмяКолонки) Экспорт
	Если ТаблицаРеквизиты.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		ТаблицаРеквизиты.Колонки.Добавить(ИмяКолонки);
	КонецЕсли;
КонецПроцедуры


Функция ТекстЗапросаТабличнаяЧасть(ИмяОбъектаМетаданных,ИмяТЧ, НомераТаблиц,ПараметрыПроведения, Реквизиты)

	ТекстЗапроса = "";
	
	Если НЕ Реквизиты["Есть"+ИмяТЧ] Тогда
		ПараметрыПроведения.Вставить("Таблица"+ИмяТЧ, Неопределено);
	Иначе 
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	"+ИмяТЧ+".НомерСтроки КАК НомерСтроки";
		Для Каждого Реквизит Из Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти[ИмяТЧ].Реквизиты Цикл
			ТекстЗапроса = ТекстЗапроса+",
			|	"+ИмяТЧ+"."+Реквизит.Имя+" КАК "+Реквизит.Имя;
		КонецЦикла;
		ТекстЗапроса = ТекстЗапроса+"
		|ИЗ
		|	Документ."+ИмяОбъектаМетаданных+"."+ИмяТЧ+" КАК "+ИмяТЧ+"
		|		ЛЕВОЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
		|		ПО (ИСТИНА)
		|ГДЕ "+ИмяТЧ+".Ссылка = &Ссылка"
		+ фин_УправлениеПроведениемДокументовСервер.ТекстРазделителяЗапросовПакета();
		
		НомераТаблиц.Вставить("Таблица"+ИмяТЧ, НомераТаблиц.Количество());
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;	
КонецФункции 

//Сформировать движения по регистрам
//
Процедура СформироватьДвиженияПоРегистрам(ТаблицаРеквизиты, ТаблицаДвижений, Движения, Отказ, ИмяТаблицы=Неопределено, ИмяМодуля = Неопределено, ИмяОбработчика = Неопределено, ИмяРегистра = Неопределено, УсловиеВыполнения = Неопределено, ВидДвижения = Неопределено) Экспорт
	
	Если ТаблицаДвижений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ТаблицаРеквизиты[0];
	
	Если УсловиеВыполнения <> Неопределено Тогда
		РезультатПроверкиУсловия = Вычислить(УсловиеВыполнения);
		Если РезультатПроверкиУсловия <> Истина Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяТаблицы=Неопределено ИЛИ Реквизиты["Есть"+ИмяТаблицы] Тогда
		Если ИмяМодуля = Неопределено Тогда
			ЗарегистрироватьДвижения(Реквизиты, ТаблицаДвижений, Движения, Отказ, ИмяРегистра, ВидДвижения);
		Иначе
			Выполнить(ИмяМодуля+?(ИмяОбработчика=Неопределено,".ЗарегистрироватьДвижения"+ИмяТаблицы,"."+ИмяОбработчика)+"(Реквизиты, ТаблицаДвижений, Движения, Отказ)");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗарегистрироватьДвижения(Реквизиты, ТаблицаДвижений, Движения, Отказ, ИмяРегистра, ВидДвижения = Неопределено)
	
	Для Каждого СтрокаДвижений Из ТаблицаДвижений Цикл 
		
		НоваяСтрока = Движения[ИмяРегистра].Добавить();
		Если ВидДвижения <> Неопределено Тогда
			НоваяСтрока.ВидДвижения = ВидДвижения;		
		КонецЕсли;
		НоваяСтрока.Период = Реквизиты.Дата;
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Реквизиты);
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДвижений);
	КонецЦикла;

	Движения[ИмяРегистра].Записывать = Истина;

КонецПроцедуры

Функция ТекстРазделителяЗапросовПакета() Экспорт

	ТекстРазделителя =
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";

	Возврат ТекстРазделителя;

КонецФункции
