Перем СоответствиеВалютныеСпособыРасчета;
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мДлинаСуток;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет заполнение таблицы плановых начислений и удержаний
Процедура ЗаполнитьПлановыйНачисленияУдержания() Экспорт
	
	ОсновныеНачисления.Очистить();
	ДополнительныеНачисления.Очистить();
		
	// Отпуск по уходу без оплаты
	Начисление = ОсновныеНачисления.Добавить();	
	Начисление.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоУходуЗаРебенкомДо3ЛетБезОплаты;
	Начисление.Действие = Перечисления.ВидыДействияСНачислением.Начать;
	
	// Прекратим действующие до даты документа начисления работника
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", 			 Сотрудник);
	Запрос.УстановитьПараметр("Регистратор", 		 Ссылка);
    Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ДатаАктуальности",    ?(НЕ ЗначениеЗаполнено(ДатаНачала),Дата,ДатаНачала));
	Запрос.УстановитьПараметр("НачальнаяДата",       '00010101');
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА СрезПлановыхНачислений.ПериодЗавершения < &ДатаАктуальности
	|				И СрезПлановыхНачислений.ПериодЗавершения <> &НачальнаяДата
	|			ТОГДА СрезПлановыхНачислений.ВидРасчетаЗавершения
	|		ИНАЧЕ СрезПлановыхНачислений.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	|		&ДатаАктуальности,
	|		Сотрудник = &Сотрудник
	|		    И Организация = &ГоловнаяОрганизация
	|		    И Активность
	|		    И Регистратор <> &Регистратор) КАК СрезПлановыхНачислений
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СрезПлановыхНачислений.ПериодЗавершения < &ДатаАктуальности
	|					И СрезПлановыхНачислений.ПериодЗавершения <> &НачальнаяДата
	|				ТОГДА СрезПлановыхНачислений.ДействиеЗавершения
	|			ИНАЧЕ СрезПлановыхНачислений.Действие
	|		КОНЕЦ <> &Прекратить";
	
	Запрос.УстановитьПараметр("Прекратить",Перечисления.ВидыДействияСНачислением.Прекратить);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда 
			Начисление = ОсновныеНачисления.Добавить();	
		Иначе
			Начисление = ДополнительныеНачисления.Добавить();	
		КонецЕсли;
		Начисление.ВидРасчета = Выборка.ВидРасчета;
		Начисление.Действие = Перечисления.ВидыДействияСНачислением.Прекратить;
	КонецЦикла;  

	// Удержания	
	ПлановыеУдержания.Очистить();
	
	// Прекратим действующие до даты документа удержания работника
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", 		  Сотрудник.ФизЛицо);
	Запрос.УстановитьПараметр("Организация", 	  ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Регистратор", 	  Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности", ?(НЕ ЗначениеЗаполнено(ДатаНачала),Дата,ДатаНачала));
	Запрос.УстановитьПараметр("Прекратить",		  Перечисления.ВидыДействияСНачислением.Прекратить);
	Запрос.УстановитьПараметр("НачальнаяДата", 	  '00010101');
	
	Запрос.Текст = 
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	СрезПлановыхУдержаний.ВидРасчета КАК ВидРасчета,
    |	СрезПлановыхУдержаний.ДокументОснование КАК ДокументОснование,
    |	&Прекратить КАК Действие
    |ИЗ
    |	РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
    |		&ДатаАктуальности,
    |		ФизЛицо = &ФизЛицо
    |		    И Организация = &Организация
    |		    И Активность
    |		    И Регистратор <> &Регистратор) КАК СрезПлановыхУдержаний
    |ГДЕ
    |	ВЫБОР
    |		КОГДА СрезПлановыхУдержаний.ПериодЗавершения < &ДатаАктуальности
    |				И СрезПлановыхУдержаний.ПериодЗавершения <> &НачальнаяДата
    |			ТОГДА СрезПлановыхУдержаний.ДействиеЗавершения
    |		ИНАЧЕ СрезПлановыхУдержаний.Действие
    |	КОНЕЦ <> &Прекратить";
	

	ПлановыеУдержания.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", 			Ссылка);
	Запрос.УстановитьПараметр("парамПустаяОрганизация", 	Справочники.Организации.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамПустойДок", 		    Документы.ПриемНаРаботуВОрганизацию.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	Запрос.УстановитьПараметр("Дата", 						ДатаДействия);
	Запрос.УстановитьПараметр("Сотрудник", 					Сотрудник);
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", 		ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	
	ПроверкаШтатногоРасписания = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация].ПроверкаШтатногоРасписания;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтпускПоУходуЗаРебенком.Дата,
	|	ОтпускПоУходуЗаРебенком.Организация,
	|	ВЫБОР
	|		КОГДА ОтпускПоУходуЗаРебенком.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|			ТОГДА ОтпускПоУходуЗаРебенком.Организация
	|		ИНАЧЕ ОтпускПоУходуЗаРебенком.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ОтпускПоУходуЗаРебенком.Ответственный,
	|	ОтпускПоУходуЗаРебенком.Ссылка,
	|	ОтпускПоУходуЗаРебенком.Сотрудник,
	|	ОтпускПоУходуЗаРебенком.ФизЛицо,
	|	ОтпускПоУходуЗаРебенком.ДатаДействия,
	|	ОтпускПоУходуЗаРебенком.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА ОтпускПоУходуЗаРебенком.Сотрудник.ВидЗанятости = &ВнутреннееСовместительство
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВнутреннийСовместитель,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации,
	|	РаботникиОрганизацииСрезПоследних.ЗанимаемыхСтавок,
	|	РаботникиОрганизацииСрезПоследних.ГрафикРаботы,
	|	РаботникиОрганизацииСрезПоследних.Сотрудник.Код КАК ТабельныйНомер,
	|	РаботникиОрганизацииСрезПоследних.ПричинаИзмененияСостояния,
	|	РаботникиОрганизацииСрезПоследних.Должность,
	|	РаботникиОрганизацииСрезПоследних.ТарифныйРазряд,
	|	ВЫБОР
	|		КОГДА ОтпускПоУходуЗаРебенком.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации
	|ИЗ
	|	Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		&Дата,
	|		Сотрудник = &Сотрудник) КАК РаботникиОрганизацииСрезПоследних
	|		ПО ОтпускПоУходуЗаРебенком.Сотрудник = РаботникиОрганизацииСрезПоследних.Сотрудник
	|			И (РаботникиОрганизацииСрезПоследних.Организация = ВЫБОР
	|				КОГДА ОтпускПоУходуЗаРебенком.Организация.ГоловнаяОрганизация = &парамПустаяОрганизация
	|					ТОГДА ОтпускПоУходуЗаРебенком.Организация
	|				ИНАЧЕ ОтпускПоУходуЗаРебенком.Организация.ГоловнаяОрганизация
	|			КОНЕЦ)
	|ГДЕ
	|	ОтпускПоУходуЗаРебенком.Ссылка = &ДокументСсылка";
				   
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "ПлановыеНачисления" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоОсновнымНачислениям(ВыборкаПоШапкеДокумента)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", 	 Ссылка);
	Запрос.УстановитьПараметр("ДатаВыхода",			 ВыборкаПоШапкеДокумента.ДатаОкончания + мДлинаСуток);
	Запрос.УстановитьПараметр("Сотрудник",			 ВыборкаПоШапкеДокумента.Сотрудник);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
 	
	УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация];	
	ПроверкаШтатногоРасписания = УчетнаяПолитикаПоПерсоналуОрганизации.ПроверкаШтатногоРасписания;
	
	Если ПроверкаШтатногоРасписания Тогда
		МассивСпособов = Новый Массив;
		МассивСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоДням);
		МассивСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам);
		
		МассивСпособовЧасовых = Новый Массив;
		МассивСпособовЧасовых.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке);
		
		МассивДействий = Новый Массив;
		МассивДействий.Добавить(Перечисления.ВидыДействияСНачислением.Начать);
		МассивДействий.Добавить(Перечисления.ВидыДействияСНачислением.Изменить);
		Запрос.УстановитьПараметр("МесячнаяСтавка",  Перечисления.ВидыТарифныхСтавок.Месячная);
		Запрос.УстановитьПараметр("ИзменитьРасчеты", МассивДействий);
		Запрос.УстановитьПараметр("МесячныеРасчеты", МассивСпособов);
		Запрос.УстановитьПараметр("ДневнаяСтавка",   Перечисления.ВидыТарифныхСтавок.Дневная);
		Запрос.УстановитьПараметр("ДневнойРасчет",   Перечисления.СпособыРасчетаОплатыТруда.ПоДневнойТарифнойСтавке);
		Запрос.УстановитьПараметр("ЧасоваяСтавка",   Перечисления.ВидыТарифныхСтавок.Часовая);
		Запрос.УстановитьПараметр("ЧасовыеРасчеты",  МассивСпособовЧасовых);
		Запрос.УстановитьПараметр("Дата",			 ДатаДействия);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ВыборкаПоШапкеДокумента.ПодразделениеОрганизации);
		Запрос.УстановитьПараметр("Должность",		 ВыборкаПоШапкеДокумента.Должность);
		Запрос.УстановитьПараметр("ТарифныйРазряд",  ВыборкаПоШапкеДокумента.ТарифныйРазряд);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	               |	ТЧОсновныеНачисления.ВидРасчета,
	               |	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
	               |	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
	               |	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
	               |	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
	               |	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
	               |	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
	               |	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
	               |	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
	               |	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
	               |	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
	               |	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
	               |	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
	               |	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
	               |	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	               |	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	               |	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	               |	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	               |	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	               |	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
	               |	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
	               |	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
	               |	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
	               |	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
	               |	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
	               |	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный
				   |	
	               |ПОМЕСТИТЬ ВТ_Показатели
	               |ИЗ
	               |	Документ.ОтпускПоУходуЗаРебенком.ОсновныеНачисления КАК ТЧОсновныеНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели
	               |		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели1
	               |		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели1.Ссылка
	               |			И (Показатели1.НомерСтроки = 1)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели2
	               |		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели2.Ссылка
	               |			И (Показатели2.НомерСтроки = 2)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели3
	               |		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели3.Ссылка
	               |			И (Показатели3.НомерСтроки = 3)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели4
	               |		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели4.Ссылка
	               |			И (Показатели4.НомерСтроки = 4)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели5
	               |		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели5.Ссылка
	               |			И (Показатели5.НомерСтроки = 5)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.Показатели КАК Показатели6
	               |		ПО ТЧОсновныеНачисления.ВидРасчета = Показатели6.Ссылка
	               |			И (Показатели6.НомерСтроки = 6)
	               |ГДЕ
	               |	ТЧОсновныеНачисления.Ссылка = &ДокументСсылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Показатели1.Показатель.Наименование,
	               |	Показатели2.Показатель.Наименование,
	               |	Показатели3.Показатель.Наименование,
	               |	Показатели4.Показатель.Наименование,
	               |	Показатели5.Показатель.Наименование,
	               |	Показатели6.Показатель.Наименование,
	               |	Показатели1.Показатель.ТипПоказателя,
	               |	Показатели2.Показатель.ТипПоказателя,
	               |	Показатели3.Показатель.ТипПоказателя,
	               |	Показатели4.Показатель.ТипПоказателя,
	               |	Показатели5.Показатель.ТипПоказателя,
	               |	Показатели6.Показатель.ТипПоказателя,
	               |	Показатели1.Показатель.ВозможностьИзменения,
	               |	Показатели2.Показатель.ВозможностьИзменения,
	               |	Показатели3.Показатель.ВозможностьИзменения,
	               |	Показатели4.Показатель.ВозможностьИзменения,
	               |	Показатели5.Показатель.ВозможностьИзменения,
	               |	Показатели6.Показатель.ВозможностьИзменения,
	               |	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели6.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели1.Показатель.Предопределенный,
	               |	Показатели2.Показатель.Предопределенный,
	               |	Показатели3.Показатель.Предопределенный,
	               |	Показатели4.Показатель.Предопределенный,
	               |	Показатели5.Показатель.Предопределенный,
	               |	Показатели6.Показатель.Предопределенный,
	               |	ТЧОсновныеНачисления.НомерСтроки,
	               |	ТЧОсновныеНачисления.ВидРасчета
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НомерСтроки
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |	
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.НомерСтроки,
	               |	Начисления.Действие,
	               |	Начисления.ВидРасчета,
				   |	ВЫБОР 
				   |		КОГДА Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ КАК ПроизвольнаяФормулаРасчета,
				   |	Показатели.КоличествоПоказателей КАК КоличествоПоказателей,
	               |	ЕСТЬNULL(Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
				   |	Показатели.Показатель1Наименование КАК Показатель1Наименование,
				   |	Показатели.Показатель2Наименование КАК Показатель2Наименование,
				   |	Показатели.Показатель3Наименование КАК Показатель3Наименование,
				   |	Показатели.Показатель4Наименование КАК Показатель4Наименование,
				   |	Показатели.Показатель5Наименование КАК Показатель5Наименование,
				   |	Показатели.Показатель6Наименование КАК Показатель6Наименование,
				   |	Показатели.Показатель1ТипПоказателя КАК Показатель1ТипПоказателя,
				   |	Показатели.Показатель2ТипПоказателя КАК Показатель2ТипПоказателя,
				   |	Показатели.Показатель3ТипПоказателя КАК Показатель3ТипПоказателя,
				   |	Показатели.Показатель4ТипПоказателя КАК Показатель4ТипПоказателя,
				   |	Показатели.Показатель5ТипПоказателя КАК Показатель5ТипПоказателя,
				   |	Показатели.Показатель6ТипПоказателя КАК Показатель6ТипПоказателя,
				   |	Показатели.Показатель1ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
				   |	Показатели.Показатель2ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
				   |	Показатели.Показатель3ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
				   |	Показатели.Показатель4ВозможностьИзменения КАК Показатель4ВозможностьИзменения,	
				   |	Показатели.Показатель5ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
				   |	Показатели.Показатель6ВозможностьИзменения КАК Показатель6ВозможностьИзменения,	
				   |	Показатели.Показатель1ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель2ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель3ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель4ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель5ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель6ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель1Предопределенный КАК Показатель1Предопределенный,
				   |	Показатели.Показатель2Предопределенный КАК Показатель2Предопределенный,
				   |	Показатели.Показатель3Предопределенный КАК Показатель3Предопределенный,
				   |	Показатели.Показатель4Предопределенный КАК Показатель4Предопределенный,
				   |	Показатели.Показатель5Предопределенный КАК Показатель5Предопределенный,
				   |	Показатели.Показатель6Предопределенный КАК Показатель6Предопределенный,
				   |	Начисления.ТарифныйРазряд1,
	               |	Начисления.ТарифныйРазряд2,
	               |	Начисления.ТарифныйРазряд3,
	               |	Начисления.ТарифныйРазряд4,
	               |	Начисления.ТарифныйРазряд5,
	               |	Начисления.ТарифныйРазряд6,
	               |	Начисления.Показатель1,
	               |	Начисления.Показатель2,
	               |	Начисления.Показатель3,
	               |	Начисления.Показатель4,
	               |	Начисления.Показатель5,
	               |	Начисления.Показатель6,
	               |
	               |	// предыдущие значения плановых начислений
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель1Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель1 
	               |	КОНЕЦ КАК ПредыдущийПоказатель1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель2Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель2
	               |	КОНЕЦ КАК ПредыдущийПоказатель2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель3Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель3
	               |	КОНЕЦ КАК ПредыдущийПоказатель3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель4Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель4
	               |	КОНЕЦ КАК ПредыдущийПоказатель4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель5Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель5
	               |	КОНЕЦ КАК ПредыдущийПоказатель5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель6Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель6
	               |	КОНЕЦ КАК ПредыдущийПоказатель6,
	               |
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта1Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта1 
	               |	КОНЕЦ КАК ПредыдущаяВалюта1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта2Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта2
	               |	КОНЕЦ КАК ПредыдущаяВалюта2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта3Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта3
	               |	КОНЕЦ КАК ПредыдущаяВалюта3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта4Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта4
	               |	КОНЕЦ КАК ПредыдущаяВалюта4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта5Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта5
	               |	КОНЕЦ КАК ПредыдущаяВалюта5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта6Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта6
	               |	КОНЕЦ КАК ПредыдущаяВалюта6,
	               |
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд1Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд1 
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд2Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд2
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд3Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд3
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд4Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд4
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд5Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд5
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд6Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд6
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд6
	               |
	               |";
	Если Не УчетнаяПолитикаПоПерсоналуОрганизации.ИспользуютсяНачисленияВВалюте Тогда
	   ТекстЗапроса = ТекстЗапроса + ",
				   |	&ВалютаРегУчета КАК Валюта1,
				   |	&ВалютаРегУчета КАК Валюта2,
				   |	&ВалютаРегУчета КАК Валюта3,
				   |	&ВалютаРегУчета КАК Валюта4,
				   |	&ВалютаРегУчета КАК Валюта5,
				   |	&ВалютаРегУчета КАК Валюта6";
	Иначе
		ТекстЗапроса = ТекстЗапроса + ",
				   |	Начисления.Валюта1,
				   |	Начисления.Валюта2,
				   |	Начисления.Валюта3,
				   |	Начисления.Валюта4,
				   |	Начисления.Валюта5,
				   |	Начисления.Валюта6";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ",
	               |	Начисления.ВидРасчета.ЗачетОтработанногоВремени КАК ОсновноеНачисление,
	               |	Начисления.ВидРасчета.СпособРасчета КАК СпособРасчета";
    Если ПроверкаШтатногоРасписания Тогда
		ТекстЗапроса = ТекстЗапроса + ",
	               |	ВЫБОР 
	               |		КОГДА Начисления.ВидРасчета.ЗачетОтработанногоВремени 
	               |				И Начисления.Действие В (&ИзменитьРасчеты) 
	               |			ТОГДА ВЫБОР 
	               |					КОГДА Начисления.ВидРасчета.СпособРасчета В (&МесячныеРасчеты) 
	               |							И ШтатноеРасписаниеОрганизации.ВидТарифнойСтавки = &МесячнаяСтавка 
	               |						ТОГДА ВЫБОР 
	               |								КОГДА Начисления.Показатель1 < ШтатноеРасписаниеОрганизации.МинимальнаяТарифнаяСтавка 
	               |										ИЛИ Начисления.Показатель1 > ШтатноеРасписаниеОрганизации.МаксимальнаяТарифнаяСтавка 
	               |									ТОГДА ЛОЖЬ 
	               |								ИНАЧЕ ИСТИНА 
	               |							  КОНЕЦ 
	               |
	               |					КОГДА Начисления.ВидРасчета.СпособРасчета = &ДневнойРасчет 
	               |							И ШтатноеРасписаниеОрганизации.ВидТарифнойСтавки = &ДневнаяСтавка 
	               |						ТОГДА ВЫБОР 
	               |								КОГДА Начисления.Показатель1 < ШтатноеРасписаниеОрганизации.МинимальнаяТарифнаяСтавка 
	               |										ИЛИ Начисления.Показатель1 > ШтатноеРасписаниеОрганизации.МаксимальнаяТарифнаяСтавка 
	               |									ТОГДА ЛОЖЬ 
	               |								ИНАЧЕ ИСТИНА 
	               |							  КОНЕЦ 
	               |
	               |					КОГДА Начисления.ВидРасчета.СпособРасчета В (&ЧасовыеРасчеты) 
	               |							И ШтатноеРасписаниеОрганизации.ВидТарифнойСтавки = &ЧасоваяСтавка 
	               |						ТОГДА ВЫБОР 
	               |								КОГДА Начисления.Показатель1 < ШтатноеРасписаниеОрганизации.МинимальнаяТарифнаяСтавка 
	               |										ИЛИ Начисления.Показатель1 > ШтатноеРасписаниеОрганизации.МаксимальнаяТарифнаяСтавка 
	               |									ТОГДА ЛОЖЬ 
	               |								ИНАЧЕ ИСТИНА 
	               |							  КОНЕЦ 
	               |
	               |					ИНАЧЕ ИСТИНА 
	               |				  КОНЕЦ 
	               |		ИНАЧЕ ИСТИНА 
	               |	КОНЕЦ КАК РазмерСоответствуетШТР";
	КонецЕсли;
			   
	ТекстЗапроса = ТекстЗапроса + "
	               |ИЗ
	               |	Документ.ОтпускПоУходуЗаРебенком.ОсновныеНачисления КАК Начисления
				   |	
				   |	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показатели КАК Показатели
				   |		ПО Начисления.НомерСтроки = Показатели.НомерСтроки
				   |";
    Если ПроверкаШтатногоРасписания Тогда
		ТекстЗапроса = ТекстЗапроса + "
	               |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций.СрезПоследних(
	               |					&Дата, 
	               |					Должность = &Должность 
	               |					И ПодразделениеОрганизации = &ПодразделениеОрганизации
	               |					И ТарифныйРазряд = &ТарифныйРазряд) КАК ШтатноеРасписаниеОрганизации
	               |		ПО (ИСТИНА)";
	КонецЕсли;
			   
	ТекстЗапроса = ТекстЗапроса + "
				   |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
				   |					&ДатаВыхода,
				   |					Сотрудник = &Сотрудник
				   |					И Организация = &ГоловнаяОрганизация) КАК ПредыдущиеНачисления
				   |		ПО Начисления.ВидРасчета = ВЫБОР
				   |				КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
				   |						И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
				   |					ТОГДА ПредыдущиеНачисления.ВидРасчетаЗавершения
				   |				ИНАЧЕ ПредыдущиеНачисления.ВидРасчета
				   |			КОНЕЦ				   
				   |			И ВЫБОР
				   |				КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
				   |						И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
				   |					ТОГДА ПредыдущиеНачисления.ДействиеЗавершения
				   |				ИНАЧЕ ПредыдущиеНачисления.Действие
				   |			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	               |
	               |ГДЕ
	               |	Начисления.Ссылка = &ДокументСсылка";

	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("ВалютаРегУчета", мВалютаРегламентированногоУчета);	

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоПлановымНачислениям()

// Формирует запрос по таблице "ПлановыеНачисления" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоДополнительнымНачислениям(ВыборкаПоШапкеДокумента)

	Запрос = Новый Запрос;

	УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация];	

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегУчета", мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ДатаВыхода", ВыборкаПоШапкеДокумента.ДатаОкончания + мДлинаСуток);
	Запрос.УстановитьПараметр("Сотрудник", ВыборкаПоШапкеДокумента.Сотрудник);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧДополнительныеНачисления.НомерСтроки КАК НомерСтроки,
	               |	ТЧДополнительныеНачисления.ВидРасчета,
	               |	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
	               |	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
	               |	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
	               |	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
	               |	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
	               |	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
	               |	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
	               |	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
	               |	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
	               |	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
	               |	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
	               |	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
	               |	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
	               |	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	               |	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	               |	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	               |	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	               |	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	               |	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
	               |	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
	               |	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
	               |	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
	               |	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
	               |	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
	               |	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный
	               |ПОМЕСТИТЬ ВТ_Показатели
	               |ИЗ
	               |	Документ.ОтпускПоУходуЗаРебенком.ДополнительныеНачисления КАК ТЧДополнительныеНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели
	               |		ПО ТЧДополнительныеНачисления.ВидРасчета = Показатели.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели1
	               |		ПО ТЧДополнительныеНачисления.ВидРасчета = Показатели1.Ссылка
	               |			И (Показатели1.НомерСтроки = 1)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели2
	               |		ПО ТЧДополнительныеНачисления.ВидРасчета = Показатели2.Ссылка
	               |			И (Показатели2.НомерСтроки = 2)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели3
	               |		ПО ТЧДополнительныеНачисления.ВидРасчета = Показатели3.Ссылка
	               |			И (Показатели3.НомерСтроки = 3)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели4
	               |		ПО ТЧДополнительныеНачисления.ВидРасчета = Показатели4.Ссылка
	               |			И (Показатели4.НомерСтроки = 4)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели5
	               |		ПО ТЧДополнительныеНачисления.ВидРасчета = Показатели5.Ссылка
	               |			И (Показатели5.НомерСтроки = 5)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ДополнительныеНачисленияОрганизаций.Показатели КАК Показатели6
	               |		ПО ТЧДополнительныеНачисления.ВидРасчета = Показатели6.Ссылка
	               |			И (Показатели6.НомерСтроки = 6)
	               |ГДЕ
	               |	ТЧДополнительныеНачисления.Ссылка = &ДокументСсылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Показатели1.Показатель.Наименование,
	               |	Показатели2.Показатель.Наименование,
	               |	Показатели3.Показатель.Наименование,
	               |	Показатели4.Показатель.Наименование,
	               |	Показатели5.Показатель.Наименование,
	               |	Показатели6.Показатель.Наименование,
	               |	Показатели1.Показатель.ТипПоказателя,
	               |	Показатели2.Показатель.ТипПоказателя,
	               |	Показатели3.Показатель.ТипПоказателя,
	               |	Показатели4.Показатель.ТипПоказателя,
	               |	Показатели5.Показатель.ТипПоказателя,
	               |	Показатели6.Показатель.ТипПоказателя,
	               |	Показатели1.Показатель.ВозможностьИзменения,
	               |	Показатели2.Показатель.ВозможностьИзменения,
	               |	Показатели3.Показатель.ВозможностьИзменения,
	               |	Показатели4.Показатель.ВозможностьИзменения,
	               |	Показатели5.Показатель.ВозможностьИзменения,
	               |	Показатели6.Показатель.ВозможностьИзменения,
	               |	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели6.ЗапрашиватьПриКадровыхПеремещениях,
	               |	Показатели1.Показатель.Предопределенный,
	               |	Показатели2.Показатель.Предопределенный,
	               |	Показатели3.Показатель.Предопределенный,
	               |	Показатели4.Показатель.Предопределенный,
	               |	Показатели5.Показатель.Предопределенный,
	               |	Показатели6.Показатель.Предопределенный,
	               |	ТЧДополнительныеНачисления.НомерСтроки,
	               |	ТЧДополнительныеНачисления.ВидРасчета
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НомерСтроки
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Начисления.НомерСтроки,
	               |	Начисления.Действие,
	               |	Начисления.ВидРасчета,
	               |	ЕСТЬNULL(Начисления.ВидРасчета.ТребуетВводаТарифногоРазряда, ЛОЖЬ) КАК ТребуетВводаТарифногоРазряда,
				   |	ВЫБОР 
				   |		КОГДА Начисления.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)
				   |			ТОГДА ИСТИНА
				   |		ИНАЧЕ ЛОЖЬ
				   |	КОНЕЦ КАК ПроизвольнаяФормулаРасчета,
				   |	Показатели.Показатель1Наименование КАК Показатель1Наименование,
				   |	Показатели.Показатель2Наименование КАК Показатель2Наименование,
				   |	Показатели.Показатель3Наименование КАК Показатель3Наименование,
				   |	Показатели.Показатель4Наименование КАК Показатель4Наименование,
				   |	Показатели.Показатель5Наименование КАК Показатель5Наименование,
				   |	Показатели.Показатель6Наименование КАК Показатель6Наименование,
				   |	Показатели.Показатель1ТипПоказателя КАК Показатель1ТипПоказателя,
				   |	Показатели.Показатель2ТипПоказателя КАК Показатель2ТипПоказателя,
				   |	Показатели.Показатель3ТипПоказателя КАК Показатель3ТипПоказателя,
				   |	Показатели.Показатель4ТипПоказателя КАК Показатель4ТипПоказателя,
				   |	Показатели.Показатель5ТипПоказателя КАК Показатель5ТипПоказателя,
				   |	Показатели.Показатель6ТипПоказателя КАК Показатель6ТипПоказателя,
				   |	Показатели.Показатель1ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
				   |	Показатели.Показатель2ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
				   |	Показатели.Показатель3ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
				   |	Показатели.Показатель4ВозможностьИзменения КАК Показатель4ВозможностьИзменения,	
				   |	Показатели.Показатель5ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
				   |	Показатели.Показатель6ВозможностьИзменения КАК Показатель6ВозможностьИзменения,	
				   |	Показатели.Показатель1ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель2ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель3ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель4ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель5ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель6ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
				   |	Показатели.Показатель1Предопределенный КАК Показатель1Предопределенный,
				   |	Показатели.Показатель2Предопределенный КАК Показатель2Предопределенный,
				   |	Показатели.Показатель3Предопределенный КАК Показатель3Предопределенный,
				   |	Показатели.Показатель4Предопределенный КАК Показатель4Предопределенный,
				   |	Показатели.Показатель5Предопределенный КАК Показатель5Предопределенный,
				   |	Показатели.Показатель6Предопределенный КАК Показатель6Предопределенный,
	               |	Начисления.Показатель1,
	               |	Начисления.Показатель2,
	               |	Начисления.Показатель3,
	               |	Начисления.Показатель4,
	               |	Начисления.Показатель5,
	               |	Начисления.Показатель6,
	               |	Начисления.ТарифныйРазряд1,
	               |	Начисления.ТарифныйРазряд2,
	               |	Начисления.ТарифныйРазряд3,
	               |	Начисления.ТарифныйРазряд4,
	               |	Начисления.ТарифныйРазряд5,
	               |	Начисления.ТарифныйРазряд6,
	               |
	               |	// предыдущие значения плановых начислений
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель1Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель1 
	               |	КОНЕЦ КАК ПредыдущийПоказатель1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель2Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель2
	               |	КОНЕЦ КАК ПредыдущийПоказатель2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель3Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель3
	               |	КОНЕЦ КАК ПредыдущийПоказатель3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель4Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель4
	               |	КОНЕЦ КАК ПредыдущийПоказатель4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель5Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель5
	               |	КОНЕЦ КАК ПредыдущийПоказатель5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Показатель6Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Показатель6
	               |	КОНЕЦ КАК ПредыдущийПоказатель6,
	               |
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта1Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта1 
	               |	КОНЕЦ КАК ПредыдущаяВалюта1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта2Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта2
	               |	КОНЕЦ КАК ПредыдущаяВалюта2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта3Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта3
	               |	КОНЕЦ КАК ПредыдущаяВалюта3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта4Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта4
	               |	КОНЕЦ КАК ПредыдущаяВалюта4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта5Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта5
	               |	КОНЕЦ КАК ПредыдущаяВалюта5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.Валюта6Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.Валюта6
	               |	КОНЕЦ КАК ПредыдущаяВалюта6,
	               |
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд1Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд1 
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд2Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд2
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд3Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд3
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд4Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд4
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд5Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд5
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеНачисления.ТарифныйРазряд6Завершения
	               |		ИНАЧЕ ПредыдущиеНачисления.ТарифныйРазряд6
	               |	КОНЕЦ КАК ПредыдущийТарифныйРазряд6
	               |";
	Если Не УчетнаяПолитикаПоПерсоналуОрганизации.ИспользуютсяНачисленияВВалюте Тогда
	   ТекстЗапроса = ТекстЗапроса + ",
				   |	&ВалютаРегУчета КАК Валюта1,
				   |	&ВалютаРегУчета КАК Валюта2,
				   |	&ВалютаРегУчета КАК Валюта3,
				   |	&ВалютаРегУчета КАК Валюта4,
				   |	&ВалютаРегУчета КАК Валюта5,
				   |	&ВалютаРегУчета КАК Валюта6";
	Иначе
		ТекстЗапроса = ТекстЗапроса + ",
				   |	Начисления.Валюта1,
				   |	Начисления.Валюта2,
				   |	Начисления.Валюта3,
				   |	Начисления.Валюта4,
				   |	Начисления.Валюта5,
				   |	Начисления.Валюта6";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ",
	               |	Начисления.ВидРасчета.СпособРасчета КАК СпособРасчета
	               |ИЗ
	               |	Документ.ОтпускПоУходуЗаРебенком.ДополнительныеНачисления КАК Начисления
	               |
				   |	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показатели КАК Показатели
				   |		ПО Начисления.НомерСтроки = Показатели.НомерСтроки
				   |
	               |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(
	               |				&ДатаВыхода,
	               |				Сотрудник = &Сотрудник
	               |				И Организация = &ГоловнаяОрганизация) КАК ПредыдущиеНачисления
	               |		ПО Начисления.ВидРасчета = ВЫБОР
				   |				КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
				   |						И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
				   |					ТОГДА ПредыдущиеНачисления.ВидРасчетаЗавершения
				   |				ИНАЧЕ ПредыдущиеНачисления.ВидРасчета
				   |			КОНЕЦ				   
				   |			И ВЫБОР
				   |				КОГДА ПредыдущиеНачисления.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
				   |						И ПредыдущиеНачисления.ПериодЗавершения < &ДатаВыхода
				   |					ТОГДА ПредыдущиеНачисления.ДействиеЗавершения
				   |				ИНАЧЕ ПредыдущиеНачисления.Действие
				   |			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	               |
	               |ГДЕ
	               |	Начисления.Ссылка = &ДокументСсылка";

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоПлановымНачислениям()

// Формирует запрос по таблице "ПлановыеУдержания" документа
//
// Параметры: 
//  Режим        - режим проведения.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоПлановымУдержаниям(ВыборкаПоШапкеДокумента)

	Запрос = Новый Запрос;

	УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации")[Организация];	

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ВалютаРегУчета", мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ДатаВыхода", ВыборкаПоШапкеДокумента.ДатаОкончания + мДлинаСуток);
	Запрос.УстановитьПараметр("ФизЛицо", ВыборкаПоШапкеДокумента.ФизЛицо);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТЧПлановыеУдержания.НомерСтроки КАК НомерСтроки,
	               |	ТЧПлановыеУдержания.ВидРасчета,
	               |	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
	               |	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
	               |	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
	               |	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
	               |	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
	               |	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
	               |	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
	               |	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
	               |	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
	               |	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
	               |	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
	               |	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
	               |	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
	               |	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	               |	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	               |	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	               |	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	               |	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	               |	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения
	               |ПОМЕСТИТЬ ВТ_Показатели
	               |ИЗ
	               |	Документ.ОтпускПоУходуЗаРебенком.ПлановыеУдержания КАК ТЧПлановыеУдержания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели
	               |		ПО ТЧПлановыеУдержания.ВидРасчета = Показатели.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели1
	               |		ПО ТЧПлановыеУдержания.ВидРасчета = Показатели1.Ссылка
	               |			И (Показатели1.НомерСтроки = 1)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели2
	               |		ПО ТЧПлановыеУдержания.ВидРасчета = Показатели2.Ссылка
	               |			И (Показатели2.НомерСтроки = 2)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели3
	               |		ПО ТЧПлановыеУдержания.ВидРасчета = Показатели3.Ссылка
	               |			И (Показатели3.НомерСтроки = 3)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели4
	               |		ПО ТЧПлановыеУдержания.ВидРасчета = Показатели4.Ссылка
	               |			И (Показатели4.НомерСтроки = 4)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели5
	               |		ПО ТЧПлановыеУдержания.ВидРасчета = Показатели5.Ссылка
	               |			И (Показатели5.НомерСтроки = 5)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УдержанияОрганизаций.Показатели КАК Показатели6
	               |		ПО ТЧПлановыеУдержания.ВидРасчета = Показатели6.Ссылка
	               |			И (Показатели6.НомерСтроки = 6)
	               |ГДЕ
	               |	ТЧПлановыеУдержания.Ссылка = &ДокументСсылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Показатели1.Показатель.Наименование,
	               |	Показатели2.Показатель.Наименование,
	               |	Показатели3.Показатель.Наименование,
	               |	Показатели4.Показатель.Наименование,
	               |	Показатели5.Показатель.Наименование,
	               |	Показатели6.Показатель.Наименование,
	               |	Показатели1.Показатель.ТипПоказателя,
	               |	Показатели2.Показатель.ТипПоказателя,
	               |	Показатели3.Показатель.ТипПоказателя,
	               |	Показатели4.Показатель.ТипПоказателя,
	               |	Показатели5.Показатель.ТипПоказателя,
	               |	Показатели6.Показатель.ТипПоказателя,
	               |	Показатели1.Показатель.ВозможностьИзменения,
	               |	Показатели2.Показатель.ВозможностьИзменения,
	               |	Показатели3.Показатель.ВозможностьИзменения,
	               |	Показатели4.Показатель.ВозможностьИзменения,
	               |	Показатели5.Показатель.ВозможностьИзменения,
	               |	Показатели6.Показатель.ВозможностьИзменения,
	               |	ТЧПлановыеУдержания.НомерСтроки,
	               |	ТЧПлановыеУдержания.ВидРасчета
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НомерСтроки
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Удержания.НомерСтроки,
	               |	Удержания.Действие,
	               |	Удержания.ВидРасчета,
	               |	Удержания.ВидРасчета.СпособРасчета КАК СпособРасчета,
				   |	Показатели.Показатель1Наименование КАК ВидРасчетаПоказатель1Наименование,
				   |	Показатели.Показатель1ТипПоказателя КАК ВидРасчетаПоказатель1ТипПоказателя,
				   |	Показатели.Показатель1ВозможностьИзменения КАК ВидРасчетаПоказатель1ВозможностьИзменения,
				   |	Показатели.Показатель2Наименование КАК ВидРасчетаПоказатель2Наименование,
				   |	Показатели.Показатель2ТипПоказателя КАК ВидРасчетаПоказатель2ТипПоказателя,
				   |	Показатели.Показатель2ВозможностьИзменения КАК ВидРасчетаПоказатель2ВозможностьИзменения,
				   |	Показатели.Показатель3Наименование КАК ВидРасчетаПоказатель3Наименование,
				   |	Показатели.Показатель3ТипПоказателя КАК ВидРасчетаПоказатель3ТипПоказателя,
				   |	Показатели.Показатель3ВозможностьИзменения КАК ВидРасчетаПоказатель3ВозможностьИзменения,
				   |	Показатели.Показатель4Наименование КАК ВидРасчетаПоказатель4Наименование,
				   |	Показатели.Показатель4ТипПоказателя КАК ВидРасчетаПоказатель4ТипПоказателя,
				   |	Показатели.Показатель4ВозможностьИзменения КАК ВидРасчетаПоказатель4ВозможностьИзменения,
				   |	Показатели.Показатель5Наименование КАК ВидРасчетаПоказатель5Наименование,
				   |	Показатели.Показатель5ТипПоказателя КАК ВидРасчетаПоказатель5ТипПоказателя,
				   |	Показатели.Показатель5ВозможностьИзменения КАК ВидРасчетаПоказатель5ВозможностьИзменения,
				   |	Показатели.Показатель6Наименование КАК ВидРасчетаПоказатель6Наименование,
				   |	Показатели.Показатель6ТипПоказателя КАК ВидРасчетаПоказатель6ТипПоказателя,
				   |	Показатели.Показатель6ВозможностьИзменения КАК ВидРасчетаПоказатель6ВозможностьИзменения,
	               |	Удержания.Показатель1,
	               |	Удержания.Показатель2,
	               |	Удержания.Показатель3,
	               |	Удержания.Показатель4,
	               |	Удержания.Показатель5,
	               |	Удержания.Показатель6,
	               |
	               |	// предыдущие значения показателей
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Показатель1Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Показатель1
	               |	КОНЕЦ КАК ПредыдущийПоказатель1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Показатель2Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Показатель2
	               |	КОНЕЦ КАК ПредыдущийПоказатель2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Показатель3Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Показатель3
	               |	КОНЕЦ КАК ПредыдущийПоказатель3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Показатель4Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Показатель4
	               |	КОНЕЦ КАК ПредыдущийПоказатель4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Показатель5Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Показатель5
	               |	КОНЕЦ КАК ПредыдущийПоказатель5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Показатель6Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Показатель6
	               |	КОНЕЦ КАК ПредыдущийПоказатель6,
	               |
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Валюта1Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Валюта1
	               |	КОНЕЦ КАК ПредыдущаяВалюта1,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Валюта2Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Валюта2
	               |	КОНЕЦ КАК ПредыдущаяВалюта2,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Валюта3Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Валюта3
	               |	КОНЕЦ КАК ПредыдущаяВалюта3,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Валюта4Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Валюта4
	               |	КОНЕЦ КАК ПредыдущаяВалюта4,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Валюта5Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Валюта5
	               |	КОНЕЦ КАК ПредыдущаяВалюта5,
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.Валюта6Завершения
	               |		ИНАЧЕ ПредыдущиеУдержания.Валюта6
	               |	КОНЕЦ КАК ПредыдущаяВалюта6,
				   |
	               |	ВЫБОР
	               |		КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |				И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |			ТОГДА ПредыдущиеУдержания.СпособОтраженияВБухучетеЗавершения
	               |		ИНАЧЕ ПредыдущиеУдержания.СпособОтраженияВБухучете
	               |	КОНЕЦ КАК ПредыдущийСпособОтраженияВБухучете
	               |";
	Если Не УчетнаяПолитикаПоПерсоналуОрганизации.ИспользуютсяНачисленияВВалюте Тогда
	   ТекстЗапроса = ТекстЗапроса + ",
				   |	&ВалютаРегУчета КАК Валюта1,
				   |	&ВалютаРегУчета КАК Валюта2,
				   |	&ВалютаРегУчета КАК Валюта3,
				   |	&ВалютаРегУчета КАК Валюта4,
				   |	&ВалютаРегУчета КАК Валюта5,
				   |	&ВалютаРегУчета КАК Валюта6";
	Иначе
		ТекстЗапроса = ТекстЗапроса + ",
				   |	Удержания.Валюта1,
				   |	Удержания.Валюта2,
				   |	Удержания.Валюта3,
				   |	Удержания.Валюта4,
				   |	Удержания.Валюта5,
				   |	Удержания.Валюта6";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + ",
	               |	Удержания.ДокументОснование,
	               |	Удержания.СпособОтраженияВБухучете
	               |ИЗ
	               |	Документ.ОтпускПоУходуЗаРебенком.ПлановыеУдержания КАК Удержания
	               |
	               |	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показатели КАК Показатели
				   |		ПО Удержания.НомерСтроки = Показатели.НомерСтроки
				   |
				   |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(
	               |				&ДатаВыхода,
	               |				ФизЛицо = &ФизЛицо
	               |				И Организация = &ГоловнаяОрганизация) КАК ПредыдущиеУдержания
	               |		ПО Удержания.ВидРасчета = ПредыдущиеУдержания.ВидРасчета
	               |			И Удержания.ДокументОснование = ПредыдущиеУдержания.ДокументОснование
	               |			И ВЫБОР
	               |				КОГДА ПредыдущиеУдержания.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	               |						И ПредыдущиеУдержания.ПериодЗавершения < &ДатаВыхода
	               |					ТОГДА ПредыдущиеУдержания.ДействиеЗавершения
	               |				ИНАЧЕ ПредыдущиеУдержания.Действие
	               |			КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Прекратить)
	               |
	               |ГДЕ
	               |	Удержания.Ссылка = &ДокументСсылка";

	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоПлановымУдержаниям()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не указана организация!", Отказ, Заголовок);
	КонецЕсли;
	
	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;

	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоШапкеДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Организация документа не соответствует организации, указанной в карточке сотрудника!", Отказ, Заголовок);
	КонецЕсли;

	// ВнутреннийСовместитель
	Если ВыборкаПоШапкеДокумента.ВнутреннийСовместитель Тогда
		ОбщегоНазначения.ОшибкаПриПроведении("Документ не может быть оформлен на внутреннего совместителя!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ПлановыеНачисления" документа
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиОсновныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, УчетнаяПолитикаПоПерсоналуОрганизации)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Основные начисления"": ";

	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ, Заголовок);
	ИначеЕсли (ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать или ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить) Тогда
		
		ИспользуютсяНачисленияВВалюте = УчетнаяПолитикаПоПерсоналуОрганизации[Организация].ИспользуютсяНачисленияВВалюте;
		ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);

		// Соответствие размера "основного" начисления штатному расписанию
		Если УчетнаяПолитикаПоПерсоналуОрганизации[Организация].ПроверкаШтатногоРасписания и Не ВыборкаПоСтрокамДокумента.РазмерСоответствуетШТР и Не ВыборкаПоСтрокамДокумента.ТребуетВводаТарифногоРазряда Тогда
			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "размер основного начисления не соответствует штатному расписанию!", Отказ, Заголовок);
		КонецЕсли;

	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано действие!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры

// Проверяет правильность заполнения реквизитов в строке ТЧ "ПлановыеНачисления" документа
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, УчетнаяПолитикаПоПерсоналуОрганизации)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Дополнительные начисления"": ";

	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано действие!", Отказ, Заголовок);
	КонецЕсли;
		
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано начисление!", Отказ, Заголовок);
	ИначеЕсли (ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать или ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить) Тогда
		
		ИспользуютсяНачисленияВВалюте = УчетнаяПолитикаПоПерсоналуОрганизации[Организация].ИспользуютсяНачисленияВВалюте;
		ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Истина, Отказ, Заголовок, ИспользуютсяНачисленияВВалюте, СоответствиеВалютныеСпособыРасчета);

	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения реквизитов в строке ТЧ "ПлановыеУдержания" документа
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по товарам документа, 
//  Отказ 						- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеСтрокиПлановыхУдержаний(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок, УчетнаяПолитикаПоПерсоналуОрганизации)
	
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
	""" табл. части ""Удержания"": ";

	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указан вид удержания!", Отказ, Заголовок);
	КонецЕсли;
	
	// Действие
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Действие) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано действие!", Отказ, Заголовок);
	КонецЕсли;
		
	Если (ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Начать)
	 ИЛИ (ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.Изменить) Тогда

		// Валюта
		Если УчетнаяПолитикаПоПерсоналуОрганизации[ВыборкаПоШапкеДокумента.Организация].ИспользуютсяНачисленияВВалюте Тогда
			Если СоответствиеВалютныеСпособыРасчета[ВыборкаПоСтрокамДокумента.СпособРасчета] Тогда
				
				Для СчПоказателей = 1 По 6 Цикл
					ТипПоказателя = ВыборкаПоСтрокамДокумента["ВидРасчетаПоказатель" + СчПоказателей + "ТипПоказателя"];
					ВозможностьИзменения = ВыборкаПоСтрокамДокумента["ВидРасчетаПоказатель" + СчПоказателей + "ВозможностьИзменения"];
					Если ТипПоказателя = Перечисления.ТипыПоказателейСхемМотивации.Денежный 
						И (ВозможностьИзменения = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется 
							Или ВозможностьИзменения = Перечисления.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете)
						И НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента["Валюта" + СчПоказателей]) Тогда
						ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана валюта для показателя """ + ВыборкаПоСтрокамДокумента["ВидРасчетаПоказатель" + СчПоказателей + "Наименование"] + """!", Отказ, Заголовок);
					КонецЕсли;					
					
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаПоСтрокамДокумента.СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда // регл. способ расчета
			
			Если ВыборкаПоСтрокамДокумента.Показатель1 = 0 
			   И ПроведениеРасчетов.СпособРасчетаТребуетРазмер(ВыборкаПоСтрокамДокумента.СпособРасчета) Тогда
			   
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан размер удержания!", Отказ, Заголовок);
				
			КонецЕсли;	
			
		Иначе // способ расчет по показателям мотивации
			
			Для СчПоказателей = 1 По 6 Цикл
				
				Если ВыборкаПоСтрокамДокумента.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
					ТипПоказателя = ВыборкаПоСтрокамДокумента["ВидРасчетаПоказатель" + СчПоказателей + "ТипПоказателя"];
				
					Если ВыборкаПоСтрокамДокумента["Показатель"+СчПоказателей] = 0 
					   И ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаПроцентная
					   И ТипПоказателя <> Перечисления.ТипыПоказателейСхемМотивации.ОценочнаяШкалаЧисловая
					   И (ВыборкаПоСтрокамДокумента["ВидРасчетаПоказатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.НеИзменяется
							Или ВыборкаПоСтрокамДокумента["ВидРасчетаПоказатель" + СчПоказателей + "ВозможностьИзменения"] = Перечисления.ИзменениеПоказателейСхемМотивации.ИзменяетсяПриРасчете) Тогда
						
						ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указан размер для показателя """ + ВыборкаПоСтрокамДокумента["ВидРасчетаПоказатель" + СчПоказателей + "Наименование"] + """!", Отказ, Заголовок);
						
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// По строке выборки результата запроса по документу формируем движения по регистру ПлановыеНачисленияРаботниковОрганизаций
//
// Параметры: 
//  ВыборкаПоШапкеДокумента 	- выборка из результата запроса по шапке документа,
//  ВыборкаПоРаботникиОрганизации 	- выборка из результата запроса по табличной чавсти документа,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуОсновныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, УчетнаяПолитикаПоПерсоналуОрганизации)

	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		Возврат;
	КонецЕсли;
	
 	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период                     = ВыборкаПоШапкеДокумента.ДатаДействия;
	
	// Измерения
	Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.Сотрудник                 	= ВыборкаПоШапкеДокумента.Сотрудник;
	
	// для основного начисления измерение ВидРасчетаИзмерение остается пустым - нельзя ввести 
	// более одного основных видов расчета
	Если НЕ ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
		Движение.ВидРасчетаИзмерение    = ВыборкаПоСтрокамДокумента.ВидРасчета;
	КонецЕсли; 
	
	// Ресурсы
	Движение.Действие				= ВыборкаПоСтрокамДокумента.Действие;
	Движение.ВидРасчета             = ВыборкаПоСтрокамДокумента.ВидРасчета;
 	Если ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
 		Движение.ТарифныйРазряд1		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд1;
 		Движение.ТарифныйРазряд2		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд2;
 		Движение.ТарифныйРазряд3		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд3;
 		Движение.ТарифныйРазряд4		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд4;
 		Движение.ТарифныйРазряд5		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд5;
 		Движение.ТарифныйРазряд6		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд6;
		Движение.Показатель1			= ВыборкаПоСтрокамДокумента.Показатель1;
		Движение.Показатель2			= ВыборкаПоСтрокамДокумента.Показатель2;
		Движение.Показатель3			= ВыборкаПоСтрокамДокумента.Показатель3;
		Движение.Показатель4			= ВыборкаПоСтрокамДокумента.Показатель4;
		Движение.Показатель5			= ВыборкаПоСтрокамДокумента.Показатель5;
		Движение.Показатель6			= ВыборкаПоСтрокамДокумента.Показатель6;
		Движение.Валюта1				= ВыборкаПоСтрокамДокумента.Валюта1;
		Движение.Валюта2				= ВыборкаПоСтрокамДокумента.Валюта2;
		Движение.Валюта3				= ВыборкаПоСтрокамДокумента.Валюта3;
		Движение.Валюта4				= ВыборкаПоСтрокамДокумента.Валюта4;
		Движение.Валюта5				= ВыборкаПоСтрокамДокумента.Валюта5;
		Движение.Валюта6				= ВыборкаПоСтрокамДокумента.Валюта6;
	КонецЕсли;

	// Устанавливаем дату действия и возвращаем значения показателей до ухода в отпуск
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда

		Движение.ПериодЗавершения = ВыборкаПоШапкеДокумента.ДатаОкончания;
		Движение.ВидРасчетаЗавершения = ВыборкаПоСтрокамДокумента.ВидРасчета;
		
		Если ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель1 <> NULL Тогда
			// восстанавливаем значения, действовавшие до ухода в отпуск
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Начать;
			
			Движение.ТарифныйРазряд1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд1;
			Движение.ТарифныйРазряд2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд2;
			Движение.ТарифныйРазряд3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд3;
			Движение.ТарифныйРазряд4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд4;
			Движение.ТарифныйРазряд5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд5;
			Движение.ТарифныйРазряд6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд6;
			
			Движение.Показатель1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель1;
			Движение.Показатель2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель2;
			Движение.Показатель3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель3;
			Движение.Показатель4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель4;
			Движение.Показатель5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель5;
			Движение.Показатель6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель6;
			
			Движение.Валюта1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта1;
			Движение.Валюта2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта2;
			Движение.Валюта3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта3;
			Движение.Валюта4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта4;
			Движение.Валюта5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта5;
			Движение.Валюта6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта6;
		Иначе
			// прекращаем начисления, дейстовавшие на время отпуска
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистру ПлановыеНачисленияРаботниковОрганизаций
//
// Параметры: 
//  ВыборкаПоШапкеДокумента 	- выборка из результата запроса по шапке документа,
//  ВыборкаПоРаботникиОрганизации 	- выборка из результата запроса по табличной чавсти документа,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, УчетнаяПолитикаПоПерсоналуОрганизации)

	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПлановыеНачисленияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период                     = ВыборкаПоШапкеДокумента.ДатаДействия;
	
	// Измерения
	Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.Сотрудник                 	= ВыборкаПоШапкеДокумента.Сотрудник;
	Движение.ВидРасчетаИзмерение    	= ВыборкаПоСтрокамДокумента.ВидРасчета;
	
	// Ресурсы
	Движение.Действие				= ВыборкаПоСтрокамДокумента.Действие;
	Движение.ВидРасчета					= ВыборкаПоСтрокамДокумента.ВидРасчета;
 	Если ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
 		Движение.ТарифныйРазряд1		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд1;
 		Движение.ТарифныйРазряд2		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд2;
 		Движение.ТарифныйРазряд3		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд3;
 		Движение.ТарифныйРазряд4		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд4;
 		Движение.ТарифныйРазряд5		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд5;
 		Движение.ТарифныйРазряд6		= ВыборкаПоСтрокамДокумента.ТарифныйРазряд6;
		Движение.Показатель1			= ВыборкаПоСтрокамДокумента.Показатель1;
		Движение.Показатель2			= ВыборкаПоСтрокамДокумента.Показатель2;
		Движение.Показатель3			= ВыборкаПоСтрокамДокумента.Показатель3;
		Движение.Показатель4			= ВыборкаПоСтрокамДокумента.Показатель4;
		Движение.Показатель5			= ВыборкаПоСтрокамДокумента.Показатель5;
		Движение.Показатель6			= ВыборкаПоСтрокамДокумента.Показатель6;
		Движение.Валюта1				= ВыборкаПоСтрокамДокумента.Валюта1;
		Движение.Валюта2				= ВыборкаПоСтрокамДокумента.Валюта2;
		Движение.Валюта3				= ВыборкаПоСтрокамДокумента.Валюта3;
		Движение.Валюта4				= ВыборкаПоСтрокамДокумента.Валюта4;
		Движение.Валюта5				= ВыборкаПоСтрокамДокумента.Валюта5;
		Движение.Валюта6				= ВыборкаПоСтрокамДокумента.Валюта6;
	КонецЕсли;

	// Устанавливаем дату действия и возвращаем значения показателей до ухода в отпуск
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда

		Движение.ПериодЗавершения = ВыборкаПоШапкеДокумента.ДатаОкончания;
		Движение.ВидРасчетаЗавершения = ВыборкаПоСтрокамДокумента.ВидРасчета;
		
		Если ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель1 <> NULL Тогда
			// восстанавливаем значения, действовавшие до ухода в отпуск
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Начать;
			
			Движение.ТарифныйРазряд1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд1;
			Движение.ТарифныйРазряд2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд2;
			Движение.ТарифныйРазряд3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд3;
			Движение.ТарифныйРазряд4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд4;
			Движение.ТарифныйРазряд5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд5;
			Движение.ТарифныйРазряд6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийТарифныйРазряд6;
			
			Движение.Показатель1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель1;
			Движение.Показатель2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель2;
			Движение.Показатель3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель3;
			Движение.Показатель4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель4;
			Движение.Показатель5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель5;
			Движение.Показатель6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель6;
			
			Движение.Валюта1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта1;
			Движение.Валюта2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта2;
			Движение.Валюта3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта3;
			Движение.Валюта4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта4;
			Движение.Валюта5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта5;
			Движение.Валюта6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта6;
		Иначе
			// прекращаем начисления, дейстовавшие на время отпуска
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

// По строке выборки результата запроса по документу формируем движения по регистру ПлановыеУдержанияРаботниковОрганизаций
//
// Параметры: 
//  ВыборкаПоШапкеДокумента 	- выборка из результата запроса по шапке документа,
//  ВыборкаПоРаботникиОрганизации 	- выборка из результата запроса по табличной чавсти документа,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуПлановыхУдержаний(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)

	Если ВыборкаПоСтрокамДокумента.Действие = Перечисления.ВидыДействияСНачислением.НеИзменять Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ПлановыеУдержанияРаботниковОрганизаций.Добавить();
	
	// Свойства
	Движение.Период                     = ВыборкаПоШапкеДокумента.ДатаДействия;

	// Измерения
	Движение.ФизЛицо                    = ВыборкаПоШапкеДокумента.ФизЛицо;
	Движение.Организация				= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.ВидРасчета                 = ВыборкаПоСтрокамДокумента.ВидРасчета;
	Движение.ДокументОснование          = ВыборкаПоСтрокамДокумента.ДокументОснование;
	
	// Ресурсы
	Движение.Действие					= ВыборкаПоСтрокамДокумента.Действие;
	Если ВыборкаПоСтрокамДокумента.Действие <> Перечисления.ВидыДействияСНачислением.Прекратить Тогда
		Движение.Показатель1			= ВыборкаПоСтрокамДокумента.Показатель1;
		Движение.Показатель2			= ВыборкаПоСтрокамДокумента.Показатель2;
		Движение.Показатель3			= ВыборкаПоСтрокамДокумента.Показатель3;
		Движение.Показатель4			= ВыборкаПоСтрокамДокумента.Показатель4;
		Движение.Показатель5			= ВыборкаПоСтрокамДокумента.Показатель5;
		Движение.Показатель6			= ВыборкаПоСтрокамДокумента.Показатель6;
		Движение.Валюта1				= ВыборкаПоСтрокамДокумента.Валюта1;
		Движение.Валюта2				= ВыборкаПоСтрокамДокумента.Валюта2;
		Движение.Валюта3				= ВыборкаПоСтрокамДокумента.Валюта3;
		Движение.Валюта4				= ВыборкаПоСтрокамДокумента.Валюта4;
		Движение.Валюта5				= ВыборкаПоСтрокамДокумента.Валюта5;
		Движение.Валюта6				= ВыборкаПоСтрокамДокумента.Валюта6;
		Движение.СпособОтраженияВБухучете = ВыборкаПоСтрокамДокумента.СпособОтраженияВБухучете;
	КонецЕсли;
	
	// Устанавливаем дату действия и возвращаем значения показателей до ухода в отпуск
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда

		Движение.ПериодЗавершения = ВыборкаПоШапкеДокумента.ДатаОкончания;
		
		Если ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель1 <> NULL Тогда
			// восстанавливаем значения, действовавшие до ухода в отпуск
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Начать;
			
			Движение.Показатель1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель1;
			Движение.Показатель2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель2;
			Движение.Показатель3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель3;
			Движение.Показатель4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель4;
			Движение.Показатель5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель5;
			Движение.Показатель6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущийПоказатель6;
			
			Движение.Валюта1Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта1;
			Движение.Валюта2Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта2;
			Движение.Валюта3Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта3;
			Движение.Валюта4Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта4;
			Движение.Валюта5Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта5;
			Движение.Валюта6Завершения = ВыборкаПоСтрокамДокумента.ПредыдущаяВалюта6;

			Движение.СпособОтраженияВБухучетеЗавершения = ВыборкаПоСтрокамДокумента.ПредыдущийСпособОтраженияВБухучете;
		Иначе
			// прекращаем начисления, дейстовавшие на время отпуска
			Движение.ДействиеЗавершения = Перечисления.ВидыДействияСНачислением.Прекратить;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	// Проверка ручной корректировки
	Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту();
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		
		УчетнаяПолитикаПоПерсоналуОрганизации = глЗначениеПеременной("глУчетнаяПолитикаПоПерсоналуОрганизации");

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// получим реквизиты табличной части
			ВыборкаПоНачислениям = СформироватьЗапросПоОсновнымНачислениям(ВыборкаПоШапкеДокумента).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоНачислениям.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиОсновныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок, УчетнаяПолитикаПоПерсоналуОрганизации);

				Если НЕ Отказ Тогда
					ДобавитьСтрокуОсновныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетнаяПолитикаПоПерсоналуОрганизации);
				КонецЕсли;

			КонецЦикла;
			
			// получим реквизиты табличной части
			ВыборкаПоНачислениям = СформироватьЗапросПоДополнительнымНачислениям(ВыборкаПоШапкеДокумента).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоНачислениям.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, Отказ, Заголовок, УчетнаяПолитикаПоПерсоналуОрганизации);

				Если НЕ Отказ Тогда
					ДобавитьСтрокуДополнительныеНачисления(ВыборкаПоШапкеДокумента, ВыборкаПоНачислениям, УчетнаяПолитикаПоПерсоналуОрганизации);
				КонецЕсли;

			КонецЦикла;
			
			// получим реквизиты табличной части
			ВыборкаПоУдержаниям = СформироватьЗапросПоПлановымУдержаниям(ВыборкаПоШапкеДокумента).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоУдержаниям.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиПлановыхУдержаний(ВыборкаПоШапкеДокумента, ВыборкаПоУдержаниям, Отказ, Заголовок, УчетнаяПолитикаПоПерсоналуОрганизации);

				Если НЕ Отказ Тогда
					ДобавитьСтрокуПлановыхУдержаний(ВыборкаПоШапкеДокумента, ВыборкаПоУдержаниям);
				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
мДлинаСуток = 86400;
