
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ДействующаяСтруктура = КомпоновщикНастроек.Настройки.Структура[0];
	ДействующаяСтруктура.Использование = Истина;
	
	ДопРазрезы = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПолучитьПолныйСписокИменРазрезов();
	ОсновнаяСтруктураОтчета_Статья = ?(фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("БюджетированиеПоОрганизациям"),ДействующаяСтруктура.Структура[0].Структура[0],ДействующаяСтруктура.Структура[0]);
	Для Каждого Поле Из ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы Цикл
		Попытка
			Имя = Строка(Поле.Поле);
			Если Найти(Имя,"Разрез")<>0 Тогда
				Поле.Использование = ДопРазрезы.НайтиПоЗначению(Имя)<>Неопределено;
				Поле.Заголовок = фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПредставлениеРазреза(Перечисления.фин_ФактическиеПоказателиБюджетирования[Имя]);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	ПР =  КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти("ИмяРегистра");
	Если ПР.Значение<>"" Тогда
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса(ПР.Значение);
		Если ПР.Значение="фин_МониторингКорректировок" Тогда
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Причина корректировки";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("ПричинаКорректировки");
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Способ корректировки";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("СпособКорректировки");
		ИначеЕсли ПР.Значение="фин_МониторингНепринятияСтрокБюджетов" Тогда
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Причина отклонения";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("ПричинаОтклонения");
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Способ корректировки";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("СпособКорректировки");
		ИначеЕсли ПР.Значение="фин_АнализОтклоненийФактическихДанных" Тогда
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Причина отклонения фактических данных";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("ПричинаОтклоненияФактическихДанных");
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Документ рассмотрения";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("ДокументРассмотрения");
		ИначеЕсли ПР.Значение="фин_КонтролируемыеФинансовыеПоказатели" Тогда
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Контролирующий сценарий";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("КонтролирующийСценарий");
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Сумма лимита в валюте сценария";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("СуммаСценарияКонтроль");
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Сумма исполнения в валюте сценария";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("СуммаСценарияИсполнение");
			ОсновнаяСтруктураОтчета_Статья.ПоляГруппировки.Элементы.Очистить();
			НовоеПоле = ОсновнаяСтруктураОтчета_Статья.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ФинансовыйПоказатель");
			НовоеПоле.Использование=Истина;
			НовоеПоле.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия;
		ИначеЕсли ПР.Значение="фин_ЦелевыеЗначенияПоБюджетам" Тогда
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Контролирующий сценарий";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("КонтролирующийСценарий");
			Поле = ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Заголовок = "Сумма лимита в валюте сценария";
			Поле.Использование = Истина;
			Поле.Поле = Новый ПолеКомпоновкиДанных("СуммаСценарияКонтроль");
			ОсновнаяСтруктураОтчета_Статья.ПоляГруппировки.Элементы.Очистить();
			НовоеПоле = ОсновнаяСтруктураОтчета_Статья.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ФинансовыйПоказатель");
			НовоеПоле.Использование=Истина;
			НовоеПоле.ТипГруппировки=ТипГруппировкиКомпоновкиДанных.Иерархия;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Поле Из ОсновнаяСтруктураОтчета_Статья.Структура[0].Выбор.Элементы Цикл
		Попытка
			Имя = Строка(Поле.Поле);
			Если Имя = "Регистратор" ИЛИ Имя = "Период" ИЛИ ТипЗнч(Поле)=Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
				Если Поле.Заголовок = "Исходные данные для регистрации" Тогда
					Поле.Использование = ПР.Значение="" ИЛИ ПР.Значение="фин_Бюджет" ИЛИ ПР.Значение = "фин_ОборотыБюджетов" ИЛИ ПР.Значение = "фин_ПрогнозИсполненияБюджетов";
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			Если Найти(Имя,"Разрез")=0 Тогда
				ИмяРегистра = ?(ПР.Значение<>"" И ПР.Значение<>"фин_Бюджет",ПР.Значение,"фин_ОборотыБюджетов");
				Если Метаданные.РегистрыНакопления.Найти(ИмяРегистра)<>Неопределено Тогда
					Поле.Использование = Метаданные.РегистрыНакопления[ИмяРегистра].Измерения.Найти(Имя)<>Неопределено ИЛИ Метаданные.РегистрыНакопления[ИмяРегистра].Реквизиты.Найти(Имя)<>Неопределено ИЛИ Метаданные.РегистрыНакопления[ИмяРегистра].Ресурсы.Найти(Имя)<>Неопределено;
				ИначеЕсли Метаданные.РегистрыСведений.Найти(ИмяРегистра)<>Неопределено Тогда
					Поле.Использование = Метаданные.РегистрыСведений[ИмяРегистра].Измерения.Найти(Имя)<>Неопределено ИЛИ Метаданные.РегистрыСведений[ИмяРегистра].Реквизиты.Найти(Имя)<>Неопределено ИЛИ Метаданные.РегистрыСведений[ИмяРегистра].Ресурсы.Найти(Имя)<>Неопределено;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Функция ТекстЗапроса(ИмяРегистра)
	МассивРегистров = фин_ОбщегоНазначенияВызовСервераПовтИсп.РегистрыФактическихДанных();
	Если ИмяРегистра = "фин_МониторингКорректировок" Тогда
		Возврат "ВЫБРАТЬ
		|	фин_СтатьиБюджета.Владелец КАК Бюджет,
		|	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	фин_СтатьиБюджета.ФинансовыйПоказатель
		|ПОМЕСТИТЬ ВТ_Статьи
		|ИЗ
		|	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Статьи.Бюджет,
		|	ВТ_Статьи.СтатьяБюджета,
		|	ВТ_Статьи.ФинансовыйПоказатель,
		|	фин_ОборотыБюджетов.Регистратор,
	    |	фин_ОборотыБюджетов.ДокументПланирования,
		|	фин_ОборотыБюджетов.Период,
		|	фин_ОборотыБюджетов.Организация,
		|	фин_ОборотыБюджетов.Сценарий,
		|	фин_ОборотыБюджетов.ПериодПланирования,
		|	фин_ОборотыБюджетов.УправленческоеПодразделение,
		|	фин_ОборотыБюджетов.Проект,
		|	фин_ОборотыБюджетов.Номенклатура,
		|	фин_ОборотыБюджетов.Контрагент,
		|	фин_ОборотыБюджетов.Валюта,
		|	фин_ОборотыБюджетов.Количество,
		|	фин_ОборотыБюджетов.СуммаУпр,
		|	фин_ОборотыБюджетов.ВалютнаяСумма,
		|	фин_ОборотыБюджетов.СуммаСценария,
		|	фин_ОборотыБюджетов.ПричинаКорректировки,
		|	фин_ОборотыБюджетов.СпособКорректировки,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
		|	NULL КАК ПриходРасход
		|ИЗ
		|	ВТ_Статьи КАК ВТ_Статьи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.фин_МониторингКорректировок КАК фин_ОборотыБюджетов
		|		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ОборотыБюджетов.ФинансовыйПоказатель";
	ИначеЕсли ИмяРегистра = "фин_МониторингНепринятияСтрокБюджетов" Тогда
		Возврат "ВЫБРАТЬ
		|	фин_СтатьиБюджета.Владелец КАК Бюджет,
		|	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		|	фин_СтатьиБюджета.ФинансовыйПоказатель
		|ПОМЕСТИТЬ ВТ_Статьи
		|ИЗ
		|	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Статьи.Бюджет,
		|	ВТ_Статьи.СтатьяБюджета,
		|	ВТ_Статьи.ФинансовыйПоказатель,
		|	фин_ОборотыБюджетов.Регистратор,
	    |	фин_ОборотыБюджетов.ДокументПланирования,
		|	фин_ОборотыБюджетов.Период,
		|	фин_ОборотыБюджетов.Организация,
		|	фин_ОборотыБюджетов.Сценарий,
		|	фин_ОборотыБюджетов.ПериодПланирования,
		|	фин_ОборотыБюджетов.УправленческоеПодразделение,
		|	фин_ОборотыБюджетов.Проект,
		|	фин_ОборотыБюджетов.Номенклатура,
		|	фин_ОборотыБюджетов.Контрагент,
		|	фин_ОборотыБюджетов.Валюта,
		|	фин_ОборотыБюджетов.Количество,
		|	фин_ОборотыБюджетов.СуммаУпр,
		|	фин_ОборотыБюджетов.ВалютнаяСумма,
		|	фин_ОборотыБюджетов.СуммаСценария,
		|	фин_ОборотыБюджетов.ПричинаОтклонения,
		|	фин_ОборотыБюджетов.СпособКорректировки,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
		|	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
		|	NULL КАК ПриходРасход
		|ИЗ
		|	ВТ_Статьи КАК ВТ_Статьи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.фин_МониторингНепринятияСтрокБюджетов КАК фин_ОборотыБюджетов
		|		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ОборотыБюджетов.ФинансовыйПоказатель";
	ИначеЕсли ИмяРегистра = "фин_АнализОтклоненийФактическихДанных" Тогда
		Возврат "ВЫБРАТЬ
		        |	фин_СтатьиБюджета.Владелец КАК Бюджет,
		        |	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
		        |	фин_СтатьиБюджета.ФинансовыйПоказатель
		        |ПОМЕСТИТЬ ВТ_Статьи
		        |ИЗ
		        |	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ВТ_Статьи.Бюджет,
		        |	ВТ_Статьи.СтатьяБюджета,
		        |	ВТ_Статьи.ФинансовыйПоказатель,
		        |	фин_ОборотыБюджетов.Регистратор,
		        |	фин_ОборотыБюджетов.Период,
		        |	фин_ОборотыБюджетов.Организация,
		        |	фин_ОборотыБюджетов.Сценарий,
		        |	фин_ОборотыБюджетов.ПериодПланирования,
		        |	фин_ОборотыБюджетов.УправленческоеПодразделение,
		        |	фин_ОборотыБюджетов.Проект,
		        |	фин_ОборотыБюджетов.Номенклатура,
		        |	фин_ОборотыБюджетов.Контрагент,
		        |	фин_ОборотыБюджетов.Валюта,
		        |	фин_ОборотыБюджетов.Количество,
		        |	фин_ОборотыБюджетов.СуммаУпр,
		        |	фин_ОборотыБюджетов.ВалютнаяСумма,
		        |	фин_ОборотыБюджетов.СуммаСценария,
		        |	фин_ОборотыБюджетов.ПричинаОтклоненияФактическихДанных,
		        |	фин_ОборотыБюджетов.ДокументРассмотрения,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
		        |	NULL КАК ПриходРасход,
		        |	фин_ОборотыБюджетов.ДокументРассмотрения.ОтветственныйЗаОтклонение КАК ОтветственноеЛицо,
		        |	фин_ОборотыБюджетов.ПричинаОтклоненияФактическихДанных.ВидВлиянияНаФинансовыйРезультат КАК ВидВлиянияНаФинансовыйРезультат,
		        |	фин_ОборотыБюджетов.ПричинаОтклоненияФактическихДанных.ВидОтклонения КАК ВидОтклонения,
		        |	фин_ОборотыБюджетов.ПричинаОтклоненияФактическихДанных.СтруктурноеОтклонение КАК СтруктурноеОтклонение,
		        |	фин_ОборотыБюджетов.ПричинаОтклоненияФактическихДанных.ВидСтруктурногоОтклонения КАК ВидСтруктурногоОтклонения
		        |ИЗ
		        |	ВТ_Статьи КАК ВТ_Статьи
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.фин_АнализОтклоненийФактическихДанных КАК фин_ОборотыБюджетов
		        |		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ОборотыБюджетов.ФинансовыйПоказатель";
	ИначеЕсли ИмяРегистра = "фин_КонтролируемыеФинансовыеПоказатели" Тогда
		Возврат "ВЫБРАТЬ
		        |	фин_ОборотыБюджетов.ФинансовыйПоказатель,
		        |	фин_ОборотыБюджетов.Регистратор,
	    		|	фин_ОборотыБюджетов.Регистратор КАК ДокументПланирования,
		        |	фин_ОборотыБюджетов.Период,
		        |	фин_ОборотыБюджетов.Организация,
		        |	фин_ОборотыБюджетов.Сценарий,
		        |	фин_ОборотыБюджетов.ПериодПланирования,
		        |	фин_ОборотыБюджетов.УправленческоеПодразделение,
		        |	фин_ОборотыБюджетов.Проект,
		        |	фин_ОборотыБюджетов.Номенклатура,
		        |	фин_ОборотыБюджетов.Контрагент,
		        |	фин_ОборотыБюджетов.СуммаСценарияКонтроль,
		        |	фин_ОборотыБюджетов.СуммаСценарияИсполнение,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
		        |	фин_ОборотыБюджетов.КонтролирующийСценарий,
		        |	фин_ОборотыБюджетов.ИспользованиеКонтролируемогоЗначения
		        |ИЗ
		        |	РегистрНакопления.фин_КонтролируемыеФинансовыеПоказатели КАК фин_ОборотыБюджетов";
	ИначеЕсли ИмяРегистра = "фин_ЦелевыеЗначенияПоБюджетам" Тогда
		Возврат "ВЫБРАТЬ
		        |	фин_ОборотыБюджетов.ФинансовыйПоказатель,
		        |	фин_ОборотыБюджетов.Регистратор,
	    		|	фин_ОборотыБюджетов.Регистратор КАК ДокументПланирования,
		        |	фин_ОборотыБюджетов.Период,
		        |	фин_ОборотыБюджетов.Организация,
		        |	фин_ОборотыБюджетов.Сценарий,
		        |	фин_ОборотыБюджетов.ПериодПланирования,
		        |	фин_ОборотыБюджетов.УправленческоеПодразделение,
		        |	фин_ОборотыБюджетов.Проект,
		        |	фин_ОборотыБюджетов.Номенклатура,
		        |	фин_ОборотыБюджетов.Контрагент,
		        |	фин_ОборотыБюджетов.СуммаСценарияКонтроль,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
		        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
		        |	фин_ОборотыБюджетов.КонтролирующийСценарий,
		        |	фин_ОборотыБюджетов.ИспользованиеКонтролируемогоЗначения
		        |ИЗ
		        |	РегистрСведений.фин_ЦелевыеЗначенияПоБюджетам КАК фин_ОборотыБюджетов";
	ИначеЕсли ИмяРегистра = "фин_Бюджет" Тогда
		ПараметрВид = КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти("ВидДанных");
		Если ПараметрВид<>Неопределено Тогда
			Если ПараметрВид.Значение = Перечисления.фин_ВидыДанныхОтчета.Фактические Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			        |	фин_СтатьиБюджета.Владелец КАК Бюджет,
			        |	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
			        |	фин_СтатьиБюджета.ФинансовыйПоказатель
			        |ПОМЕСТИТЬ ВТ_Статьи
			        |ИЗ
			        |	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
			        |;
			        |";
			Для Каждого ИмяРегистра Из МассивРегистров Цикл
					ТекстЗапроса = ТекстЗапроса+?(МассивРегистров.Найти(ИмяРегистра)=0,"","
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|") +"	
			        |////////////////////////////////////////////////////////////////////////////////
			        |ВЫБРАТЬ
			        |	ВТ_Статьи.Бюджет,
			        |	ВТ_Статьи.СтатьяБюджета,
			        |	ВТ_Статьи.ФинансовыйПоказатель,
			        |	фин_ОборотыБюджетов.Регистратор,
	    			|	фин_ОборотыБюджетов.ДокументПланирования,
			        |	фин_ОборотыБюджетов.Период,
			        |	фин_ОборотыБюджетов.Организация,
			        |	фин_ОборотыБюджетов.Сценарий,
			        |	фин_ОборотыБюджетов.ПериодПланирования,
			        |	фин_ОборотыБюджетов.УправленческоеПодразделение,
			        |	фин_ОборотыБюджетов.Проект,
			        |	фин_ОборотыБюджетов.Номенклатура,
			        |	фин_ОборотыБюджетов.Контрагент,
			        |	фин_ОборотыБюджетов.Валюта,
			        |	фин_ОборотыБюджетов.Количество,
			        |	фин_ОборотыБюджетов.СуммаУпр,
			        |	фин_ОборотыБюджетов.ВалютнаяСумма,
			        |	фин_ОборотыБюджетов.СуммаСценария,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
			        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
					|	фин_ОборотыБюджетов.НомерСтрокиИсточника,
					|	фин_ОборотыБюджетов.ВидДанных  КАК ВидДанных,
					|	фин_ОборотыБюджетов.ИмяИсточника КАК ИмяИсточника,
					|	фин_ОборотыБюджетов.Схема,
					|	фин_ОборотыБюджетов.Правило,
			        |	NULL КАК ПриходРасход
			        |ИЗ
			        |	ВТ_Статьи КАК ВТ_Статьи
			        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления."+ИмяРегистра+" КАК фин_ОборотыБюджетов
			        |		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ОборотыБюджетов.ФинансовыйПоказатель";
				КонецЦикла;
				Возврат ТекстЗапроса;
			ИначеЕсли ПараметрВид.Значение = Перечисления.фин_ВидыДанныхОтчета.Прогнозные Тогда
				Возврат "ВЫБРАТЬ
				        |	фин_СтатьиБюджета.Владелец КАК Бюджет,
				        |	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
				        |	фин_СтатьиБюджета.ФинансовыйПоказатель
				        |ПОМЕСТИТЬ ВТ_Статьи
				        |ИЗ
				        |	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
				        |;
				        |
				        |////////////////////////////////////////////////////////////////////////////////
				        |ВЫБРАТЬ
				        |	ВТ_Статьи.Бюджет,
				        |	ВТ_Статьи.СтатьяБюджета,
				        |	ВТ_Статьи.ФинансовыйПоказатель,
				        |	фин_ПрогнозИсполненияБюджетов.Регистратор,
				        |	фин_ПрогнозИсполненияБюджетов.Регистратор КАК Регистратор1,
				        |	фин_ПрогнозИсполненияБюджетов.Период,
				        |	фин_ПрогнозИсполненияБюджетов.Организация,
				        |	ЗНАЧЕНИЕ(Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"СценарииПланирования.ПустаяСсылка) КАК Сценарий,
				        |	фин_ПрогнозИсполненияБюджетов.ПериодПланирования,
				        |	фин_ПрогнозИсполненияБюджетов.УправленческоеПодразделение,
				        |	фин_ПрогнозИсполненияБюджетов.Проект,
				        |	фин_ПрогнозИсполненияБюджетов.Номенклатура,
				        |	фин_ПрогнозИсполненияБюджетов.Контрагент,
				        |	фин_ПрогнозИсполненияБюджетов.Валюта,
				        |	фин_ПрогнозИсполненияБюджетов.Количество,
				        |	фин_ПрогнозИсполненияБюджетов.СуммаУпр,
				        |	фин_ПрогнозИсполненияБюджетов.ВалютнаяСумма,
				        |	фин_ПрогнозИсполненияБюджетов.СуммаСценария,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
				        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
				        |	NULL КАК ПриходРасход,
				        |	фин_ПрогнозИсполненияБюджетов.ВидДанных КАК ВидДанных,
				        |	фин_ПрогнозИсполненияБюджетов.НомерСтрокиИсточника,
				        |	фин_ПрогнозИсполненияБюджетов.ИмяИсточника КАК ИмяИсточника,
				        |	фин_ПрогнозИсполненияБюджетов.Схема,
				        |	фин_ПрогнозИсполненияБюджетов.Правило
				        |ИЗ
				        |	ВТ_Статьи КАК ВТ_Статьи
				        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.фин_ПрогнозИсполненияБюджетов КАК фин_ПрогнозИсполненияБюджетов
				        |		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ПрогнозИсполненияБюджетов.ФинансовыйПоказатель";

				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ТекстЗапроса = "ВЫБРАТЬ
	        |	фин_СтатьиБюджета.Владелец КАК Бюджет,
	        |	фин_СтатьиБюджета.Ссылка КАК СтатьяБюджета,
	        |	фин_СтатьиБюджета.ФинансовыйПоказатель
	        |ПОМЕСТИТЬ ВТ_Статьи
	        |ИЗ
	        |	Справочник.фин_СтатьиБюджета КАК фин_СтатьиБюджета
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Статьи.Бюджет,
	        |	ВТ_Статьи.СтатьяБюджета,
	        |	ВТ_Статьи.ФинансовыйПоказатель,
	        |	фин_ОборотыБюджетов.Регистратор,
	        |	фин_ОборотыБюджетов.ДокументПланирования,
	        |	фин_ОборотыБюджетов.Период,
	        |	фин_ОборотыБюджетов.Организация,
	        |	фин_ОборотыБюджетов.Сценарий,
	        |	фин_ОборотыБюджетов.ПериодПланирования,
	        |	фин_ОборотыБюджетов.УправленческоеПодразделение,
	        |	фин_ОборотыБюджетов.Проект,
	        |	фин_ОборотыБюджетов.Номенклатура,
	        |	фин_ОборотыБюджетов.Контрагент,
	        |	фин_ОборотыБюджетов.Валюта,
	        |	фин_ОборотыБюджетов.Количество,
	        |	фин_ОборотыБюджетов.СуммаУпр,
	        |	фин_ОборотыБюджетов.ВалютнаяСумма,
	        |	фин_ОборотыБюджетов.СуммаСценария,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
			|	NULL КАК ПриходРасход,
			|	фин_ОборотыБюджетов.ВидДанных  КАК ВидДанных,
			|	фин_ОборотыБюджетов.НомерСтрокиИсточника,
			|	фин_ОборотыБюджетов.ИмяИсточника КАК ИмяИсточника,
			|	фин_ОборотыБюджетов.Схема,
			|	фин_ОборотыБюджетов.Правило,
	        |	ЛОЖЬ КАК Прогноз
	        |ИЗ
	        |	ВТ_Статьи КАК ВТ_Статьи
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.фин_ОборотыБюджетов КАК фин_ОборотыБюджетов
	        |		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ОборотыБюджетов.ФинансовыйПоказатель
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_Статьи.Бюджет,
	        |	ВТ_Статьи.СтатьяБюджета,
	        |	ВТ_Статьи.ФинансовыйПоказатель,
	        |	фин_ПрогнозИсполненияБюджетов.Регистратор,
	        |	фин_ПрогнозИсполненияБюджетов.Регистратор,
	        |	фин_ПрогнозИсполненияБюджетов.Период,
	        |	фин_ПрогнозИсполненияБюджетов.Организация,
	        |	ЗНАЧЕНИЕ(Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"СценарииПланирования.ПустаяСсылка),
	        |	фин_ПрогнозИсполненияБюджетов.ПериодПланирования,
	        |	фин_ПрогнозИсполненияБюджетов.УправленческоеПодразделение,
	        |	фин_ПрогнозИсполненияБюджетов.Проект,
	        |	фин_ПрогнозИсполненияБюджетов.Номенклатура,
	        |	фин_ПрогнозИсполненияБюджетов.Контрагент,
	        |	фин_ПрогнозИсполненияБюджетов.Валюта,
	        |	фин_ПрогнозИсполненияБюджетов.Количество,
	        |	фин_ПрогнозИсполненияБюджетов.СуммаУпр,
	        |	фин_ПрогнозИсполненияБюджетов.ВалютнаяСумма,
	        |	фин_ПрогнозИсполненияБюджетов.СуммаСценария,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез1,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез2,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез3,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез4,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез5,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез6,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез7,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез8,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез9,
	        |	фин_ПрогнозИсполненияБюджетов.ДополнительныеРазрезы.Разрез10,
	        |	NULL,
			|	фин_ПрогнозИсполненияБюджетов.ВидДанных  КАК ВидДанных,
			|	фин_ПрогнозИсполненияБюджетов.НомерСтрокиИсточника,
			|	фин_ПрогнозИсполненияБюджетов.ИмяИсточника КАК ИмяИсточника,
			|	фин_ПрогнозИсполненияБюджетов.Схема,
			|	фин_ПрогнозИсполненияБюджетов.Правило,
	        |	ИСТИНА
	        |ИЗ
	        |	ВТ_Статьи КАК ВТ_Статьи
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.фин_ПрогнозИсполненияБюджетов КАК фин_ПрогнозИсполненияБюджетов
	        |		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ПрогнозИсполненияБюджетов.ФинансовыйПоказатель";
			Для Каждого ИмяРегистра Из МассивРегистров Цикл
				Если ИмяРегистра = "фин_ОборотыБюджетов" Тогда
					Продолжить;
				КонецЕсли;
			ТекстЗапроса = ТекстЗапроса+"
			|
			|ОБЪЕДИНИТЬ ВСЕ
	        |ВЫБРАТЬ
	        |	ВТ_Статьи.Бюджет,
	        |	ВТ_Статьи.СтатьяБюджета,
	        |	ВТ_Статьи.ФинансовыйПоказатель,
	        |	фин_ОборотыБюджетов.Регистратор,
	        |	фин_ОборотыБюджетов.ДокументПланирования,
	        |	фин_ОборотыБюджетов.Период,
	        |	фин_ОборотыБюджетов.Организация,
	        |	фин_ОборотыБюджетов.Сценарий,
	        |	фин_ОборотыБюджетов.ПериодПланирования,
	        |	фин_ОборотыБюджетов.УправленческоеПодразделение,
	        |	фин_ОборотыБюджетов.Проект,
	        |	фин_ОборотыБюджетов.Номенклатура,
	        |	фин_ОборотыБюджетов.Контрагент,
	        |	фин_ОборотыБюджетов.Валюта,
	        |	фин_ОборотыБюджетов.Количество,
	        |	фин_ОборотыБюджетов.СуммаУпр,
	        |	фин_ОборотыБюджетов.ВалютнаяСумма,
	        |	фин_ОборотыБюджетов.СуммаСценария,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез1 КАК Разрез1,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез2 КАК Разрез2,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез3 КАК Разрез3,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез4 КАК Разрез4,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез5 КАК Разрез5,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез6 КАК Разрез6,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез7 КАК Разрез7,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез8 КАК Разрез8,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез9 КАК Разрез9,
	        |	фин_ОборотыБюджетов.ДополнительныеРазрезы.Разрез10 КАК Разрез10,
			|	NULL КАК ПриходРасход,
			|	фин_ОборотыБюджетов.ВидДанных  КАК ВидДанных,
			|	фин_ОборотыБюджетов.НомерСтрокиИсточника,
			|	фин_ОборотыБюджетов.ИмяИсточника КАК ИмяИсточника,
			|	фин_ОборотыБюджетов.Схема,
			|	фин_ОборотыБюджетов.Правило,
	        |	ЛОЖЬ КАК Прогноз
	        |ИЗ
	        |	ВТ_Статьи КАК ВТ_Статьи
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления."+ИмяРегистра+" КАК фин_ОборотыБюджетов
	        |		ПО ВТ_Статьи.ФинансовыйПоказатель = фин_ОборотыБюджетов.ФинансовыйПоказатель";
	КонецЦикла;
	Возврат ТекстЗапроса;
КонецФункции
