Функция ПолучитьДолжностьИсполнителя(ПараметрКоманды)
	//+++ Oleg SmartT. 2021-02-11
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
		|			&НаДату,
		|			Сотрудник.Физлицо = &ПараметрФизЛицо
		|				И ПричинаИзмененияСостояния <> &ПричинаУвольнение) КАК РаботникиОрганизацийСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", ПараметрКоманды.Дата);
	Запрос.УстановитьПараметр("ПараметрФизЛицо", ПараметрКоманды.Автор.ФизЛицо);
	Запрос.УстановитьПараметр("ПричинаУвольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат СтрЗаменить(ВыборкаДетальныеЗаписи.Должность,"департамента","") + " департамента казначейства";
	КонецЦикла;
	//--- Oleg SmartT. 2021-02-11
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.АвтоМасштаб = Истина;

	ПечатьРесстр(ПараметрКоманды,ТабДок);
	КоличествоЭкземпляров = 1;
	НаПринтер = Ложь;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ПараметрКоманды,"Реестр платежей "));	
КонецПроцедуры

&НаСервере
Процедура ПечатьРесстр(ПараметрКоманды,ТабДок)
	ТабДок.Очистить();
	// Получаем валюты чтоб рассчитать курс
	KZT = Справочники.Валюты.НайтиПоКоду("398");
	USD = Справочники.Валюты.НайтиПоКоду("840");
	RUB = Справочники.Валюты.НайтиПоКоду("643");
	
	Макет     = БизнесПроцессы.СогласованиеРеестровБезКурирующего.ПолучитьМакет("Реестр");
	Шапка     = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строки");
	Подвал    = Макет.ПолучитьОбласть("Подвал");
	
	Шапка.Параметры.Дата = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.НомерРеестра = ПараметрКоманды.Номер;
	ТабДок.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СогласованиеРеестровБезКурирующегоПлатежи.Ссылка,
	|	СогласованиеРеестровБезКурирующегоПлатежи.НомерСтроки,
	|	СогласованиеРеестровБезКурирующегоПлатежи.Поручение,
	|	СогласованиеРеестровБезКурирующегоПлатежи.Контрагент,
	|	СогласованиеРеестровБезКурирующегоПлатежи.Договор,
	|	СогласованиеРеестровБезКурирующегоПлатежи.НазначениеПлатежа,
	|	СогласованиеРеестровБезКурирующегоПлатежи.СуммаПлатежа,
	|	СогласованиеРеестровБезКурирующегоПлатежи.РасчетныйСчет,
	|	СогласованиеРеестровБезКурирующегоПлатежи.Представительство,
	|	СогласованиеРеестровБезКурирующегоПлатежи.Валюта,
	|	СогласованиеРеестровБезКурирующегоПлатежи.Ссылка.Номер КАК НомерРеестра,
	|	СогласованиеРеестровБезКурирующегоПлатежи.КонтрагентПолучатель,
	|	СогласованиеРеестровБезКурирующего.ТипПлатежа,
	|	СогласованиеРеестровБезКурирующегоПлатежи.ЗаявкаНаФинансированиеПредставительств.Организация КАК Организация,
	|	СогласованиеРеестровБезКурирующего.ПроверкаДиректоромКДВыполнена
	|ИЗ
	|	БизнесПроцесс.СогласованиеРеестровБезКурирующего.Платежи КАК СогласованиеРеестровБезКурирующегоПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.СогласованиеРеестровБезКурирующего КАК СогласованиеРеестровБезКурирующего
	|		ПО СогласованиеРеестровБезКурирующегоПлатежи.Ссылка = СогласованиеРеестровБезКурирующего.Ссылка
	|ГДЕ
	|	СогласованиеРеестровБезКурирующегоПлатежи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    НомерСтроки = 0;
	СуммаТенге  = 0;
	СуммаДоллор = 0;
	СуммаРубль  = 0;
	//Рамиль +
	ПроверкаВыполнена = Ложь;
	//Рамиль -
	Пока Выборка.Следующий() Цикл 
		
		//Рамиль +
		ПроверкаВыполнена = Выборка.ПроверкаДиректоромКДВыполнена;
		//Рамиль -
		ОблСтрока.Параметры.Заполнить(Выборка);
		
		Если Выборка.ТипПлатежа = Перечисления.ТипыПлатежей.ФинансированиеПредставительств Тогда
			 ОблСтрока.Параметры.Контрагент = Выборка.Контрагент;
			 ОблСтрока.Параметры.КонтрагентПолучатель = Выборка.КонтрагентПолучатель;
		 КонецЕсли;
		 
		Если Выборка.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиЦА Тогда
			 ОблСтрока.Параметры.КонтрагентПолучатель = Выборка.Контрагент;
			 ОблСтрока.Параметры.Контрагент = "";
		 КонецЕсли;
		 
		Если Выборка.ТипПлатежа = Перечисления.ТипыПлатежей.ПлатежиОбластей Тогда
			 ОблСтрока.Параметры.Контрагент = Выборка.Организация;
			 ОблСтрока.Параметры.КонтрагентПолучатель = Выборка.Контрагент;
		 КонецЕсли; 
			 
		//Если НЕ ЗначениеЗаполнено(Выборка.Представительство) Тогда
		//	ОблСтрока.Параметры.Контрагент = "";
		//КонецЕсли;
		
		Если Выборка.Валюта = KZT Тогда 
			ОблСтрока.Параметры.СуммаТг = Выборка.СуммаПлатежа;
			СуммаТенге = СуммаТенге + Выборка.СуммаПлатежа;
			ОблСтрока.Параметры.СуммаД = "";
			ОблСтрока.Параметры.СуммаРб = "";
			
		ИначеЕсли Выборка.Валюта = USD Тогда
			ОблСтрока.Параметры.СуммаД = Выборка.СуммаПлатежа;
			СуммаДоллор = СуммаДоллор + Выборка.СуммаПлатежа;
			ОблСтрока.Параметры.СуммаРб = "";
			ОблСтрока.Параметры.СуммаТг = "";
		Иначе
			ОблСтрока.Параметры.СуммаРб = Выборка.СуммаПлатежа;
			СуммаРубль = СуммаРубль + Выборка.СуммаПлатежа;
			ОблСтрока.Параметры.СуммаД = "";
			ОблСтрока.Параметры.СуммаТг = "";
		КонецЕсли;
		
		ОблСтрока.Параметры.НомерПП = Выборка.Поручение.Номер;
		
		ТабДок.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	// выводим итоговые суммы 	
	Подвал.Параметры.ИтогоТг = СуммаТенге;
	Подвал.Параметры.ИтогоД  = СуммаДоллор;
	Подвал.Параметры.ИтогоРб = СуммаРубль;
	
	//+++ Oleg SmartT. 2021-05-04	
	пДДК         = ПроцедурыУправленияПерсоналом.ПользовательНаЭтапеМаршрута(Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемКД);
	ДДК          = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, пДДК.ФизЛицо, ПараметрКоманды.Дата).Представление;
	ДолжностьДДК = ПроцедурыУправленияПерсоналом.ДанныеДолжности(ПараметрКоманды.Организация, пДДК.ФизЛицо, ПараметрКоманды.Дата).Должность;
	
	//Рамиль +
	Если Не ПроверкаВыполнена = Ложь Тогда
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бит_АдресацияУведомленийПоКомандировкам.Адресат
		|ИЗ
		|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
		|ГДЕ
		|	Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута";
	
	Запрос.УстановитьПараметр("ЭтапМаршрута", Справочники.ЦС_ЭтапыМаршрутовБП.НайтиПоНаименованию("Согласование с руководителем ДК"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СотрудникВПодпись = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СотрудникВПодпись = ВыборкаДетальныеЗаписи.Адресат;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		Подвал.Параметры.ФИОФиндира       = СотрудникВПодпись; 
		Подвал.Параметры.ДолжностьФиндира = "Согласование реестра с Директором ДК";
	Иначе
		Подвал.Параметры.ФИОФиндира       = ДДК; 
		Подвал.Параметры.ДолжностьФиндира = ДолжностьДДК;
	КонецЕсли;
	//Рамиль -
	
	Подвал.Параметры.Исполнитель = ПараметрКоманды.Автор;
	Подвал.Параметры.ДолжностьИсполнителя = ПолучитьДолжностьИсполнителя(ПараметрКоманды);  
	Подвал.Параметры.Телефон = ПараметрКоманды.Телефон;
	
	Если ПараметрКоманды.Подписи.Количество() > 0 Тогда
		Для Каждого Строка Из ПараметрКоманды.Подписи Цикл
			Если Строка.Этап = БизнесПроцессы.СогласованиеРеестровБезКурирующего.ТочкиМаршрута.СогласованиеСДиректоромКД Тогда
				Подвал.Параметры.ДатаДиректор  = Формат(ПараметрКоманды.Подписи[ПараметрКоманды.Подписи.Индекс(Строка)].Дата,"ДФ=dd.MM.yyyy");
				Подвал.Параметры.ВремяДиректор = Формат(ПараметрКоманды.Подписи[ПараметрКоманды.Подписи.Индекс(Строка)].Дата,"ДЛФ=T") + Символы.ПС + "согласовано"; 
			КонецЕсли;
		КонецЦикла;
		Подвал.Параметры.ДатаИсполнитель  = Формат(ПараметрКоманды.Подписи[0].Дата,"ДФ=dd.MM.yyyy");
		Подвал.Параметры.ВремяИсполнитель = Формат(ПараметрКоманды.Подписи[0].Дата,"ДЛФ=T"); 
	КонецЕсли;
	//--- Oleg SmartT. 2021-05-04	
	
	ТабДок.Вывести(Подвал);
КонецПроцедуры	
