
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		Запись.Использовать = истина;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.ЗначениеОт.Видимость = Ложь;
	Элементы.ЗначениеДо.Видимость = Ложь;
	Элементы.ЗначениеОт.КнопкаВыбора = Истина;
	Элементы.ЗначениеДо.КнопкаВыбора = Истина;
	Если Запись.Шкала.ТипЗначенияШкалы = Перечисления.узп_ТипыЗначенийШкалОценкиПоставщиков.Число Тогда
		Элементы.ЗначениеОт.Заголовок = "От";
		Элементы.ЗначениеДо.Заголовок = "до";
		Элементы.ЗначениеОт.КнопкаВыбора = Ложь;
		Элементы.ЗначениеДо.КнопкаВыбора = Ложь;
		Элементы.ЗначениеОт.Видимость = Истина;
		Элементы.ЗначениеДо.Видимость = Истина;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Число"));
	    Элементы.ЗначениеДо.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	    Запись.ЗначениеДо = Элементы.ЗначениеДо.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеДо);
		Элементы.ЗначениеОт.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	    Запись.ЗначениеОт = Элементы.ЗначениеОт.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеОт);
	КонецЕсли;
	Если Запись.Шкала.ТипЗначенияШкалы = Перечисления.узп_ТипыЗначенийШкалОценкиПоставщиков.Дата Тогда
		Элементы.ЗначениеОт.Заголовок = "От";
		Элементы.ЗначениеДо.Заголовок = "до";
		Элементы.ЗначениеОт.КнопкаВыбора = Ложь;
		Элементы.ЗначениеДо.КнопкаВыбора = Ложь;
		Элементы.ЗначениеОт.Видимость = Истина;
		Элементы.ЗначениеДо.Видимость = Истина;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Дата"));
	    Элементы.ЗначениеДо.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	    Запись.ЗначениеДо = Элементы.ЗначениеДо.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеДо);
		Элементы.ЗначениеОт.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	    Запись.ЗначениеОт = Элементы.ЗначениеОт.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеОт);
	КонецЕсли;
	Если Запись.Шкала.ТипЗначенияШкалы = Перечисления.узп_ТипыЗначенийШкалОценкиПоставщиков.Булево Тогда
		Элементы.ЗначениеОт.Заголовок = "Значение";
		Элементы.ЗначениеОт.Видимость = Истина;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Булево"));
		Элементы.ЗначениеОт.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	    Запись.ЗначениеОт = Элементы.ЗначениеОт.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеОт);
		
	КонецЕсли;
	Если Запись.Шкала.ТипЗначенияШкалы = Перечисления.узп_ТипыЗначенийШкалОценкиПоставщиков.ЗначенияКритериевОценки Тогда
		Элементы.ЗначениеОт.Заголовок = "Значение";
		Элементы.ЗначениеОт.Видимость = Истина;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.узп_ЗначенияКритериевОценки"));
		Элементы.ЗначениеОт.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	    Запись.ЗначениеОт = Элементы.ЗначениеОт.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеОт);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеОтПриИзменении(Элемент)
	ПроверитьКорректностьЦифр();
КонецПроцедуры

&НаСервере
Функция ПроверитьКорректностьЦифр()
	Если Запись.Шкала.ТипЗначенияШкалы = ПредопределенноеЗначение("Перечисление.узп_ТипыЗначенийШкалОценкиПоставщиков.Число") Тогда
		Если Запись.ЗначениеОт > Запись.ЗначениеДо Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "!";
			Сообщение.Сообщить();
			Возврат Ложь
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ШкалаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

