
Процедура ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти) Экспорт

	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли; 

КонецПроцедуры 

Процедура РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ЗначениеПустогоКоличества = 0) Экспорт
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * ?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество);
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСуммуВсегоТабЧасти(Строка, СуммаВключаетНДС, СуммаВключаетАкциз = Ложь) Экспорт
	
	Если Строка.Свойство("Всего") Тогда
		Строка.Всего = Строка.Сумма + ?(СуммаВключаетНДС, 0, Строка.СуммаНДС) + ?(Строка.Свойство("СуммаАкциза"), ?(СуммаВключаетАкциз, 0, Строка.СуммаАкциза), 0);
	КонецЕсли;	
	
КонецПроцедуры

Процедура РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ПараметрыОбъекта, ИмяРеквизитаСуммаНДС = "СуммаНДС", РассчитыватьСуммуЗачета = Ложь) Экспорт

	// Если в документе нет флагов учета НДС, то используем значения по умолчанию
	УчитыватьНДС = Истина;
	СуммаВключаетНДС = Ложь;
	ЕстьОборотПоРеализации = СтрокаТабличнойЧасти.Свойство("ОборотПоРеализации");
	ЕстьВалюта = ПараметрыОбъекта.Свойство("ВалютаДокумента");
	                  //фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета")
	ВалютаРеглУчета = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	// если процедура вызвана из ОбработкаЗаполненияТабличныхЧастейТовары, то проверим наличие параметра "ЗначениеОборотПоРеализации"
	Если ПараметрыОбъекта.Свойство("ЗначениеОборотПоРеализации") Тогда
		ЕстьОборотПоРеализации = ПараметрыОбъекта.ЗначениеОборотПоРеализации;
	Иначе
		Если ЕстьВалюта И ВалютаРеглУчета <> ПараметрыОбъекта.ВалютаДокумента И ПараметрыОбъекта.Дата < Дата(2014, 07, 01) Тогда
			// В валютных счетах-фактурах до 01.07.2014 расчет НДС выполняется от суммы, так как оборот по реализации указывается в тенге.
			// В валютных счетах-фактурах начиная с 01.07.2014 расчет НДС выполняется от оборота по реализации, так как оборот по реализации указывается в валюте.			
			ЕстьОборотПоРеализации = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	
	Если ПараметрыОбъекта.Свойство("УчитыватьНДС") Тогда
		УчитыватьНДС = ПараметрыОбъекта.УчитыватьНДС;
	КонецЕсли;

	Если ПараметрыОбъекта.Свойство("СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = ПараметрыОбъекта.СуммаВключаетНДС;
	КонецЕсли;
	

	Если СтрокаТабличнойЧасти.Свойство("СтавкаНДС") Тогда
		Если ЕстьОборотПоРеализации Тогда 
			СтрокаТабличнойЧасти[ИмяРеквизитаСуммаНДС] = РассчитатьСуммуНДС(СтрокаТабличнойЧасти.ОборотПоРеализации,
														   УчитыватьНДС, 
														   Ложь,
														   дог_УправлениеДоговорамиСерверПовтИсп.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС),
														   ?(СтрокаТабличнойЧасти.Свойство("СуммаАкциза"), СтрокаТабличнойЧасти.СуммаАкциза, 0),
														   Истина);	
														   
		ИначеЕсли СтрокаТабличнойЧасти.Свойство("Сумма") Тогда
		
			СтрокаТабличнойЧасти[ИмяРеквизитаСуммаНДС] = РассчитатьСуммуНДС(СтрокаТабличнойЧасти.Сумма,
														   УчитыватьНДС, 
														   СуммаВключаетНДС,
														   дог_УправлениеДоговорамиСерверПовтИсп.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС),
														   ?(СтрокаТабличнойЧасти.Свойство("СуммаАкциза"), СтрокаТабличнойЧасти.СуммаАкциза, 0),
														   ?(ПараметрыОбъекта.Свойство("СуммаВключаетАкциз"), ПараметрыОбъекта.СуммаВключаетАкциз, Ложь));
														   
		КонецЕсли;													   
	КонецЕсли;

	// если в документе есть реквизиты УплаченныйНДС и СуммаНДС, то сумма НДС к зачету определяется
	// исходя из признака включения НДС в стоимость
	Если РассчитыватьСуммуЗачета Тогда
		
		НДСВключенВСтоимость = ?(ПараметрыОбъекта.Свойство("НДСВключенВСтоимость"), ПараметрыОбъекта.НДСВключенВСтоимость, Ложь);	
		
		Если НДСВключенВСтоимость Тогда
			СтрокаТабличнойЧасти.СуммаНДС = 0;
		Иначе
			СтрокаТабличнойЧасти.СуммаНДС = СтрокаТабличнойЧасти[ИмяРеквизитаСуммаНДС];
		КонецЕсли
		
	КонецЕсли;   	

КонецПроцедуры // РассчитатьСуммуНДСТабЧасти()


// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            - число, сумма от которой надо рассчитывать налоги, 
//  УчитыватьНДС     - булево, признак учета НДС в сумме, 
//  СуммаВключаетНДС - булево, признак включения НДС в сумму ("внутри" или "сверху"),
//  СтавкаНДС        - число , процентная ставка НДС,
//
// Возвращаемое значение:
//  Число, полученная сумма НДС
//
Функция РассчитатьСуммуНДС(Сумма, УчитыватьНДС, СуммаВключаетНДС, СтавкаНДС, СуммаАкциза = 0, СуммаВключаетАкциз = Ложь) Экспорт
	//к расчетной базе прибавляем сумму Акциза, исходим из того, что ситуация когда сумма включает НДС и не включает Акциз исключена 
	Если НЕ СуммаВключаетАкциз Тогда
		СуммаДляРасчетаНДС = Сумма + СуммаАкциза;
	Иначе
		СуммаДляРасчетаНДС = Сумма;  
	КонецЕсли;
	
	Если (УчитыватьНДС) И (СуммаВключаетНДС) Тогда
		СуммаБезНДС = 100 * СуммаДляРасчетаНДС / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = СуммаДляРасчетаНДС;
	КонецЕсли;

	Если УчитыватьНДС Тогда 
		Если НЕ СуммаВключаетНДС Тогда
			СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
		КонецЕсли;
	Иначе
		СуммаНДС = 0;
	КонецЕсли;

	Возврат СуммаНДС;

КонецФункции // РассчитатьСуммуНДС()
