
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НадписьСоответствиеПлановойНоменклатуре = "Соответствие плановой номенклатуре";
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбора = Элементы.ПлановаяНоменклатура.ПараметрыВыбора;
	НовыйМассив = Новый Массив();
	НоваяСвязь = Новый ПараметрВыбора("Отбор.ТипПозицииВПланеЗакупок", ПолучитьТипПозиции());
	НовыйМассив.Добавить(НоваяСвязь);
	Элементы.ПлановаяНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
КонецПроцедуры

&НаСервере
Функция ПолучитьТипПозиции()
	Возврат ?(Запись.РегламентированнаяНоменклатура.Услуга,Перечисления.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Услуга,Перечисления.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Товар);
КонецФункции

&НаКлиенте
Процедура РегламентированнаяНоменклатураПриИзменении(Элемент)
	Если ПолучитьТипПозиции()<>ТипПлановойПозиции() Тогда
		Запись.ПлановаяНоменклатура = ПредопределенноеЗначение("Справочник.фин_ПлановаяНоменклатура.ПустаяСсылка");
		Запись.ХарактеристикаПлановойНоменклатуры=ПредопределенноеЗначение("Справочник.узп_ПлановыеХарактеристикиНоменклатуры.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТипПлановойПозиции()
	Возврат Запись.ПлановаяНоменклатура.ТипПозицииВПланеЗакупок;	
КонецФункции
