
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтбор(Этаформа);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтбор(Форма) 
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("усд_УправлениеСогласованиемИУтверждениемДокументов") Тогда
		Отбор = Ложь;
	Иначе
		Отбор = Истина;
	КонецЕсли;
	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Форма.Список, "Автор", ПараметрыСеанса.ТекущийПользователь, Отбор );	
	
	ТекущийИсполнитель = ПараметрыСеанса.ТекущийПользователь;
	
	Если Не ТекущийИсполнитель.ПодачаЗаявокЗаДругиеПодразделения = Истина Тогда
		
		Если Отбор = Истина Тогда
			Сотрудник = Справочники.СотрудникиОрганизаций.НайтиПоРеквизиту("Физлицо", ТекущийИсполнитель.ФизЛицо); 
			Подразделение = Сотрудник.ТекущееПодразделениеОрганизации; 
			
					
			ГруппаОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ;
		 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Автор");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущийИсполнитель;
		 
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Подразделение;
	   КонецЕсли;

	Иначе
		
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Форма.Список, "Автор", ТекущийИсполнитель, Отбор );
		
	КонецЕсли;

КонецПроцедуры
