
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначениеОтбора") Тогда
         Список.Отбор.Элементы.Очистить();
         Поле = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
         Поле.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ФизЛицо");
		 Поле.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		 Поле.ПравоеЗначение = Параметры.ЗначениеОтбора;

		//Список.Параметры.УстановитьЗначениеПараметра("ФизЛицоСсылка", Параметры.ЗначениеОтбора);
	Иначе
		//Список.Параметры.УстановитьЗначениеПараметра("ФизЛицоСсылка", Справочники.ФизическиеЛица.ПустаяСсылка());
	КонецЕсли;
КонецПроцедуры
