
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Справочник Из Метаданные.Справочники Цикл
		СписокСправочников.Добавить(Справочник.Имя,Справочник.Синоним);	
	КонецЦикла;
	СписокВыбора =  фин_РаботаСДополнительнымиРазрезамиБюджетирования.ПолучитьПолныйСписокРазрезов();
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		СписокРазрезов.Добавить(ЭлементСписка.Значение,ЭлементСписка.Представление);	
	КонецЦикла;
    СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Валюта,Перечисления.фин_ФактическиеПоказателиБюджетирования.Валюта);
	СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Организация,Перечисления.фин_ФактическиеПоказателиБюджетирования.Организация);
	СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.ФинансовыйПоказатель,Перечисления.фин_ФактическиеПоказателиБюджетирования.ФинансовыйПоказатель);
	Если ЗначениеЗаполнено(Запись.Разрез) Тогда
		РазрезПредставление = СписокРазрезов.НайтиПоЗначению(Запись.Разрез).Представление;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СинонимНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокСправочников;
КонецПроцедуры

&НаКлиенте
Процедура СинонимОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запись.ИмяСправочника = ВыбранноеЗначение;
	Запись.Синоним = СписокСправочников.НайтиПоЗначению(ВыбранноеЗначение).Представление;
КонецПроцедуры

&НаКлиенте
Процедура РазрезНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокРазрезов;
КонецПроцедуры

&НаКлиенте
Процедура РазрезОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Запись.Разрез = ВыбранноеЗначение;
	РазрезПредставление = СписокРазрезов.НайтиПоЗначению(ВыбранноеЗначение).Представление;
КонецПроцедуры
