
// Процедура - обработчик нажатия кнопки "ОбновлениеБИКов"
// подменю "Действия"
//
&НаКлиенте
Процедура ДействияФормыОбновлениеБИКов(Кнопка)
	Сообщить("Обработка справочника ""Банки"". Заполнение реквизитов ""БИК"" .");

	ДействияФормыОбновлениеБИКовНаСервере();
	
	Сообщить("Обработка справочника ""Банки"". Заполнение реквизитов ""БИК"" закончена.");

КонецПроцедуры

&НаСервере
Процедура ДействияФормыОбновлениеБИКовНаСервере()
	ТзБанков = ЗагрузитьКлассификаторБанков();
	// обработка справочника "Банки"
	ТзБанков = ЗагрузитьКлассификаторБанков();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Банки.Ссылка,
	               |	Банки.Код,
	               |	Банки.КодВПлатежнойСистеме,
	               |	Банки.БИК,
	               |	Банки.БИКДоРеформыБанковскихСчетов,
	               |	Банки.КодВПлатежнойСистемеДоРеформыБанковскихСчетов,
	               |	Банки.Представление
	               |ИЗ
	               |	Справочник.Банки КАК Банки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.БИК) тогда
			Продолжить;
		КонецЕсли;
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если СпрОбъект.ЭтоГруппа Тогда 
			Продолжить;
		КонецЕсли;
		// попытка поиска по старому БИК
		Стр = ТзБанков.Найти(СокрЛП(Выборка.БИКДоРеформыБанковскихСчетов), "СтарыйБИК"); 
		Если Стр = Неопределено Тогда
			Попытка
				СпрОбъект.ОбменДанными.Загрузка = Истина;
				СпрОбъект.Записать();
			Исключение
				Сообщить(" при записи элемента " + Выборка.Представление + " произошла ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
			Продолжить;
		КонецЕсли;		
		СпрОбъект.БИК = Стр.БИК;
		СпрОбъект.КодВПлатежнойСистеме = УправлениеДенежнымиСредствами.ПолучитьКодБанкаВПлатежнойСистеме(Стр.БИК);
		Попытка
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
		Исключение
			Сообщить(" при записи элемента " + Выборка.Представление + " произошла ошибка: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;
	КонецЦикла;
	
	
	
КонецПроцедуры

// процедура заполнения таблицы значений
// для обработки новых банковских кодов
&НаСервере
Функция ЗагрузитьКлассификаторБанков()
	Макет 	= Справочники.Банки.ПолучитьМакет("ОбщаяТаблицаСоответствияБанковскихРеквизитов");
	Область = Макет.Области["КлассификаторБанков"];
	ТзБанков = Новый ТаблицаЗначений;
	ТзБанков.Колонки.Добавить("БИК");
	ТзБанков.Колонки.Добавить("СтарыйБИК");
	ТзБанков.Колонки.Добавить("Наименование");
	Для Ном = Область.Верх По Область.Низ Цикл
		НоваяСтрока = ТзБанков.Добавить();
		НоваяСтрока.БИК = СокрЛП(Макет.Область(Ном, 1).Текст);
		НоваяСтрока.СтарыйБИК = СокрЛП(Макет.Область(Ном, 2).Текст);
		НоваяСтрока.Наименование = СокрЛП(Макет.Область(Ном, 3).Текст);
	КонецЦикла;
	Возврат ТзБанков;
КонецФункции

