Функция ИмеетсяТочкаПланирования(ПериодПланирования,Сценарий) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТочкиПланирования.НомерСтроки
		|ИЗ
		|	Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"СценарииПланирования.ТочкиПланирования КАК ТочкиПланирования
		|ГДЕ
		|	ТочкиПланирования.Ссылка = &Сценарий
		|	И ТочкиПланирования.ПериодПланирования = &ПериодПланирования";
	
	Запрос.УстановитьПараметр("ПериодПланирования", ПериодПланирования);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция МассивТочекПланированияСценария(Сценарий,Сортировка="ВОЗР") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТочкиПланирования.ПериодПланирования КАК ПериодПланирования
		|ИЗ
		|	Справочник."+фин_ОбщегоНазначенияВызовСервераПовтИсп.ПрефиксОбщихОбъектов()+"СценарииПланирования.ТочкиПланирования КАК ТочкиПланирования
		|ГДЕ
		|	ТочкиПланирования.Ссылка = &Сценарий
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодПланирования "+Сортировка;
	
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПериодПланирования");
	
КонецФункции