
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеФормой(ЭтотОбъект);
	
	ОбновитьОтборыДинамическихСписков(ЭтотОбъект);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Управление формой

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ОбновитьОтборыДинамическихСписков(ЭтотОбъект); // если есть связанные динамические списки
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	// установка видимости и доступности элементов в зависимости от значений реквизитов
	Форма.Элементы.СтрокиФинансовогоРасчета.Доступность = ЗначениеЗаполнено(Форма.Объект.Ссылка);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборыДинамическихСписков(Форма)
	
	// настройка отбора динамических списков связанных элементов
	
	фин_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СтрокиФинансовогоРасчета, 
		"Владелец", 
		Форма.Объект.Ссылка, 
		ВидСравненияКомпоновкиДанных.Равно,
		НСтр("ru = 'Отбор по владельцу'"),
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
КонецПроцедуры

