
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Отбор",Новый Структура("ФормируемыйСценарий",ПараметрКоманды) );
	ОткрытьФорму("РегистрСведений.фин_ПравилаСценарногоПланированияСтатейБюджетов.Форма.ФормаНастройки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ?(фин_ОбщегоНазначенияКлиентПовтИсп.РежимОтдельногоОткрытияОкон(),ВариантОткрытияОкна.ОтдельноеОкно,ПараметрыВыполненияКоманды.Окно), ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
