
&НаКлиенте
Процедура АктуализацияДефицитаПриИзменении(Элемент)
	Если НЕ Запись.АктуализацияДефицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью") Тогда
		Запись.СтатьяДляПереносаДефицита=ПредопределенноеЗначение("Справочник.фин_СтатьиБюджета.ПустаяСсылка");
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура АктуализацияПрофицитаПриИзменении(Элемент)
	Если НЕ Запись.АктуализацияПрофицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью") Тогда
		Запись.СтатьяДляПереносаПрофицита=ПредопределенноеЗначение("Справочник.фин_СтатьиБюджета.ПустаяСсылка");
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	Форма.Элементы.СтатьяДляПереносаДефицита.Видимость = Форма.Запись.АктуализацияДефицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью");
	Форма.Элементы.СтатьяДляПереносаПрофицита.Видимость = Форма.Запись.АктуализацияПрофицита=ПредопределенноеЗначение("Перечисление.фин_ПорядокАктуализацииСтатейБюджетов.ПеренестиНаДругуюСтатью");
КонецПроцедуры
