
Процедура ПриВыполнении(Отказ)
	
		Если ТочкаМаршрута = БизнесПроцессы.СогласованиеПлатежей.ТочкиМаршрута.РаботаСЗаявкойАвтором 
		ИЛИ ТочкаМаршрута = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда
		БПОбъект = БизнесПроцесс.ПолучитьОбъект();
		
		Если ТипЗнч(БПОбъект.Ссылка) = ТипЗнч(БизнесПроцессы.СогласованиеПлатежей.ПустаяСсылка()) Тогда
			БПОбъект.ЗаявкаПрошлаСогласованиеРук = "";
			БПОбъект.ЗаявкаПрошлаСогласованиеКурирующимЧП = "";
		Иначе
			БПОбъект.ПодписанПредседателем = "";
			БПОбъект.ПроверкаДиректоромФДВыполнена = "";
		КонецЕсли;
	
		БПОбъект.Записать();
		
		ИначеЕсли ТочкаМаршрута = БизнесПроцессы.СогласованиеПлатежейПредставительств.ТочкиМаршрута.РаботаСЗаявкойАвтором 
		ИЛИ ТочкаМаршрута = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда
		БПОбъект = БизнесПроцесс.ПолучитьОбъект();
		
		Если ТипЗнч(БПОбъект.Ссылка) = ТипЗнч(БизнесПроцессы.СогласованиеПлатежейПредставительств.ПустаяСсылка()) Тогда
			БПОбъект.ЗаявкаПрошлаСогласованиеРук = "";
			БПОбъект.ЗаявкаПрошлаСогласованиеКурирующимЧП = "";
		Иначе
			БПОбъект.ПодписанПредседателем = "";
			БПОбъект.ПроверкаДиректоромФДВыполнена = "";
		КонецЕсли;
	
		БПОбъект.Записать();		
		
		ИначеЕсли ТочкаМаршрута = БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ТочкиМаршрута.РаботаСЗаявкойАвтором 
		ИЛИ ТочкаМаршрута = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда
		БПОбъект = БизнесПроцесс.ПолучитьОбъект();
		
		Если ТипЗнч(БПОбъект.Ссылка) = ТипЗнч(БизнесПроцессы.СогласованиеПлатежейПоЗакупу.ПустаяСсылка()) ИЛИ
			ТипЗнч(БПОбъект.Ссылка) = ТипЗнч(БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупу.ПустаяСсылка()) ИЛИ
			ТипЗнч(БПОбъект.Ссылка) = ТипЗнч(БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ПустаяСсылка())	Тогда
			БПОбъект.ЗаявкаПрошлаСогласованиеРук = "";
			БПОбъект.ЗаявкаПрошлаСогласованиеКурирующимЧП = "";
		Иначе
			БПОбъект.ПодписанПредседателем = "";
			БПОбъект.ПроверкаДиректоромФДВыполнена = "";
		КонецЕсли;
	
		БПОбъект.Записать();
		КонецЕсли;
	
		Если ТочкаМаршрута = БизнесПроцессы.СогласованиеРеестровБезКурирующего.ТочкиМаршрута.РаботаСЗаявкойАвтором 
		ИЛИ ТочкаМаршрута = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда
		БПОбъект = БизнесПроцесс.ПолучитьОбъект();
		
		Если ТипЗнч(БПОбъект.Ссылка) = ТипЗнч(БизнесПроцессы.СогласованиеРеестровБезКурирующего.ПустаяСсылка()) Тогда
			//БПОбъект.ЗаявкаПрошлаСогласованиеРук = "";
			//БПОбъект.ЗаявкаПрошлаСогласованиеКурирующимЧП = "";
		Иначе
			БПОбъект.ПодписанПредседателем = "";
			БПОбъект.ПроверкаДиректоромФДВыполнена = "";
		КонецЕсли;
		БПОбъект.Записать();
		КонецЕсли;
	
КонецПроцедуры
