
&НаКлиенте
Процедура Анализ(Команда)
	АнализНаСервере();
КонецПроцедуры

&НаСервере
Процедура АнализНаСервере()
	ТЗСтруктураИБ = ПолучитьСтруктуруХраненияБазыДанных( , Ложь);
	ТребуютРеструктуризации.Очистить();
	
	Для Каждого ЭлементСтруктурыХранения Из ТЗСтруктураИБ Цикл
		ИмяОбъектаМетаданных = ЭлементСтруктурыХранения.Метаданные;
		Если ПустаяСтрока(ИмяОбъектаМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		Если Не ТребуютРеструктуризации.НайтиПоЗначению(ИмяОбъектаМетаданных) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Поля = ЭлементСтруктурыХранения.Поля;
		СТЗ = Поля.Найти("DimHash", "ИмяПоляХранения");
		Если СТЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТребуютРеструктуризации.Добавить(ИмяОбъектаМетаданных);
	КонецЦикла;
	
	Если ТребуютРеструктуризации.Количество() = 0 Тогда
		Стр = "Действий над таблицами ИБ не требуется";
		ТребуютРеструктуризации.Добавить(Стр);
	КонецЕсли;
КонецПроцедуры
