
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок.АвтоМасштаб = Истина;

	ПечатьРесстр(ПараметрКоманды,ТабДок);
	КоличествоЭкземпляров = 1;
	НаПринтер = Ложь;
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ПараметрКоманды,"Реестр платежей "));	
КонецПроцедуры

&НаСервере
Процедура ПечатьРесстр(ПараметрКоманды,ТабДок)
	ТабДок.Очистить();
		
	Макет     = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ПолучитьМакет("Доплата");
	Шапка     = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строки");
	
	ИтогиТаблицы = Макет.ПолучитьОбласть("ИтогиТаблицы");
	
	ПодписьДиректораДК    = Макет.ПолучитьОбласть("ПодписьДиректораДК");
	ПодписьДиректораДЗСХП = Макет.ПолучитьОбласть("ПодписьДиректораДЗСХП");
	ПодписьДиректораФД    = Макет.ПолучитьОбласть("ПодписьДиректораФД");
	ПодписьГБ             = Макет.ПолучитьОбласть("ПодписьГБ");
	ПодписьМенДЗСХП       = Макет.ПолучитьОбласть("ПодписьМенДЗСХП");
	
	Подвал    = Макет.ПолучитьОбласть("Подвал");
	
	ПодписьДиректораДК.Параметры.ДолжностьДиректораДК       = "Курирующий руководитель";
	ПодписьДиректораДЗСХП.Параметры.ДолжностьДиректораДЗСХП = "Директор инициирующего структурного подразделения";
	ПодписьДиректораФД.Параметры.ДолжностьДиректораФД       = "Директор финансового департамента";
	ПодписьГБ.Параметры.ДолжностьГБ                         = "Главный бухгалтер";
	
	Шапка.Параметры.ДатаРеестра = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	Шапка.Параметры.НомерРеестра = ПараметрКоманды.Номер;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерСтроки КАК НомерСтроки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Контрагент,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Культура,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Объем,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Цена,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДоговора,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Собственные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Заемные,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.БюджетКредит,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Элеватор,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.НомерЗерновой,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Примечание,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаЗерновой,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Гарантия,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ППИ,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РеспБюджет,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаПредварительнойОплаты,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДополнительнойОплаты,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаПогашенияСельхозПродукцией,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаДоплаты,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СуммаШтрафа,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ФактическиЗачтенныйВес,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ПрогнознаяЦена,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ЗакупочнаяЦена,
	 |	ВЫБОР
	 |		КОГДА СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Собственные > 0
	 |			ТОГДА ""За счет собственных средств Корпорации""
	 |		ИНАЧЕ ВЫБОР
	 |				КОГДА СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Заемные > 0
	 |					ТОГДА ""За счет средств Нац. фонда""
	 |				ИНАЧЕ ВЫБОР
	 |						КОГДА СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.БюджетКредит > 0
	 |							ТОГДА ""За счет средств бюджетного кредита""
	 |						ИНАЧЕ ВЫБОР
	 |								КОГДА СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РеспБюджет > 0
	 |									ТОГДА ""За счет Республиканского бюджета""
	 |								ИНАЧЕ """"
	 |							КОНЕЦ
	 |					КОНЕЦ
	 |			КОНЕЦ
	 |	КОНЕЦ КАК втчШапка,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.СФ,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.ДатаВыписки,
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.РегНомер
	 |ИЗ
	 |	БизнесПроцесс.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.РасчетнаяТаблица КАК СогласованиеПлатежейПоЗакупуРасчетнаяТаблица
	 |ГДЕ
	 |	СогласованиеПлатежейПоЗакупуРасчетнаяТаблица.Ссылка = &Ссылка
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
    НомерСтроки = 0;
	ОбщийОбъем  = 0;
	ОбщаяСумма  = 0;
    втчИтого    = 0;
	СуммаДоплатыИтого = 0;
	СуммаСельхозпродукцииИтого = 0;
	ФактическийВесИтого = 0;
	втчШапка    = 0;
	
	//вывести шапка
	Пока Выборка.Следующий() Цикл 
		Шапка.Параметры.втчШапка = Выборка.втчШапка
	КонецЦикла;
	
	ТабДок.Вывести(Шапка);
	
	
	//вывести строки
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл 
		
		ОблСтрока.Параметры.Заполнить(Выборка);
		
		ОблСтрока.Параметры.ДатаДоговора = Выборка.ДатаДоговора;
		//ОблСтрока.Параметры.ДатаЗерновой = Формат(Выборка.ДатаЗерновой,"ДФ=dd.MM.yyyy");
		
		ОблСтрока.Параметры.СуммаПредОплаты = Выборка.СуммаПредварительнойОплаты;	
		ОблСтрока.Параметры.СуммаДопОплаты = Выборка.СуммаДополнительнойОплаты;	
		ОблСтрока.Параметры.ФактическийВес = Выборка.ФактическиЗачтенныйВес;
	    ОблСтрока.Параметры.СуммаСельхозпродукции = Выборка.СуммаПогашенияСельхозПродукцией;
		
		//За счет собственных средств Корпорации	
		//За счет средств Нац. фонда	
		//За счет Республиканского бюджета	
		//За счет средств бюджетного кредита
		
		//Собственные	
		//Заемные	
		//РеспБюджет	
		//БюджетКредит
		
		//ИтогоСоб	
		//ИтогоЗаем	
		//ИтогоРеспБюджет	
		//ИтогоБюджетКредит
		//
		ОблСтрока.Параметры.втчСумма = 0;
		Если Выборка.Собственные > 0 тогда
			ОблСтрока.Параметры.втчСумма = Выборка.Собственные;
			втчИтого = втчИтого + Выборка.Собственные;
		ИначеЕсли Выборка.Заемные > 0 тогда
			ОблСтрока.Параметры.втчСумма = Выборка.Заемные;
			втчИтого = втчИтого + Выборка.Заемные;	
		ИначеЕсли Выборка.БюджетКредит > 0 тогда
			ОблСтрока.Параметры.втчСумма = Выборка.БюджетКредит;
			втчИтого = втчИтого + Выборка.БюджетКредит;	
		ИначеЕсли Выборка.РеспБюджет > 0 тогда
			ОблСтрока.Параметры.втчСумма = Выборка.РеспБюджет;
			втчИтого = втчИтого + Выборка.РеспБюджет;	
		КонецЕсли;
		
		СуммаДоплатыИтого =  СуммаДоплатыИтого + Выборка.СуммаДоплаты;
		СуммаСельхозпродукцииИтого =  СуммаСельхозпродукцииИтого + Выборка.СуммаПогашенияСельхозПродукцией;
		ФактическийВесИтого =  ФактическийВесИтого + Выборка.ФактическиЗачтенныйВес;
		
		ОблСтрока.Параметры.Примечание = Выборка.Примечание;
		ТабДок.Вывести(ОблСтрока);
		
	КонецЦикла;
	
	// выводим итоговые суммы 	
	ИтогиТаблицы.Параметры.втчИтого = втчИтого;
	ИтогиТаблицы.Параметры.СуммаДоплатыИтого = СуммаДоплатыИтого;
	ИтогиТаблицы.Параметры.СуммаСельхозпродукцииИтого = СуммаСельхозпродукцииИтого;
	ИтогиТаблицы.Параметры.ФактическийВесИтого = ФактическийВесИтого;
	
	//ТабДок.Вывести(ИтогиТаблицы);
	
	// Получаем руководитель 
	//+++ Oleg SmartT. 2021-04-08	
	Для Каждого Стр из ПараметрКоманды.Подписи Цикл
		
		СФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
		ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, Стр.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;	
			
		Если Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСКурирующимЧП Тогда
			ПодписьДиректораДК.Параметры.ФИОДиректораДК       = СФио;
			ПодписьДиректораДК.Параметры.ДолжностьДиректораДК = ДолжностьДляПечФормы;
			ПодписьДиректораДК.Параметры.ВремяПодписания1     = Стр.Дата;
			ПодписьДиректораДК.Параметры.Согласовано1         = "Утверждено";
			ПодписьДиректораДК.Параметры.ФлСогл1		      = "V";
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСРП Тогда
			ПодписьДиректораДЗСХП.Параметры.ФИОДиректораДЗСХП       = СФио;
			ПодписьДиректораДЗСХП.Параметры.ДолжностьДиректораДЗСХП = ДолжностьДляПечФормы;
			ПодписьДиректораДЗСХП.Параметры.ВремяПодписания2        = Стр.Дата;
			ПодписьДиректораДЗСХП.Параметры.Согласовано2            = "Подписано";
			ПодписьДиректораДЗСХП.Параметры.ФлСогл2		            = "V";
			
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСФД Тогда;
			ПодписьДиректораФД.Параметры.ФИОДиректораФД       = СФио;
			ПодписьДиректораФД.Параметры.ДолжностьДиректораФД = ДолжностьДляПечФормы;
			ПодписьДиректораФД.Параметры.ВремяПодписания3     = Стр.Дата;
			ПодписьДиректораФД.Параметры.Согласовано3         = "Согласовано";
			ПодписьДиректораФД.Параметры.ФлСогл3		      = "V";	
			
		ИначеЕсли Стр.Этап = БизнесПроцессы.СогласованиеПлатежейПоФорвардномуЗакупуСХТП.ТочкиМаршрута.СогласованиеСГБ Тогда
			ПодписьГБ.Параметры.ФИОГБ            = СФио;
			ПодписьГБ.Параметры.ДолжностьГБ      = ДолжностьДляПечФормы;
			ПодписьГБ.Параметры.ВремяПодписания4 = Стр.Дата;
			ПодписьГБ.Параметры.Согласовано4     = "Согласовано";
			ПодписьГБ.Параметры.ФлСогл4		     = "V";
		КонецЕсли;
		
	КонецЦикла;
	
	СФио                 = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Представление;
	ДолжностьДляПечФормы = ПроцедурыУправленияПерсоналом.ДанныеФизЛица(ПараметрКоманды.Организация, ПараметрКоманды.Автор.ФизЛицо, ПараметрКоманды.Дата).Должность;
	ПодписьМенДЗСХП.Параметры.ФИОМенеджераДЗСХП       = СФио;
	ПодписьМенДЗСХП.Параметры.ДолжностьМенеджераДЗСХП = ДолжностьДляПечФормы;
	ПодписьМенДЗСХП.Параметры.ВремяПодписания5        = ПараметрКоманды.Дата;
	ПодписьМенДЗСХП.Параметры.Согласовано5            = "Согласовано";
	ПодписьМенДЗСХП.Параметры.ФлСогл5		          = "V";

	
	ТабДок.Вывести(ПодписьДиректораДК);
	ТабДок.Вывести(ПодписьДиректораДЗСХП);
	ТабДок.Вывести(ПодписьДиректораФД);
	ТабДок.Вывести(ПодписьГБ);
	ТабДок.Вывести(ПодписьМенДЗСХП);

	Подвал.Параметры.ДатаРеестра             = Формат(ПараметрКоманды.Дата,"ДФ=dd.MM.yyyy");
	//--- Oleg SmartT. 2021-04-08	
		
	ТабДок.Вывести(Подвал);
КонецПроцедуры	
