Перем мПодразделенияДокументы Экспорт;  // соответствие подразделений и документов перерасчета
Перем мРаботникиДокументы Экспорт; // соответствие работников и документов перерасчета

Функция СформироватьЗапрос(Организации = Неопределено, ТекущийПериодРегистрации = Неопределено, СписокПомеченныхДокументов = Неопределено, МаксимальноеКоличествоСобытий = 0) Экспорт

	Если НЕ ЗначениеЗаполнено(ТекущийПериодРегистрации) Тогда
		ТекущийПериодРегистрации = НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату())
	КонецЕсли;	
	
	ТекстПервыхЗаписей = ?(МаксимальноеКоличествоСобытий = 0, "", " ПЕРВЫЕ " + МаксимальноеКоличествоСобытий);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",   				Организации);
	Запрос.УстановитьПараметр("ТекущийПериод", 				ТекущийПериод);
	Запрос.УстановитьПараметр("СписокПомеченныхДокументов",	СписокПомеченныхДокументов);

	Если ЗначениеЗаполнено(Организации) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫБОР
			|		КОГДА Организации.ГоловнаяОрганизация = Организации.Ссылка
			|			ТОГДА Организации.Ссылка
			|		ИНАЧЕ Организации.ГоловнаяОрганизация
			|	КОНЕЦ КАК ГоловнаяОрганизация
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка В(&Организация)";
			
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ГоловнаяОрганизация"));
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПерерасчетОсновныхНачислений.ОбъектПерерасчета КАК Документ,
		|	ПерерасчетОсновныхНачислений.ОбъектПерерасчета.ПериодРегистрации КАК ПериодРегистрации
		|
		|ПОМЕСТИТЬ ВТДокументыКПерерасчету
		|	
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК ПерерасчетОсновныхНачислений
		|ГДЕ
		|	ПерерасчетОсновныхНачислений.Организация В (&ГоловнаяОрганизация)
		|	И НЕ ПерерасчетОсновныхНачислений.ОбъектПерерасчета ССЫЛКА Документ.Сторнирование
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерерасчетДополнительныхНачислений.ОбъектПерерасчета,
		|	ПерерасчетДополнительныхНачислений.ОбъектПерерасчета.ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК ПерерасчетДополнительныхНачислений
		|ГДЕ
		|	ПерерасчетДополнительныхНачислений.Организация В (&ГоловнаяОрганизация)
		|	И НЕ ПерерасчетДополнительныхНачислений.ОбъектПерерасчета ССЫЛКА Документ.Сторнирование
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерерасчетСреднегоЗаработка.ОбъектПерерасчета,
		|	ПерерасчетСреднегоЗаработка.ОбъектПерерасчета.ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК ПерерасчетСреднегоЗаработка
		|ГДЕ
		|	ПерерасчетСреднегоЗаработка.Организация В (&ГоловнаяОрганизация)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗаполнениеПлановыхНачислений.ОбъектЗаполнения,
		|	ЗаполнениеПлановыхНачислений.ПериодРегистрации
		|ИЗ
		|	РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
		|ГДЕ
		|	ЗаполнениеПлановыхНачислений.ПериодРегистрации < &ТекущийПериод
		|	И ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение В (&Организация)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда // перерассчитывать нечего - остальные запросы исполнять не будем
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ПустаяТаблица.Документ,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодРегистрации,
			|	"""" КАК НаименованиеОрганизации,
			|	"""" КАК Наименование,
			|	"""" КАК Ссылка,
			|	"""" КАК Организация
			|ИЗ
			|	ВТДокументыКПерерасчету КАК ПустаяТаблица";
		
		Возврат Запрос.Выполнить()
	
	КонецЕсли;
	
	// однострочные документы к перерасчету предыдущих периодов с отбором по организации без исправленных документов (которых пересчитывать уже нельзя)
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НачислениеОтпускаРаботникамОрганизаций.Ссылка КАК Документ,
		|	НачислениеОтпускаРаботникамОрганизаций.ПериодРегистрации,
		|	НачислениеОтпускаРаботникамОрганизаций.Организация
		|ПОМЕСТИТЬ ВТНачислениеОтпуска
		|ИЗ
		|	Документ.НачислениеОтпускаРаботникамОрганизаций КАК НачислениеОтпускаРаботникамОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеОтпускаРаботникамОрганизаций КАК Исправления
		|		ПО НачислениеОтпускаРаботникамОрганизаций.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	НачислениеОтпускаРаботникамОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И НачислениеОтпускаРаботникамОрганизаций.Организация В (&Организация)
		|	И НачислениеОтпускаРаботникамОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НачислениеПоБольничномуЛисту.Ссылка КАК Документ,
		|	НачислениеПоБольничномуЛисту.ПериодРегистрации,
		|	НачислениеПоБольничномуЛисту.Организация
		|ПОМЕСТИТЬ ВТНачислениеПоБольничномуЛисту
		|ИЗ
		|	Документ.НачислениеПоБольничномуЛисту КАК НачислениеПоБольничномуЛисту
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеПоБольничномуЛисту КАК Исправления
		|		ПО НачислениеПоБольничномуЛисту.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	НачислениеПоБольничномуЛисту.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И НачислениеПоБольничномуЛисту.Организация В (&Организация)
		|	И НачислениеПоБольничномуЛисту.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	ОплатаПоСреднемуЗаработку.Ссылка КАК Документ,
		|	ОплатаПоСреднемуЗаработку.ПериодРегистрации,
		|	ОплатаПоСреднемуЗаработку.Организация
		|ПОМЕСТИТЬ ВТОплатаПоСреднемуЗаработку
		|ИЗ
		|	Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуЗаработку
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаПоСреднемуЗаработку КАК Исправления
		|		ПО ОплатаПоСреднемуЗаработку.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	ОплатаПоСреднемуЗаработку.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И ОплатаПоСреднемуЗаработку.Организация В (&Организация)
		|	И ОплатаПоСреднемуЗаработку.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	РасчетПриУвольненииРаботникаОрганизаций.Ссылка КАК Документ,
		|	РасчетПриУвольненииРаботникаОрганизаций.ПериодРегистрации,
		|	РасчетПриУвольненииРаботникаОрганизаций.Организация
		|ПОМЕСТИТЬ ВТРасчетПриУвольнении
		|ИЗ
		|	Документ.РасчетПриУвольненииРаботникаОрганизаций КАК РасчетПриУвольненииРаботникаОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасчетПриУвольненииРаботникаОрганизаций КАК Исправления
		|		ПО РасчетПриУвольненииРаботникаОрганизаций.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	РасчетПриУвольненииРаботникаОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И РасчетПриУвольненииРаботникаОрганизаций.Организация В (&Организация)
		|	И РасчетПриУвольненииРаботникаОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	РегистрацияПростоевВОрганизациях.Ссылка КАК Документ,
		|	РегистрацияПростоевВОрганизациях.ПериодРегистрации,
		|	РегистрацияПростоевВОрганизациях.Организация
		|ПОМЕСТИТЬ ВТРегистрацияПростоев
		|ИЗ
		|	Документ.РегистрацияПростоевВОрганизациях КАК РегистрацияПростоевВОрганизациях
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПростоевВОрганизациях КАК Исправления
		|		ПО РегистрацияПростоевВОрганизациях.Ссылка = Исправления.ПерерассчитываемыйДокумент
		|ГДЕ
		|	РегистрацияПростоевВОрганизациях.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И РегистрацияПростоевВОрганизациях.Организация В (&Организация)
		|	И РегистрацияПростоевВОрганизациях.ПериодРегистрации <= &ТекущийПериод
		|	И Исправления.Ссылка ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();

	// документы к перерасчету предыдущих периодов с отбором по организации, но включая исправленные документы
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка КАК Документ,
		|	НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации КАК ПериодРегистрации,
		|	НачислениеЗарплатыРаботникамОрганизаций.Организация
		|ПОМЕСТИТЬ ВТНачислениеЗарплаты
		|ИЗ
		|	Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
		|ГДЕ
		|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И НачислениеЗарплатыРаботникамОрганизаций.Организация В (&Организация)
		|	И НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|	И (НачислениеЗарплатыРаботникамОрганизаций.Проведен
		|			ИЛИ НачислениеЗарплатыРаботникамОрганизаций.ПериодРегистрации = &ТекущийПериод)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Ссылка КАК Документ,
		|	ОплатаПраздничныхИВыходныхДнейОрганизаций.ПериодРегистрации КАК ПериодРегистрации,
		|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Организация
		|ПОМЕСТИТЬ ВТОплатаПраздничных
		|ИЗ
		|	Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций КАК ОплатаПраздничныхИВыходныхДнейОрганизаций
		|ГДЕ
		|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И ОплатаПраздничныхИВыходныхДнейОрганизаций.Организация В (&Организация)
		|	И ОплатаПраздничныхИВыходныхДнейОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	НевыходыВОрганизациях.Ссылка КАК Документ,
		|	НевыходыВОрганизациях.ПериодРегистрации КАК ПериодРегистрации,
		|	НевыходыВОрганизациях.Организация
		|ПОМЕСТИТЬ ВТНевыходыВОрганизациях
		|ИЗ
		|	Документ.НевыходыВОрганизациях КАК НевыходыВОрганизациях
		|ГДЕ
		|	НевыходыВОрганизациях.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И НевыходыВОрганизациях.Организация В (&Организация)
		|	И НевыходыВОрганизациях.ПериодРегистрации <= &ТекущийПериод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	ОплатаСверхурочныхЧасов.Ссылка КАК Документ,
		|	ОплатаСверхурочныхЧасов.ПериодРегистрации КАК ПериодРегистрации,
		|	ОплатаСверхурочныхЧасов.Организация
		|ПОМЕСТИТЬ ВТОплатаСверхурочныхЧасов
		|ИЗ
		|	Документ.ОплатаСверхурочныхЧасов КАК ОплатаСверхурочныхЧасов
		|ГДЕ
		|	ОплатаСверхурочныхЧасов.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И ОплатаСверхурочныхЧасов.Организация В (&Организация)
		|	И ОплатаСверхурочныхЧасов.ПериодРегистрации <= &ТекущийПериод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	ПремииРаботниковОрганизаций.Ссылка КАК Документ,
		|	ПремииРаботниковОрганизаций.ПериодРегистрации КАК ПериодРегистрации,
		|	ПремииРаботниковОрганизаций.Организация
		|ПОМЕСТИТЬ ВТПремии
		|ИЗ
		|	Документ.ПремииРаботниковОрганизаций КАК ПремииРаботниковОрганизаций
		|ГДЕ
		|	ПремииРаботниковОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И ПремииРаботниковОрганизаций.Организация В (&Организация)
		|	И ПремииРаботниковОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ " + ТекстПервыхЗаписей + "
		|	РегистрацияРазовыхНачисленийРаботниковОрганизаций.Ссылка КАК Документ,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизаций.ПериодРегистрации КАК ПериодРегистрации,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизаций.Организация
		|ПОМЕСТИТЬ ВТРазовыеНачисления
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций КАК РегистрацияРазовыхНачисленийРаботниковОрганизаций
		|ГДЕ
		|	РегистрацияРазовыхНачисленийРаботниковОрганизаций.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТДокументыКПерерасчету КАК ДокументыКПерерасчету)
		|	И РегистрацияРазовыхНачисленийРаботниковОрганизаций.Организация В (&Организация)
		|	И РегистрацияРазовыхНачисленийРаботниковОрганизаций.ПериодРегистрации <= &ТекущийПериод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";
	Запрос.Выполнить();

	// документы-исправления выбранных ранее документов, нуждающихся в перерасчете - только многострочные
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗарплатыРаботникамОрганизаций.Ссылка КАК Документ,
		|	НачислениеЗарплатыРаботникамОрганизаций.ПерерассчитываемыйДокумент КАК ИсходныйДокумент
		|ПОМЕСТИТЬ ВТДокументыИсправления
		|ИЗ
		|	Документ.НачислениеЗарплатыРаботникамОрганизаций КАК НачислениеЗарплатыРаботникамОрганизаций
		|ГДЕ
		|	НачислениеЗарплатыРаботникамОрганизаций.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТНачислениеЗарплаты КАК ДокументыКПерерасчету)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаПраздничныхИВыходныхДнейОрганизаций.Ссылка,
		|	ОплатаПраздничныхИВыходныхДнейОрганизаций.ПерерассчитываемыйДокумент
		|ИЗ
		|	Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций КАК ОплатаПраздничныхИВыходныхДнейОрганизаций
		|ГДЕ
		|	ОплатаПраздничныхИВыходныхДнейОрганизаций.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТОплатаПраздничных КАК ДокументыКПерерасчету)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НевыходыВОрганизациях.Ссылка,
		|	НевыходыВОрганизациях.ПерерассчитываемыйДокумент
		|ИЗ
		|	Документ.НевыходыВОрганизациях КАК НевыходыВОрганизациях
		|ГДЕ
		|	НевыходыВОрганизациях.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТНевыходыВОрганизациях КАК ДокументыКПерерасчету)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОплатаСверхурочныхЧасов.Ссылка,
		|	ОплатаСверхурочныхЧасов.ПерерассчитываемыйДокумент
		|ИЗ
		|	Документ.ОплатаСверхурочныхЧасов КАК ОплатаСверхурочныхЧасов
		|ГДЕ
		|	ОплатаСверхурочныхЧасов.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТОплатаСверхурочныхЧасов КАК ДокументыКПерерасчету)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПремииРаботниковОрганизаций.Ссылка,
		|	ПремииРаботниковОрганизаций.ПерерассчитываемыйДокумент
		|ИЗ
		|	Документ.ПремииРаботниковОрганизаций КАК ПремииРаботниковОрганизаций
		|ГДЕ
		|	ПремииРаботниковОрганизаций.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТПремии КАК ДокументыКПерерасчету)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрацияРазовыхНачисленийРаботниковОрганизаций.Ссылка,
		|	РегистрацияРазовыхНачисленийРаботниковОрганизаций.ПерерассчитываемыйДокумент
		|ИЗ
		|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций КАК РегистрацияРазовыхНачисленийРаботниковОрганизаций
		|ГДЕ
		|	РегистрацияРазовыхНачисленийРаботниковОрганизаций.ПерерассчитываемыйДокумент В
		|			(ВЫБРАТЬ
		|				ДокументыКПерерасчету.Документ
		|			ИЗ
		|				ВТРазовыеНачисления КАК ДокументыКПерерасчету)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ";

	Если Запрос.Выполнить().Выгрузить()[0].Количество = 0 Тогда // все многострочные документы оказались неисправленными, лишние запросы исполнять не будем 
		       
		ТекстЗапроса = "ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации КАК ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Пометка,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ) КАК Наименование,
			|	ДокументыПерерасчета.Организация.Наименование КАК НаименованиеОрганизации,
			|	ДокументыПерерасчета.Документ КАК Ссылка,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТНачислениеОтпуска КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТНачислениеПоБольничномуЛисту КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТОплатаПоСреднемуЗаработку КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТРасчетПриУвольнении КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТРегистрацияПростоев КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТНачислениеЗарплаты КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТОплатаПраздничных КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТНевыходыВОрганизациях КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТОплатаСверхурочныхЧасов КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТПремии КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТРазовыеНачисления КАК ДокументыПерерасчета
			|УПОРЯДОЧИТЬ ПО
			|	ПериодРегистрации";
		
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ КАК Документ,
			|	ДокументыПерерасчета.ПериодРегистрации КАК ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ПОМЕСТИТЬ ВТДокументыПерерасчетаСИсправленными
			|ИЗ
			|	ВТНачислениеЗарплаты КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТОплатаПраздничных КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТНевыходыВОрганизациях КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТОплатаСверхурочныхЧасов КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТПремии КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТРазовыеНачисления КАК ДокументыПерерасчета
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Документ";
		Запрос.Выполнить();
		
		// физлица, чьи результаты расчетов устарели
		Запрос.Текст = "ВЫБРАТЬ
			|	ОсновныеНачисленияРаботниковОрганизацийПерерасчетОсновныхНачислений.Сотрудник КАК Сотрудник,
			|	ОсновныеНачисленияРаботниковОрганизацийПерерасчетОсновныхНачислений.ОбъектПерерасчета КАК Ссылка
			|ПОМЕСТИТЬ ВТФизлицаПерерасчета
			|ИЗ
			|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК ОсновныеНачисленияРаботниковОрганизацийПерерасчетОсновныхНачислений
			|ГДЕ
			|	ОсновныеНачисленияРаботниковОрганизацийПерерасчетОсновныхНачислений.ОбъектПерерасчета В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДополнительныеНачисленияРаботниковОрганизацийПерерасчетДополнительныхНачислений.Сотрудник,
			|	ДополнительныеНачисленияРаботниковОрганизацийПерерасчетДополнительныхНачислений.ОбъектПерерасчета
			|ИЗ
			|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК ДополнительныеНачисленияРаботниковОрганизацийПерерасчетДополнительныхНачислений
			|ГДЕ
			|	ДополнительныеНачисленияРаботниковОрганизацийПерерасчетДополнительныхНачислений.ОбъектПерерасчета В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.Сотрудник,
			|	РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.ОбъектПерерасчета
			|ИЗ
			|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка
			|ГДЕ
			|	РасчетСреднегоЗаработкаПерерасчетСреднегоЗаработка.ОбъектПерерасчета В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ 
			|	ДанныеДокументы.Сотрудник,
			|	ЗаполнениеПлановыхНачислений.ОбъектЗаполнения
			|ИЗ
			|	РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник КАК Сотрудник,
			|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка КАК Ссылка,
			|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Физлицо КАК Физлицо
			|		ИЗ
			|			Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК НачислениеЗарплатыРаботникамОрганизацийНачисления
			|		ГДЕ
			|			НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка В
			|					(ВЫБРАТЬ
			|						ДокументыКПерерасчету.Документ
			|					ИЗ
			|						ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету
			|					ГДЕ
			|						ДокументыКПерерасчету.Документ ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций)
			|		
			|		ОБЪЕДИНИТЬ ВСЕ
			|		
			|		ВЫБРАТЬ
			|			НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Сотрудник,
			|			НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Ссылка,
			|			НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Физлицо
			|		ИЗ
			|			Документ.НачислениеЗарплатыРаботникамОрганизаций.ДополнительныеНачисления КАК НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления
			|		ГДЕ
			|			НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Ссылка В
			|					(ВЫБРАТЬ
			|						ДокументыКПерерасчету.Документ
			|					ИЗ
			|						ВТДокументыПерерасчетаСИсправленными КАК ДокументыКПерерасчету
			|					ГДЕ
			|						ДокументыКПерерасчету.Документ ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций)) КАК ДанныеДокументы
			|		ПО ЗаполнениеПлановыхНачислений.ОбъектЗаполнения = ДанныеДокументы.Ссылка
			|			И ЗаполнениеПлановыхНачислений.Сотрудник = ДанныеДокументы.Сотрудник
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка,
			|	Сотрудник";
		Запрос.Выполнить();
		
		// физлица, чьи результаты расчетов уже исправляли, содержащие только таких сотрудников документы не предлагаем к перерасчету
		Запрос.Текст = "ВЫБРАТЬ
			|	ДокументыИсправления.ИсходныйДокумент КАК Ссылка,
			|	НачислениеЗарплатыРаботникамОрганизацийНачисления.Сотрудник КАК Сотрудник
			|ПОМЕСТИТЬ ВТСотрудникиИсправлений
			|ИЗ
			|	Документ.НачислениеЗарплатыРаботникамОрганизаций.Начисления КАК НачислениеЗарплатыРаботникамОрганизацийНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИсправления КАК ДокументыИсправления
			|		ПО НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка = ДокументыИсправления.Документ
			|			И НачислениеЗарплатыРаботникамОрганизацийНачисления.СторнируемыйДокумент = ДокументыИсправления.ИсходныйДокумент
			|ГДЕ
			|	НачислениеЗарплатыРаботникамОрганизацийНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций)
			|	И НачислениеЗарплатыРаботникамОрганизацийНачисления.Сторно
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыИсправления.ИсходныйДокумент,
			|	НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Сотрудник
			|ИЗ
			|	Документ.НачислениеЗарплатыРаботникамОрганизаций.ДополнительныеНачисления КАК НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИсправления КАК ДокументыИсправления
			|		ПО НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Ссылка = ДокументыИсправления.Документ
			|			И НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.СторнируемыйДокумент = ДокументыИсправления.ИсходныйДокумент
			|ГДЕ
			|	НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.НачислениеЗарплатыРаботникамОрганизаций)
			|	И НачислениеЗарплатыРаботникамОрганизацийДополнительныеНачисления.Сторно
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыИсправления.ИсходныйДокумент,
			|	РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сотрудник
			|ИЗ
			|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ОсновныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИсправления КАК ДокументыИсправления
			|		ПО РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка = ДокументыИсправления.Документ
			|			И РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.СторнируемыйДокумент = ДокументыИсправления.ИсходныйДокумент
			|ГДЕ
			|	РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций)
			|	И РегистрацияРазовыхНачисленийРаботниковОрганизацийОсновныеНачисления.Сторно
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыИсправления.ИсходныйДокумент,
			|	РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сотрудник
			|ИЗ
			|	Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций.ДополнительныеНачисления КАК РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИсправления КАК ДокументыИсправления
			|		ПО РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка = ДокументыИсправления.Документ
			|			И РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.СторнируемыйДокумент = ДокументыИсправления.ИсходныйДокумент
			|ГДЕ
			|	РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.РегистрацияРазовыхНачисленийРаботниковОрганизаций)
			|	И РегистрацияРазовыхНачисленийРаботниковОрганизацийДополнительныеНачисления.Сторно
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыИсправления.ИсходныйДокумент,
			|	НевыходыВОрганизацияхНачисления.Сотрудник
			|ИЗ
			|	Документ.НевыходыВОрганизациях.Начисления КАК НевыходыВОрганизацияхНачисления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыИсправления КАК ДокументыИсправления
			|		ПО НевыходыВОрганизацияхНачисления.Ссылка = ДокументыИсправления.Документ
			|			И НевыходыВОрганизацияхНачисления.СторнируемыйДокумент = ДокументыИсправления.ИсходныйДокумент
			|ГДЕ
			|	НевыходыВОрганизацияхНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.НевыходыВОрганизациях)
			|	И НевыходыВОрганизацияхНачисления.Сторно
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПремииРаботниковОрганизацийНачисления.Ссылка.ПерерассчитываемыйДокумент,
			|	ПремииРаботниковОрганизацийНачисления.Сотрудник
			|ИЗ
			|	Документ.ПремииРаботниковОрганизаций.Начисления КАК ПремииРаботниковОрганизацийНачисления
			|ГДЕ
			|	ПремииРаботниковОрганизацийНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.ПремииРаботниковОрганизаций)
			|	И ПремииРаботниковОрганизацийНачисления.Сторно
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОплатаПраздничныхИВыходныхДнейОрганизацийНачисления.Ссылка.ПерерассчитываемыйДокумент,
			|	ОплатаПраздничныхИВыходныхДнейОрганизацийНачисления.Физлицо
			|ИЗ
			|	Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций.Начисления КАК ОплатаПраздничныхИВыходныхДнейОрганизацийНачисления
			|ГДЕ
			|	ОплатаПраздничныхИВыходныхДнейОрганизацийНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.ОплатаПраздничныхИВыходныхДнейОрганизаций)
			|	И ОплатаПраздничныхИВыходныхДнейОрганизацийНачисления.Сторно
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОплатаСверхурочныхЧасовНачисления.Ссылка.ПерерассчитываемыйДокумент,
			|	ОплатаСверхурочныхЧасовНачисления.Физлицо
			|ИЗ
			|	Документ.ОплатаСверхурочныхЧасов.Начисления КАК ОплатаСверхурочныхЧасовНачисления
			|ГДЕ
			|	ОплатаСверхурочныхЧасовНачисления.Ссылка В
			|			(ВЫБРАТЬ
			|				ДокументыКПерерасчету.Документ
			|			ИЗ
			|				ВТДокументыИсправления КАК ДокументыКПерерасчету
			|			ГДЕ
			|				ДокументыКПерерасчету.Документ ССЫЛКА Документ.ОплатаСверхурочныхЧасов)
			|	И ОплатаСверхурочныхЧасовНачисления.Сторно
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка,
			|	Сотрудник";
		Запрос.Выполнить();
		
		ТекстЗапроса = "ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации КАК ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК Пометка,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ) КАК Наименование,
			|	ДокументыПерерасчета.Организация.Наименование КАК НаименованиеОрганизации,
			|	ДокументыПерерасчета.Документ КАК Ссылка,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТНачислениеОтпуска КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТНачислениеПоБольничномуЛисту КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТОплатаПоСреднемуЗаработку КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТРасчетПриУвольнении КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТРегистрацияПростоев КАК ДокументыПерерасчета
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ " + ТекстПервыхЗаписей + "
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.ПериодРегистрации,
			|	ВЫБОР
			|		КОГДА ДокументыПерерасчета.Документ В (&СписокПомеченныхДокументов)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	ПРЕДСТАВЛЕНИЕ(ДокументыПерерасчета.Документ),
			|	ДокументыПерерасчета.Организация.Наименование,
			|	ДокументыПерерасчета.Документ,
			|	ДокументыПерерасчета.Организация
			|ИЗ
			|	ВТДокументыПерерасчетаСИсправленными КАК ДокументыПерерасчета
			|ГДЕ
			|	ДокументыПерерасчета.Документ В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Документы.Ссылка КАК Ссылка
			|			ИЗ
			|				ВТФизлицаПерерасчета КАК Документы 
			|					ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиИсправлений КАК ДокументыИсправления
			|					ПО Документы.Ссылка = ДокументыИсправления.Ссылка
			|						И Документы.Сотрудник = ДокументыИсправления.Сотрудник
			|			ГДЕ
			|				ДокументыИсправления.Сотрудник ЕСТЬ NULL )
			|УПОРЯДОЧИТЬ ПО
			|	ПериодРегистрации";
		
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить()
	
КонецФункции

// Заполняет список физлиц по которым необходимо пересчитать зарплату по заданной организации
// Параметры: 
//	Организация - ссылка на организацию
// Возвращаемое значение:
//	Нет
//
Процедура ЗаполнитьДанныеПоОрганизации() Экспорт
	
	мПодразделенияДокументы.Очистить();
	мРаботникиДокументы.Очистить();
	
	СписокПодразделений.Очистить();
	СписокРаботников.Очистить();
	
	// пока не выбрана организация ничего не делаем
	Если Организация.Пустая() Тогда
		СписокДокументов.Очистить();
		Возврат;
	КонецЕсли;
	
	//запомним какие документы отмечены в списке документов
	ТаблицаДокументов = СписокДокументов.Выгрузить();
	МассивСтрок 			   = ТаблицаДокументов.НайтиСтроки(Новый Структура("Пометка", Истина));
	СписокПомеченныхДокументов = ТаблицаДокументов.Скопировать(МассивСтрок).ВыгрузитьКолонку("Документ");
	
	Результат = СформироватьЗапрос(Организация, ТекущийПериод, СписокПомеченныхДокументов);
	
	СписокДокументов.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

// перерассчитать помеченные документы,
// в порядке от самого старого до самого нового.
Процедура Перерассчитать() Экспорт
	
	ИндексСтрокиТаблицы = СписокДокументов.Количество();
	Пока ИндексСтрокиТаблицы > 0 Цикл
		ИндексСтрокиТаблицы = ИндексСтрокиТаблицы - 1;
		
		СтрокаТаблицы = СписокДокументов[ИндексСтрокиТаблицы];
		Если СтрокаТаблицы.Пометка Тогда
			ДокументОбъект = СтрокаТаблицы.Документ.ПолучитьОбъект();
			Попытка
				ДокументОбъект.Перерассчитать();
			Исключение
				Сообщить("Документ " + Строка(ДокументОбъект) + " не может быть перерассчитан!
				|" + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьДанныеПоОрганизации();
	
КонецПроцедуры

// удалить сведения о перерасчете помеченных документов
Процедура УдалитьСведенияОПерерасчете() Экспорт
	
	ПерерасчетыПоДокументам = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетОсновныхНачислений.СоздатьНаборЗаписей();
	ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование 	  = Истина;
	ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения 	  = ВидСравнения.Равно;
	
	ДопПерерасчетыПоДокументам = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетДополнительныхНачислений.СоздатьНаборЗаписей();
	ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование  = Истина;
	ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения   = ВидСравнения.Равно;
	
	СредПерерасчетыПоДокументам = РегистрыРасчета.РасчетСреднегоЗаработка.Перерасчеты.ПерерасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения  = ВидСравнения.Равно;
	
	НаборПерезаполнения = РегистрыСведений.ЗаполнениеПлановыхНачислений.СоздатьНаборЗаписей();
	НаборПерезаполнения.Отбор.ОбъектЗаполнения.Использование 		  = Истина;
	НаборПерезаполнения.Отбор.ОбъектЗаполнения.ВидСравнения 		  = ВидСравнения.Равно;
	
	Для Каждого СтрокаТаблицы Из СписокДокументов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ТипРегистратора = ТипЗнч(СтрокаТаблицы.Документ);
			Если ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) тогда
				ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение     = СтрокаТаблицы.Документ;
				ПерерасчетыПоДокументам.Записать(Истина);
			КонецЕсли;
			Если ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) тогда
				ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение  = СтрокаТаблицы.Документ;
				ДопПерерасчетыПоДокументам.Записать(Истина);
			КонецЕсли;
			Если СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) тогда
				СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение = СтрокаТаблицы.Документ;
				СредПерерасчетыПоДокументам.Записать(Истина);
			КонецЕсли;
			Если НаборПерезаполнения.Отбор.ОбъектЗаполнения.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
				НаборПерезаполнения.Отбор.ОбъектЗаполнения.Значение = СтрокаТаблицы.Документ;
				НаборПерезаполнения.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьДанныеПоОрганизации();
	
КонецПроцедуры

// заполняет табличную часть СписокПодразделений и соответсвие мПодразделенияДокументы 
// предназначенные для выполнения команды "отметить по подразделениеям"
Процедура ЗаполнитьСписокПодразделений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Перерасчеты.ОбъектПерерасчета КАК Документ,
	|	Работники.ПодразделениеОрганизации.Наименование КАК ПодразделениеНаименование,
	|	Работники.ПодразделениеОрганизации КАК Подразделение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Перерасчет.Сотрудник КАК Сотрудник,
	|		Перерасчет.ОбъектПерерасчета КАК ОбъектПерерасчета
	|	ИЗ
	|		РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
	|	ГДЕ
	|		Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Перерасчет.Сотрудник,
	|		Перерасчет.ОбъектПерерасчета
	|	ИЗ
	|		РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
	|	ГДЕ
	|		Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Перерасчет.Сотрудник,
	|		Перерасчет.ОбъектПерерасчета
	|	ИЗ
	|		РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет
	|	ГДЕ
	|		Перерасчет.ОбъектПерерасчета.Организация = &Организация) КАК Перерасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		&ТекущийПериод,
	|		Организация = &Организация
	|		    И Сотрудник В
	|		        (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		            Перерасчет.Сотрудник
	|		        ИЗ
	|		            РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
	|		
	|		        ОБЪЕДИНИТЬ
	|		
	|		        ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		            Перерасчет.Сотрудник
	|		        ИЗ
	|		            РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
	|		
	|		        ОБЪЕДИНИТЬ
	|		
	|		        ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		            Перерасчет.Сотрудник
	|		        ИЗ
	|		            РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет)) КАК Работники
	|		ПО Перерасчеты.Сотрудник = Работники.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеНаименование";
	
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущийПериод);
	Запрос.УстановитьПараметр("Организация",   Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументыМассив = мПодразделенияДокументы.Получить(Выборка.Подразделение);
		Если ДокументыМассив = Неопределено Тогда
			ДокументыМассив = Новый Массив;
			ДокументыМассив.Добавить(Выборка.Документ);
			мПодразделенияДокументы[Выборка.Подразделение] = ДокументыМассив;
			Строка = СписокПодразделений.Добавить();
			Строка.Подразделение = Выборка.Подразделение;
			Строка.ПодразделениеНаименование = Выборка.ПодразделениеНаименование;
		Иначе
			ДокументыМассив.Добавить(Выборка.Документ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// заполняет табличную часть СписокРаботников и соответсвие мРаботникиДокументы 
// предназначенные для выполнения команды "отметить по подразделениям"
Процедура ЗаполнитьСписокРаботников() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Перерасчет.Сотрудник КАК Сотрудник,
	|	Перерасчет.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Перерасчет.ОбъектПерерасчета КАК Документ
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.Сотрудник,
	|	Перерасчет.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Перерасчет.ОбъектПерерасчета
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.Сотрудник,
	|	Перерасчет.Сотрудник.Наименование,
	|	Перерасчет.ОбъектПерерасчета
	|ИЗ
	|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникНаименование";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументыМассив = мРаботникиДокументы.Получить(Выборка.Сотрудник);
		Если ДокументыМассив = Неопределено Тогда
			ДокументыМассив = Новый Массив;
			ДокументыМассив.Добавить(Выборка.Документ);
			мРаботникиДокументы[Выборка.Сотрудник] = ДокументыМассив;
			Строка = СписокРаботников.Добавить();
			Строка.Сотрудник = Выборка.Сотрудник;
			Строка.РаботникНаименование = Выборка.СотрудникНаименование;
		Иначе
			ДокументыМассив.Добавить(Выборка.Документ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// удаляет перерасчеты исправленных документов
//
Процедура УдалитьПерерассчетыМеханизмаИсправлений() Экспорт
	
	ЗапросПоПерерасчетам = Новый Запрос;
	ЗапросПоПерерасчетам.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерерасчетСреднегоЗаработкаРаботников.ОбъектПерерасчета КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ОбъектыПерерасчетаСреднийЗаработок
		|ИЗ
		|	РегистрРасчета.РасчетСреднегоЗаработка КАК НачисленияРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК ПерерасчетСреднегоЗаработкаРаботников
		|		ПО НачисленияРаботников.Регистратор = ПерерасчетСреднегоЗаработкаРаботников.ОбъектПерерасчета
		|			И НачисленияРаботников.ВидРасчета = ПерерасчетСреднегоЗаработкаРаботников.ВидРасчета
		|			И НачисленияРаботников.Сотрудник = ПерерасчетСреднегоЗаработкаРаботников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковРегистратор
		|		ПО (НачисленияРаботниковРегистратор.Сотрудник = НачисленияРаботников.Сотрудник)
		|			И (НачисленияРаботников.БазовыйПериодНачало МЕЖДУ НАЧАЛОПЕРИОДА(НачисленияРаботниковРегистратор.ПериодДействияНачало, МЕСЯЦ) И КОНЕЦПЕРИОДА(НачисленияРаботниковРегистратор.ПериодДействияКонец, МЕСЯЦ))
		|			И (НачисленияРаботников.БазовыйПериодКонец МЕЖДУ НАЧАЛОПЕРИОДА(НачисленияРаботниковРегистратор.ПериодДействияНачало, МЕСЯЦ) И КОНЕЦПЕРИОДА(НачисленияРаботниковРегистратор.ПериодДействияКонец, МЕСЯЦ))
		|ГДЕ
		|	НачисленияРаботников.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПерерасчетСреднегоЗаработкаРаботников.ОбъектПерерасчета
		|ИЗ
		|	РегистрРасчета.РасчетСреднегоЗаработка КАК НачисленияРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК ПерерасчетСреднегоЗаработкаРаботников
		|		ПО НачисленияРаботников.Регистратор = ПерерасчетСреднегоЗаработкаРаботников.ОбъектПерерасчета
		|			И НачисленияРаботников.ВидРасчета = ПерерасчетСреднегоЗаработкаРаботников.ВидРасчета
		|			И НачисленияРаботников.Сотрудник = ПерерасчетСреднегоЗаработкаРаботников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК НачисленияРаботниковРегистратор
		|		ПО (НачисленияРаботниковРегистратор.Сотрудник = НачисленияРаботников.Сотрудник)
		|			И (НачисленияРаботников.БазовыйПериодНачало МЕЖДУ НАЧАЛОПЕРИОДА(НачисленияРаботниковРегистратор.БазовыйПериодНачало, МЕСЯЦ) И КОНЕЦПЕРИОДА(НачисленияРаботниковРегистратор.БазовыйПериодКонец, МЕСЯЦ))
		|			И (НачисленияРаботников.БазовыйПериодКонец МЕЖДУ НАЧАЛОПЕРИОДА(НачисленияРаботниковРегистратор.БазовыйПериодНачало, МЕСЯЦ) И КОНЕЦПЕРИОДА(НачисленияРаботниковРегистратор.БазовыйПериодКонец, МЕСЯЦ))
		|ГДЕ
		|	НачисленияРаботников.Организация = &Организация
		|;
		|
		|/////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновныеНачисленияРаботниковОрганизаций.Регистратор,
		|	ОсновныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	ОсновныеНачисленияРаботниковОрганизаций.Сотрудник,
		|	ОсновныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|	ОсновныеНачисленияРаботниковОрганизаций.Организация,
		|	""СреднийЗаработок"" КАК ВидРегистраРасчета
		|ПОМЕСТИТЬ ВТПерерасчетыСреднийЗаработок
		|ИЗ
		|	ВТ_ОбъектыПерерасчетаСреднийЗаработок КАК ОбъектыПерерасчетаСреднийЗаработок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисленияРаботниковОрганизаций
		|		ПО ОбъектыПерерасчетаСреднийЗаработок.Регистратор = ОсновныеНачисленияРаботниковОрганизаций.Регистратор
		|			И ((НЕ ОсновныеНачисленияРаботниковОрганизаций.Сторно))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДополнительныеНачисленияРаботниковОрганизаций.Регистратор,
		|	ДополнительныеНачисленияРаботниковОрганизаций.ВидРасчета,
		|	ДополнительныеНачисленияРаботниковОрганизаций.Сотрудник,
		|	ДополнительныеНачисленияРаботниковОрганизаций.ФизЛицо,
		|	ДополнительныеНачисленияРаботниковОрганизаций.Организация,
		|	""СреднийЗаработок""
		|ИЗ
		|	ВТ_ОбъектыПерерасчетаСреднийЗаработок КАК ОбъектыПерерасчетаСреднийЗаработок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисленияРаботниковОрганизаций
		|		ПО ОбъектыПерерасчетаСреднийЗаработок.Регистратор = ДополнительныеНачисленияРаботниковОрганизаций.Регистратор
		|			И ((НЕ ДополнительныеНачисленияРаботниковОрганизаций.Сторно))
		|;
		|
		|/////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияРаботниковПерерасчет.ОбъектПерерасчета,
		|	НачисленияРаботниковПерерасчет.ВидРасчета,
		|	НачисленияРаботниковПерерасчет.Сотрудник,
		|	НачисленияРаботниковПерерасчет.ФизЛицо,
		|	НачисленияРаботниковПерерасчет.Организация,
		|	""ОсновныеНачисления"" КАК ВидРегистраРасчета
		|ПОМЕСТИТЬ ВТПерерасчеты
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК НачисленияРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК НачисленияРаботниковПерерасчет
		|		ПО НачисленияРаботников.Регистратор = НачисленияРаботниковПерерасчет.ОбъектПерерасчета
		|			И НачисленияРаботников.ВидРасчета = НачисленияРаботниковПерерасчет.ВидРасчета
		|			И НачисленияРаботников.Сотрудник = НачисленияРаботниковПерерасчет.Сотрудник
		|ГДЕ
		|	(НЕ НачисленияРаботников.Сторно)
		|	И НачисленияРаботников.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияРаботниковПерерасчет.ОбъектПерерасчета,
		|	НачисленияРаботниковПерерасчет.ВидРасчета,
		|	НачисленияРаботниковПерерасчет.Сотрудник,
		|	НачисленияРаботниковПерерасчет.ФизЛицо,
		|	НачисленияРаботниковПерерасчет.Организация,
		|	""ОсновныеНачисления""
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК НачисленияРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК НачисленияРаботниковПерерасчет
		|		ПО НачисленияРаботников.Регистратор = НачисленияРаботниковПерерасчет.ОбъектПерерасчета
		|			И НачисленияРаботников.ВидРасчета = НачисленияРаботниковПерерасчет.ВидРасчета
		|			И НачисленияРаботников.Сотрудник = НачисленияРаботниковПерерасчет.Сотрудник
		|ГДЕ
		|	(НЕ НачисленияРаботников.Сторно)
		|	И НачисленияРаботников.Организация = &Организация
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияРаботниковПерерасчет.ОбъектПерерасчета,
		|	НачисленияРаботниковПерерасчет.ВидРасчета,
		|	НачисленияРаботниковПерерасчет.Сотрудник,
		|	НачисленияРаботниковПерерасчет.ФизЛицо,
		|	НачисленияРаботниковПерерасчет.Организация,
		|	""ДополнительныеНачисления""
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК НачисленияРаботников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК НачисленияРаботниковПерерасчет
		|		ПО НачисленияРаботников.Регистратор = НачисленияРаботниковПерерасчет.ОбъектПерерасчета
		|			И НачисленияРаботников.ВидРасчета = НачисленияРаботниковПерерасчет.ВидРасчета
		|			И НачисленияРаботников.Сотрудник = НачисленияРаботниковПерерасчет.Сотрудник
		|ГДЕ
		|	(НЕ НачисленияРаботников.Сторно)
		|	И НачисленияРаботников.Организация = &Организация
		|;
		|
		|/////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ПерерасчетыСреднийЗаработок.Регистратор КАК ОбъектПерерасчета,
		|	ПерерасчетыСреднийЗаработок.Сотрудник
		|ИЗ
		|	ВТПерерасчетыСреднийЗаработок КАК ПерерасчетыСреднийЗаработок
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК ОсновныеНачисления
		|		ПО ПерерасчетыСреднийЗаработок.Регистратор = ОсновныеНачисления.СторнируемыйДокумент
		|			И ПерерасчетыСреднийЗаработок.Сотрудник = ОсновныеНачисления.Сотрудник
		|			И ПерерасчетыСреднийЗаработок.ВидРасчета = ОсновныеНачисления.ВидРасчета
		|ГДЕ
		|	НЕ ОсновныеНачисления.СторнируемыйДокумент ЕСТЬ NULL
		|	И ПерерасчетыСреднийЗаработок.ВидРегистраРасчета = ""СреднийЗаработок""
		|	
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ 
		|	ПерерасчетыСреднийЗаработок.Регистратор,
		|	ПерерасчетыСреднийЗаработок.Сотрудник
		|ИЗ
		|	ВТПерерасчетыСреднийЗаработок КАК ПерерасчетыСреднийЗаработок
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК ДополнительныеНачисления
		|		ПО ПерерасчетыСреднийЗаработок.Регистратор = ДополнительныеНачисления.СторнируемыйДокумент
		|			И ПерерасчетыСреднийЗаработок.Сотрудник = ДополнительныеНачисления.Сотрудник
		|			И ПерерасчетыСреднийЗаработок.ВидРасчета = ДополнительныеНачисления.ВидРасчета
		|ГДЕ
		|	НЕ ДополнительныеНачисления.СторнируемыйДокумент ЕСТЬ NULL
		|	И ПерерасчетыСреднийЗаработок.ВидРегистраРасчета = ""ДополнительныеНачисления""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТПерерасчеты.ОбъектПерерасчета,
		|	ВТПерерасчеты.Сотрудник
		|ИЗ
		|	ВТПерерасчеты КАК ВТПерерасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций КАК НачисленияРаботников
		|		ПО ВТПерерасчеты.ОбъектПерерасчета = НачисленияРаботников.СторнируемыйДокумент
		|			И ВТПерерасчеты.Сотрудник = НачисленияРаботников.Сотрудник
		|			И ВТПерерасчеты.ВидРасчета = НачисленияРаботников.ВидРасчета
		|ГДЕ
		|	НЕ НачисленияРаботников.СторнируемыйДокумент ЕСТЬ NULL
		|	И ВТПерерасчеты.ВидРегистраРасчета = ""ОсновныеНачисления""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВТПерерасчеты.ОбъектПерерасчета,
		|	ВТПерерасчеты.Сотрудник
		|ИЗ
		|	ВТПерерасчеты КАК ВТПерерасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций КАК НачисленияРаботников
		|		ПО ВТПерерасчеты.ОбъектПерерасчета = НачисленияРаботников.СторнируемыйДокумент
		|			И ВТПерерасчеты.Сотрудник = НачисленияРаботников.Сотрудник
		|			И ВТПерерасчеты.ВидРасчета = НачисленияРаботников.ВидРасчета
		|ГДЕ
		|	НЕ НачисленияРаботников.СторнируемыйДокумент ЕСТЬ NULL
		|	И ВТПерерасчеты.ВидРегистраРасчета = ""ДополнительныеНачисления""
		|
		|ИТОГИ ПО
		|	ОбъектПерерасчета";

	ЗапросПоПерерасчетам.УстановитьПараметр("Организация", Организация);
	ВыборкаПоДокументам = ЗапросПоПерерасчетам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПерерасчетыПоДокументам = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетОсновныхНачислений.СоздатьНаборЗаписей();
	ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование 	 = Истина;
	ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения 	 = ВидСравнения.Равно;
	
	ДопПерерасчетыПоДокументам = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетДополнительныхНачислений.СоздатьНаборЗаписей();
	ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения  = ВидСравнения.Равно;
	
	СредПерерасчетыПоДокументам = РегистрыРасчета.РасчетСреднегоЗаработка.Перерасчеты.ПерерасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения  = ВидСравнения.Равно;
	
	// очищать будем записи по объекту перерасчета - перерассчетов у исправленного документа не должно быть
	ПерерасчетыСотрудниковПоДокументам = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетОсновныхНачислений.СоздатьНаборЗаписей();
	ПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.Использование	= Истина;
	ПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения  	= ВидСравнения.Равно;
	
	ДопПерерасчетыСотрудниковПоДокументам = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетДополнительныхНачислений.СоздатьНаборЗаписей();
	ДопПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	ДопПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения  = ВидСравнения.Равно;
	
	СредПерерасчетыСотрудниковПоДокументам = РегистрыРасчета.РасчетСреднегоЗаработка.Перерасчеты.ПерерасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	СредПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	СредПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения  = ВидСравнения.Равно;
	
	МассивСотрудников =  Новый Массив;
	
	// для цепочки исправленных документов удалим записи перерасчетов по исправленным 
	// в переданном документе сотрудникам
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		МассивСотрудников.Очистить();
		
		Документ 	    = ВыборкаПоДокументам.ОбъектПерерасчета;
		ТипРегистратора = ТипЗнч(Документ);
		
		ВыборкаПоСотрудникам = ВыборкаПоДокументам.Выбрать();
		
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
			МассивСотрудников.Добавить(ВыборкаПоСотрудникам.Сотрудник);	
		КонецЦикла;
		
		Если ПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
			
			ПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.Значение 	= Документ;
			ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение 				= Документ;
			ПерерасчетыПоДокументам.Прочитать();
			Для Каждого Запись Из ПерерасчетыПоДокументам Цикл
				Если МассивСотрудников.Найти(Запись.Сотрудник) Тогда
					ЗаполнитьЗначенияСвойств(ПерерасчетыСотрудниковПоДокументам.Добавить(), Запись);
				КонецЕсли;
			КонецЦикла;
			ПерерасчетыСотрудниковПоДокументам.Записать();
			ПерерасчетыСотрудниковПоДокументам.Очистить();
			
		КонецЕсли;
		
		Если ДопПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
			
			ДопПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.Значение  = Документ;
			ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение 			= Документ;
			ДопПерерасчетыПоДокументам.Прочитать();
			Для Каждого Запись Из ДопПерерасчетыПоДокументам Цикл
				Если МассивСотрудников.Найти(Запись.Сотрудник) Тогда
					ЗаполнитьЗначенияСвойств(ДопПерерасчетыСотрудниковПоДокументам.Добавить(), Запись);
				КонецЕсли;
			КонецЦикла;
			ДопПерерасчетыСотрудниковПоДокументам.Записать();
			ДопПерерасчетыСотрудниковПоДокументам.Очистить();
			
		КонецЕсли;
		
		Если СредПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
			
			СредПерерасчетыСотрудниковПоДокументам.Отбор.ОбъектПерерасчета.Значение = Документ;
			СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение  			= Документ;
			СредПерерасчетыПоДокументам.Прочитать();
			Для Каждого Запись Из СредПерерасчетыПоДокументам Цикл
				Если МассивСотрудников.Найти(Запись.Сотрудник) Тогда
					ЗаполнитьЗначенияСвойств(СредПерерасчетыСотрудниковПоДокументам.Добавить(), Запись);
				КонецЕсли;
			КонецЦикла;
			СредПерерасчетыСотрудниковПоДокументам.Записать();
			СредПерерасчетыСотрудниковПоДокументам.Очистить();
	
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьДанныеПоОрганизации();
	
КонецПроцедуры	


мПодразделенияДокументы = Новый Соответствие;
мРаботникиДокументы 	= Новый Соответствие;
