
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//НаборЗаписей = РегистрыСведений.УчетОсновногоЗаработкаРаботниковПодразделенияОрганизации.СоздатьНаборЗаписей();
	Список.Параметры.УстановитьЗначениеПараметра("Организация",ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	Список.Параметры.УстановитьЗначениеПараметра("ПодразделениеОрганизации",ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	Если Параметры.Свойство("ПодразделениеОрганизации") Тогда
		//ЭлементОтбора = НаборЗаписей.Отбор.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеОрганизации");
		//ЭлементОтбора.ПравоеЗначение = Параметры.ПодразделениеОрганизации;
		//ЭлементОтбора.Использование = Истина;
		Список.Параметры.УстановитьЗначениеПараметра("ПодразделениеОрганизации",Параметры.ПодразделениеОрганизации);
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		//ЭлементОтбора = НаборЗаписей.Отбор.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		//ЭлементОтбора.ПравоеЗначение = Параметры.Организация;
		//ЭлементОтбора.Использование = Истина;
		Список.Параметры.УстановитьЗначениеПараметра("Организация",Параметры.Организация);
	КонецЕсли;
	
	Если Параметры.Свойство("ОрганизацияДоступность") Тогда
		Элементы.Организация.Доступность = Ложь;
	КонецЕсли;
	Если Параметры.Свойство("ПодразделениеОрганизацииДоступность") Тогда
		Элементы.ПодразделениеОрганизации.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
