
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("БИК") Тогда
		Объект.БИК = Параметры.БИК;
	КонецЕсли;
	Если Параметры.Свойство("БИКДоРеформыБанковскихСчетов") Тогда
		Объект.БИКДоРеформыБанковскихСчетов = Параметры.БИКДоРеформыБанковскихСчетов;
	КонецЕсли;
	Если Параметры.Свойство("Наименование") Тогда
		Объект.Наименование = Параметры.Наименование;
	КонецЕсли;
	Если Параметры.Свойство("Город") Тогда
		Объект.Город = Параметры.Город;
	КонецЕсли;
	Если Параметры.Свойство("КодВПлатежнойСистеме") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистеме) Тогда
			Объект.КодВПлатежнойСистеме = Параметры.КодВПлатежнойСистеме;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("КодВПлатежнойСистемеДоРеформыБанковскихСчетов") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов) Тогда
			Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов = Параметры.КодВПлатежнойСистемеДоРеформыБанковскихСчетов;
		КонецЕсли;
	КонецЕсли;
		
	оф_РеквизитыЭППЗаголовок = "Реквизиты электронного платежного поручения";
	оф_КонтактнаяИнформацияЗаголовок = "Контактная информация";	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Процедура - обработчик события "ПриИзменении" поля ввода "БИК"
//
&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистеме) Тогда
		Объект.КодВПлатежнойСистеме = УправлениеДенежнымиСредствами.ПолучитьКодБанкаВПлатежнойСистеме(Объект.БИК);
	КонецЕсли;	
КонецПроцедуры // БИКПриИзменении

// Процедура - обработчик события "ПриИзменении" поля ввода "БИКДоРеформыБанковскихСчетов"
//
&НаКлиенте
Процедура БИКДоРеформыБанковскихСчетовПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов) Тогда
		Объект.КодВПлатежнойСистемеДоРеформыБанковскихСчетов = УправлениеДенежнымиСредствами.ПолучитьКодБанкаВПлатежнойСистеме(Объект.БИКДоРеформыБанковскихСчетов);
	КонецЕсли;	
КонецПроцедуры // БИКДоРеформыБанковскихСчетовПриИзменении

// Процедура - обработчик события "Нажатия" кнопки проверки РНН
//
&НаКлиенте
Процедура КнопкаПроверкиРНННажатие(Элемент)
	Если ОбщегоНазначения.РННСоответствуетТребованиям(Объект.РНН) Тогда
		Предупреждение("Введенный РНН корректен!");
	КонецЕсли;
КонецПроцедуры // КнопкаПроверкиРНННажатие()

// Процедура - обработчик события "Нажатия" кнопки проверки БИН
//
&НаКлиенте
Процедура КнопкаПроверкиБИННажатие(Элемент)
	Если ОбщегоНазначения.БИНИИНСоответствуетТребованиям(Объект.ИдентификационныйНомер) Тогда
		Предупреждение("Введенный БИН корректен!");
	КонецЕсли;
КонецПроцедуры // КнопкаПроверкиРНННажатие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//Процедура- обработчик события "ПриЗакрытии" формы
//
&НаКлиенте
Процедура ПриЗакрытии()
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда
		ОповеститьОВыборе(Объект.Контрагент);
	КонецЕсли; 
КонецПроцедуры
