
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ФинансовыйПоказатель") Тогда
		ФинансовыйПоказатель = Параметры.ФинансовыйПоказатель;
		ЗаполнитьДанные();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанные() 
	
	Правила.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_ПравилаОтраженияФактическихДанных.Владелец КАК ОбъектИнформационнойБазы,
		|	фин_ПравилаОтраженияФактическихДанных.Ссылка КАК Правило,
		|	фин_ПериодыПримененияПравилПоФинансовымПоказателям.ДатаНачала,
		|	фин_ПериодыПримененияПравилПоФинансовымПоказателям.ДатаОкончания
		|ИЗ
		|	Справочник.фин_ПравилаОтраженияФактическихДанных КАК фин_ПравилаОтраженияФактическихДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.фин_ПериодыПримененияПравилПоФинансовымПоказателям КАК фин_ПериодыПримененияПравилПоФинансовымПоказателям
		|		ПО фин_ПравилаОтраженияФактическихДанных.Ссылка = фин_ПериодыПримененияПравилПоФинансовымПоказателям.Правило
		|ГДЕ
		|	фин_ПравилаОтраженияФактическихДанных.ФинансовыйПоказательИсточник = &ФинансовыйПоказательИсточник
		|	И фин_ПравилаОтраженияФактическихДанных.ФинансовыйПоказательТипИсточника = &ФинансовыйПоказательТипИсточника
		|	И фин_ПравилаОтраженияФактическихДанных.ПометкаУдаления = ЛОЖЬ
		|	И фин_ПравилаОтраженияФактическихДанных.ПоФинансовомуПоказателю";
	
	Запрос.УстановитьПараметр("ФинансовыйПоказательИсточник", ФинансовыйПоказатель);
	Запрос.УстановитьПараметр("ФинансовыйПоказательТипИсточника", Перечисления.фин_ТипыИсточниковОтраженияПервичныхДвижений.ФиксированноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НС = Правила.Добавить();
		ЗаполнитьЗначенияСвойств(НС,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фин_ПравилаОтраженияФактическихДанных.Ссылка КАК Правило
		|ИЗ
		|	Справочник.фин_ПравилаОтраженияФактическихДанных КАК фин_ПравилаОтраженияФактическихДанных
		|ГДЕ
		|	фин_ПравилаОтраженияФактическихДанных.ФинансовыйПоказательИсточник = &ФинансовыйПоказательИсточник
		|	И фин_ПравилаОтраженияФактическихДанных.ФинансовыйПоказательТипИсточника = &ФинансовыйПоказательТипИсточника
		|	И фин_ПравилаОтраженияФактическихДанных.ПометкаУдаления = ЛОЖЬ
		|	И фин_ПравилаОтраженияФактическихДанных.ПоФинансовомуПоказателю";
	
	Запрос.УстановитьПараметр("ФинансовыйПоказательИсточник", ФинансовыйПоказатель);
	Запрос.УстановитьПараметр("ФинансовыйПоказательТипИсточника", Перечисления.фин_ТипыИсточниковОтраженияПервичныхДвижений.ФиксированноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор = РегистрыСведений.фин_ПериодыПримененияПравилПоФинансовымПоказателям.СоздатьНаборЗаписей();
		Набор.Отбор.Правило.Установить(ВыборкаДетальныеЗаписи.Правило);
		СтрокиПрименения = Правила.НайтиСтроки(Новый структура("Правило",ВыборкаДетальныеЗаписи.Правило));
		Если СтрокиПрименения.Количество()>0 Тогда
			Если СтрокиПрименения[0].ДатаНачала<>'00010101' Тогда
				НЗ = Набор.Добавить();
				ЗаполнитьЗначенияСвойств(НЗ,СтрокиПрименения[0]);
			КонецЕсли;
		КонецЕсли;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть();
КонецПроцедуры
