
// Процедура обновляет заголовок формы по выбранному 
//  владельцу справочника
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Нет.
//
&НаКлиенте
Процедура ОбновитьЗаголовок()
	ЭтаФорма.Заголовок = "Список подразделений организации " + Организация;
КонецПроцедуры // ОбновитьЗаголовок()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ЗНАЧЕНИЙ РЕКВИЗИТОВ ШАПКИ

// обновляем заголовок формы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьЗаголовок();
	Список.Параметры.УстановитьЗначениеПараметра("Владелец", Организация);
	Дерево.Параметры.УстановитьЗначениеПараметра("Владелец", Организация)
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ, ОБЩИХ ДЛЯ ВСЕЙ ФОРМЫ
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Организация.Пустая() Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяОрганизация");
	КонецЕсли;
	ОбновитьЗаголовок();
	// Проверка ведения однофирменности
	Элементы.Организация.ТолькоПросмотр = НЕ УчетПоВсемОрганизациям;
    Список.Параметры.УстановитьЗначениеПараметра("Владелец", организация);
	Дерево.Параметры.УстановитьЗначениеПараметра("Владелец", организация);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// проставляем организацию пользователя по умолчанию
	Если Параметры.Свойство("ВыборПоВладельцу") Тогда
		Организация = Параметры.ВыборПоВладельцу;
	КонецЕсли;
	Если Параметры.Свойство("ОтборПоВладельцу") Тогда
		Организация = Параметры.ОтборПоВладельцу;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	Список.Отбор.Элементы.Очистить();
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.текущиеДанные.Свойство("Ссылка") тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
			ЭлементОтбора.ПравоеЗначение = Элемент.ТекущиеДанные.Ссылка;
			ЭлементОтбора.Использование = Истина;
		конецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.ТекущиеДанные.РодительскаяГруппировкаСтроки = Неопределено Тогда
		Отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	Параметрыформы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец",Организация);
	ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаОбъекта",параметрыформы,Этаформа);
КонецПроцедуры



