
Процедура ВидыКультурПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомбинацииКультурКультуры.Ссылка
		|ИЗ
		|	Справочник.КомбинацииКультур.Культуры КАК КомбинацииКультурКультуры
		|ГДЕ
		|	КомбинацииКультурКультуры.Культура = &Культура
		|
		|СГРУППИРОВАТЬ ПО
		|	КомбинацииКультурКультуры.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомбинацииПродуктовПереработкиПродуктыПереработки.Ссылка
		|ИЗ
		|	Справочник.КомбинацииПродуктовПереработки.ПродуктыПереработки КАК КомбинацииПродуктовПереработкиПродуктыПереработки
		|ГДЕ
		|	КомбинацииПродуктовПереработкиПродуктыПереработки.ПродуктПереработки = &Культура
		|
		|СГРУППИРОВАТЬ ПО
		|	КомбинацииПродуктовПереработкиПродуктыПереработки.Ссылка";

	Запрос.УстановитьПараметр("Культура", источник.ссылка);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Спр = ВыборкаДетальныеЗаписи.ссылка.получитьОбъект();
		Спр.Записать();
	КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
