
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Адрес") Тогда
		ДанныеХранилища = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		Объект.Связи.Загрузить(ДанныеХранилища.Связи);
		Объект.ЭлементыСвязи.Загрузить(ДанныеХранилища.ЭлементыСвязи);
		ПостроитьКарту();
	КонецЕсли;
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПостроитьКарту()
   	фин_Защита.ПостроитьСхемуСвязей(ТабличныйДокумент,Объект.ЭлементыСвязи,Объект.Связи);
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	Попытка
		ПоказатьЗначение(,Область.Значение);
	Исключение
	КонецПопытки;
КонецПроцедуры

