
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект,  ЦС_ОбщегоНазначенияКлиентСерверПовтИсп.ТекущийПользователь(), , ,  , ,);		
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	если ОбменДанными.Загрузка тогда 
		Возврат
	КонецЕсли;
	СуммаДокумента = РасчетнаяТаблица.Итог("КонтрольнаяСумма");
	ПериодПланирования = НачалоГода(ПериодПланирования);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦС_ПланыГЗ 
	Для Каждого ТекСтрокаРасчетнаяТаблица Из РасчетнаяТаблица Цикл
		Движение = Движения.ЦС_ПланыГЗ.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.НоменклатураГЗ = ТекСтрокаРасчетнаяТаблица.НоменклатураГосЗакупа;
		Движение.ПериодПланирования = ПериодПланирования;
		Движение.Количество = ТекСтрокаРасчетнаяТаблица.ОбъемЗакупаВНатуральномВыражении;
		Движение.Сумма = ТекСтрокаРасчетнаяТаблица.КонтрольнаяСумма;
	КонецЦикла;
	Движения.ЦС_ПланыГЗ.Записывать = Истина;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////
//// ПЕРЕМЕННЫЕ МОДУЛЯ

//Перем мВалютаРегламентированногоУчета Экспорт;

//#Если Клиент Тогда
//	
//// Функция формирует табличный документ 
////
//// Параметры: 
////  Нет.
////
//// Возвращаемое значение:
////  Табличный документ по форме З-8.
////
//Функция Печатьтаблицы(ТабДокумент,имяМакета)
//	
//	Запрос = Новый Запрос;
//	ЗапросКСтатьям = Новый Запрос;
//	ЗапросМасло = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	Организация,
//	|	б_РасчетнаяТаблица.ФормируемыйБюджет КАК ФормируемыйБюджет,
//	|	б_РасчетнаяТаблица.Сценарий КАК Сценарий,
//	|	б_РасчетнаяТаблица.СтатьяБюджета КАК СтатьяБюджета,
//	|	б_РасчетнаяТаблица.ПериодПланирования КАК ПериодПланирования
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица КАК б_РасчетнаяТаблица
//	|ГДЕ
//	|	б_РасчетнаяТаблица.ссылка = &ТекущийДокумент
//	|";
//	
//	ЗапросШапка = Запрос.Выполнить().Выбрать();
//	
//	ЗапросШапка.Следующий();
//	
//	СписокВидовАмортизация = новый СписокЗначений;
//	СписокВидовАмортизация.Добавить(Перечисления.б_ВидыРасчетныхТаблиц.АмортизацияНМА);
//	СписокВидовАмортизация.Добавить(Перечисления.б_ВидыРасчетныхТаблиц.АмортизацияОС);
//	
// 	ЗапросКСтатьям.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
//	ЗапросКСтатьям.УстановитьПараметр("СписокВидовАмортизация", СписокВидовАмортизация);
//	ЗапросКСтатьям.Текст =
//	"ВЫБРАТЬ
//	|	б_РасчетнаяТаблица.НомерСтроки,
//	|	ВЫБОР
//	|		КОГДА б_РасчетнаяТаблица.Ссылка.ВидРасчетнойТаблицы В (&СписокВидовАмортизация)
//	|			ТОГДА б_РасчетнаяТаблица.ОС
//	|		ИНАЧЕ б_РасчетнаяТаблица.Номенклатура
//	|	КОНЕЦ КАК Номенклатура,
//	|	б_РасчетнаяТаблица.СтатьяБюджета,
//	|	б_РасчетнаяТаблица.ОС,
//	|	б_РасчетнаяТаблица.арЦена,
//	|	б_РасчетнаяТаблица.арКоличествоШтатныхЕдиниц,
//	|	б_РасчетнаяТаблица.арКоличествоКвМетровНаЧеловека,
//	|	б_РасчетнаяТаблица.комДолжность,
//	|	б_РасчетнаяТаблица.комЦельКомандировки,
//	|	б_РасчетнаяТаблица.комКоличествоЧеловек,
//	|	б_РасчетнаяТаблица.комКоличествоКомандировок,
//	|	б_РасчетнаяТаблица.комКоличествоДней,
//	|	б_РасчетнаяТаблица.комСрокКомандировки,
//	|	б_РасчетнаяТаблица.комПроезд,
//	|	б_РасчетнаяТаблица.комПроживание,
//	|	б_РасчетнаяТаблица.комСуточные,
//	|	б_РасчетнаяТаблица.НормаРасходаВДень,
//	|	б_РасчетнаяТаблица.кЧислоДнейМесяца,
//	|	б_РасчетнаяТаблица.ктариф,
//	|	б_РасчетнаяТаблица.НормаРасходаНа100КмВЛетнееВремя,
//	|	б_РасчетнаяТаблица.НормаРасходаНа100КмВЗимнееВремя,
//	|	б_РасчетнаяТаблица.ПробегВДень,
//	|	б_РасчетнаяТаблица.ЧислоДнейМесяца,
//	|	б_РасчетнаяТаблица.ЦенаЗаЛитр,
//	|	б_РасчетнаяТаблица.Количество,
//	|	б_РасчетнаяТаблица.Цена,
//	|	б_РасчетнаяТаблица.Сумма КАК Сумма,
//	|	б_РасчетнаяТаблица.КонтрольнаяСумма КАК КонтрольнаяСумма,
//	|	б_РасчетнаяТаблица.Сумма1 КАК Сумма1,
//	|	б_РасчетнаяТаблица.Сумма2 КАК Сумма2,
//	|	б_РасчетнаяТаблица.Сумма3 КАК Сумма3,
//	|	б_РасчетнаяТаблица.Сумма4 КАК Сумма4,
//	|	б_РасчетнаяТаблица.Сумма5 КАК Сумма5,
//	|	б_РасчетнаяТаблица.Сумма6 КАК Сумма6,
//	|	б_РасчетнаяТаблица.Сумма7 КАК Сумма7,
//	|	б_РасчетнаяТаблица.Сумма8 КАК Сумма8,
//	|	б_РасчетнаяТаблица.Сумма9 КАК Сумма9,
//	|	б_РасчетнаяТаблица.Сумма10 КАК Сумма10,
//	|	б_РасчетнаяТаблица.Сумма11 КАК Сумма11,
//	|	б_РасчетнаяТаблица.Сумма12 КАК Сумма12,
//	|	б_РасчетнаяТаблица.Сумма1 + б_РасчетнаяТаблица.Сумма2 + б_РасчетнаяТаблица.Сумма3 КАК Сумма1кв,
//	|	б_РасчетнаяТаблица.Сумма4 + б_РасчетнаяТаблица.Сумма5 + б_РасчетнаяТаблица.Сумма6 КАК Сумма2кв,
//	|	б_РасчетнаяТаблица.Сумма7 + б_РасчетнаяТаблица.Сумма8 + б_РасчетнаяТаблица.Сумма9 КАК Сумма3кв,
//	|	б_РасчетнаяТаблица.Сумма10 + б_РасчетнаяТаблица.Сумма11 + б_РасчетнаяТаблица.Сумма12 КАК Сумма4кв,
//	|	б_РасчетнаяТаблица.Сумма1 + б_РасчетнаяТаблица.Сумма2 + б_РасчетнаяТаблица.Сумма3 + б_РасчетнаяТаблица.Сумма4 + б_РасчетнаяТаблица.Сумма5 + б_РасчетнаяТаблица.Сумма6 КАК СуммаПолугодие,
//	|	б_РасчетнаяТаблица.Сумма1 + б_РасчетнаяТаблица.Сумма2 + б_РасчетнаяТаблица.Сумма3 + б_РасчетнаяТаблица.Сумма4 + б_РасчетнаяТаблица.Сумма5 + б_РасчетнаяТаблица.Сумма6 + б_РасчетнаяТаблица.Сумма7 + б_РасчетнаяТаблица.Сумма8 + б_РасчетнаяТаблица.Сумма9 КАК СуммаДевятьМесяцев,
//	|	б_РасчетнаяТаблица.ФИООбучаемого
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК б_РасчетнаяТаблица
//	|ГДЕ
//	|	б_РасчетнаяТаблица.Ссылка = &ТекущийДокумент
//	|	И (б_РасчетнаяТаблица.Сумма1 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма2 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма3 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма4 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма5 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма6 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма7 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма8 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма9 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма10 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма11 <> 0
//	|			ИЛИ б_РасчетнаяТаблица.Сумма12 <> 0)
//	|ИТОГИ
//	|	СУММА(Сумма),
//	|	СУММА(КонтрольнаяСумма),
//	|	СУММА(Сумма1),
//	|	СУММА(Сумма2),
//	|	СУММА(Сумма3),
//	|	СУММА(Сумма4),
//	|	СУММА(Сумма5),
//	|	СУММА(Сумма6),
//	|	СУММА(Сумма7),
//	|	СУММА(Сумма8),
//	|	СУММА(Сумма9),
//	|	СУММА(Сумма10),
//	|	СУММА(Сумма11),
//	|	СУММА(Сумма12),
//	|	СУММА(Сумма1кв),
//	|	СУММА(Сумма2кв),
//	|	СУММА(Сумма3кв),
//	|	СУММА(Сумма4кв),
//	|	СУММА(СуммаПолугодие),
//	|	СУММА(СуммаДевятьМесяцев)
//	|ПО
//	|	ОБЩИЕ";	
//	
//	Результат = ЗапросКСтатьям.Выполнить();
//	
// 	ЗапросМасло.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
//	
//	ЗапросМасло.Текст =
//	"ВЫБРАТЬ
//	|		б_РасчетнаяТаблица.НомерСтроки,
//	|		б_РасчетнаяТаблица.Номенклатура,
//	|		б_РасчетнаяТаблица.ОС,
//	|		б_РасчетнаяТаблица.Количество,
//	|		б_РасчетнаяТаблица.НормаРасходаНа100КмВЛетнееВремя,
//	|		б_РасчетнаяТаблица.НормаРасходаНа100КмВЗимнееВремя,
//	|		б_РасчетнаяТаблица.ЦенаЗалитр,
//	|		б_РасчетнаяТаблица.КонтрольнаяСумма,
//	|		б_РасчетнаяТаблица.Сумма1,
//	|		б_РасчетнаяТаблица.Сумма2,
//	|		б_РасчетнаяТаблица.Сумма3,
//	|		б_РасчетнаяТаблица.Сумма4,
//	|		б_РасчетнаяТаблица.Сумма5,
//	|		б_РасчетнаяТаблица.Сумма6,
//	|		б_РасчетнаяТаблица.Сумма7,
//	|		б_РасчетнаяТаблица.Сумма8,
//	|		б_РасчетнаяТаблица.Сумма9,
//	|		б_РасчетнаяТаблица.Сумма10,
//	|		б_РасчетнаяТаблица.Сумма11,
//	|		б_РасчетнаяТаблица.Сумма12,
//	|		б_РасчетнаяТаблица.Сумма1+б_РасчетнаяТаблица.Сумма2+б_РасчетнаяТаблица.Сумма3 КАК Сумма1кв,
//	|		б_РасчетнаяТаблица.Сумма4+б_РасчетнаяТаблица.Сумма5+б_РасчетнаяТаблица.Сумма6 КАК Сумма2кв,
//	|		б_РасчетнаяТаблица.Сумма7+б_РасчетнаяТаблица.Сумма7+б_РасчетнаяТаблица.Сумма9 КАК Сумма3кв,
//	|		б_РасчетнаяТаблица.Сумма10+б_РасчетнаяТаблица.Сумма11+б_РасчетнаяТаблица.Сумма12 КАК Сумма4кв,
//	|		б_РасчетнаяТаблица.Сумма1+б_РасчетнаяТаблица.Сумма2+б_РасчетнаяТаблица.Сумма3+б_РасчетнаяТаблица.Сумма4+б_РасчетнаяТаблица.Сумма5+б_РасчетнаяТаблица.Сумма6 КАК СуммаПолугодие,
//	|		б_РасчетнаяТаблица.Сумма1+б_РасчетнаяТаблица.Сумма2+б_РасчетнаяТаблица.Сумма3+б_РасчетнаяТаблица.Сумма4+б_РасчетнаяТаблица.Сумма5+б_РасчетнаяТаблица.Сумма6+б_РасчетнаяТаблица.Сумма7+б_РасчетнаяТаблица.Сумма7+б_РасчетнаяТаблица.Сумма9 КАК СуммаДевятьМесяцев
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблицаМасло КАК б_РасчетнаяТаблица
//	|ГДЕ
//	|	б_РасчетнаяТаблица.ссылка = &ТекущийДокумент
//	|Итоги 	
//	|		Сумма(КонтрольнаяСумма),
//	|		Сумма(Сумма1кв),
//	|		Сумма(Сумма2кв),
//	|		Сумма(Сумма3кв),
//	|		Сумма(Сумма4кв),
//	|		Сумма(СуммаПолугодие),
//	|		Сумма(СуммаДевятьМесяцев),
//	|		Сумма(Сумма1),
//	|		Сумма(Сумма2),
//	|		Сумма(Сумма3),
//	|		Сумма(Сумма4),
//	|		Сумма(Сумма5),
//	|		Сумма(Сумма6),
//	|		Сумма(Сумма7),
//	|		Сумма(Сумма8),
//	|		Сумма(Сумма9),
//	|		Сумма(Сумма10),
//	|		Сумма(Сумма11),
//	|		Сумма(Сумма12)
//	|ПО Общие
//	|";	
//	
//	РезультатМасло = ЗапросМасло.Выполнить();
//	
//	Макет = ПолучитьМакет(ИмяМакета);
//	
//	// Зададим параметры макета
//	ТабДокумент.ПолеСверху         = 0;
//	ТабДокумент.ПолеСлева          = 10;
//	ТабДокумент.ПолеСнизу          = 0;
//	ТабДокумент.ПолеСправа         = 0;
//	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//	
//	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасчетнаяТаблица";
//	
//	// Выводим шапку накладной
//	Отбор = СокрЛП(ЗапросШапка.СтатьяБюджета.КодСтрокиБюджета)+" :"+СокрЛП(ЗапросШапка.СтатьяБюджета);
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
//	ОбластьМакета.Параметры.ТекстЗаголовка = СокрЛП(ЗапросШапка.ФормируемыйБюджет)+" :"+ДополнительныеПоБюджетированию.ПолучитьНадписьПериодаСтрокой(ЗапросШапка.ПериодПланирования,ЗапросШапка.Сценарий);
//	ОбластьМакета.Параметры.Отбор = Отбор;
//	
//	ТабДокумент.Вывести(ОбластьМакета);

//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
//	ТабДокумент.Вывести(ОбластьМакета);
//	
//	ВыборкаОбщийИтог = РЕзультат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Общие");
//	ВыборкаОбщийИтог.Следующий();
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
//	
//	Выборка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	Пока Выборка.Следующий() Цикл
//		ОбластьМакета.Параметры.Заполнить(Выборка);
//		ТабДокумент.Вывести(ОбластьМакета);
//	КонецЦикла;
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
//	ОбластьМакета.Параметры.Заполнить(ВыборкаОбщийИтог);
//	
//	ТабДокумент.Вывести(ОбластьМакета);
//	
//	
//	Если ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ГСМ Тогда
//		// Выводим шапку накладной
//		Отбор = СокрЛП(ЗапросШапка.СтатьяБюджета.КодСтрокиБюджета)+" :"+СокрЛП(ЗапросШапка.СтатьяБюджета)+" Масло";
//		
//		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок1");
//		ОбластьМакета.Параметры.ТекстЗаголовка = СокрЛП(ЗапросШапка.ФормируемыйБюджет)+" :"+ДополнительныеПоБюджетированию.ПолучитьНадписьПериодаСтрокой(ЗапросШапка.ПериодПланирования,ЗапросШапка.Сценарий);
//		ОбластьМакета.Параметры.Отбор = Отбор;
//		
//		ТабДокумент.Вывести(ОбластьМакета);
//		
//		ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
//		ТабДокумент.Вывести(ОбластьМакета);
//		
//		ВыборкаОбщийИтог = РезультатМасло.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Общие");
//		ВыборкаОбщийИтог.Следующий();
//		
//		ОбластьМакета = Макет.ПолучитьОбласть("Строка1");
//		
//		Выборка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//		Пока Выборка.Следующий() Цикл
//			ОбластьМакета.Параметры.Заполнить(Выборка);
//			ТабДокумент.Вывести(ОбластьМакета);
//		КонецЦикла;
//		
//		ОбластьМакета = Макет.ПолучитьОбласть("Итог1");
//		ОбластьМакета.Параметры.Заполнить(ВыборкаОбщийИтог);
//		
//		ТабДокумент.Вывести(ОбластьМакета);
//	Конецесли;
//	
//	
//	
//	Возврат ТабДокумент;

//КонецФункции // ПечатьБронирование()

//Функция ПечатьтаблицыПовышениеКвалификации(ТабДокумент,имяМакета)
//	
//	Запрос = Новый Запрос;
//	ЗапросКСтатьям = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	Организация,
//	|	б_РасчетнаяТаблица.ФормируемыйБюджет КАК ФормируемыйБюджет,
//	|	б_РасчетнаяТаблица.Сценарий КАК Сценарий,
//	|	б_РасчетнаяТаблица.СтатьяБюджета КАК СтатьяБюджета,
//	|	б_РасчетнаяТаблица.ПериодПланирования КАК ПериодПланирования
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица КАК б_РасчетнаяТаблица
//	|ГДЕ
//	|	б_РасчетнаяТаблица.ссылка = &ТекущийДокумент
//	|";
//	
//	ЗапросШапка = Запрос.Выполнить().Выбрать();
//	
//	ЗапросШапка.Следующий();
//	
//	
// 	ЗапросКСтатьям.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
//	
//	ЗапросКСтатьям.Текст =
//	"ВЫБРАТЬ
//	|	б_РасчетнаяТаблица.Номенклатура,
//	|	б_РасчетнаяТаблица.пвНаименованиеСеминара,
//	|	б_РасчетнаяТаблица.пвМестоПроведения,
//	|	б_РасчетнаяТаблица.пвКонтрагент,
//	|	б_РасчетнаяТаблица.пвМесяцПроведения,
//	|	б_РасчетнаяТаблица.пвПодразделение КАК Подразделение,
//	|	б_РасчетнаяТаблица.комДолжность,
//	|	б_РасчетнаяТаблица.ФИООбучаемого,
//	|	б_РасчетнаяТаблица.комКоличествоДней,
//	|	б_РасчетнаяТаблица.пвПериодПроведения,
//	|	б_РасчетнаяТаблица.КонтрольнаяСумма КАК КонтрольнаяСумма
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК б_РасчетнаяТаблица
//	|ГДЕ
//	|	б_РасчетнаяТаблица.Ссылка = &ТекущийДокумент
//	|ИТОГИ
//	|	СУММА(КонтрольнаяСумма)
//	|ПО
//	|	ОБЩИЕ,
//	|	Подразделение";	
//	
//	Результат = ЗапросКСтатьям.Выполнить();
//	
//	Макет = ПолучитьМакет(ИмяМакета);
//	
//	// Зададим параметры макета
//	ТабДокумент.ПолеСверху         = 0;
//	ТабДокумент.ПолеСлева          = 10;
//	ТабДокумент.ПолеСнизу          = 0;
//	ТабДокумент.ПолеСправа         = 0;
//	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//	
//	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасчетнаяТаблица";
//	
//	// Выводим шапку накладной
//	Отбор = СокрЛП(ЗапросШапка.СтатьяБюджета.КодСтрокиБюджета)+" :"+СокрЛП(ЗапросШапка.СтатьяБюджета);
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
//	ОбластьМакета.Параметры.ТекстЗаголовка = СокрЛП(ЗапросШапка.ФормируемыйБюджет)+" :"+ДополнительныеПоБюджетированию.ПолучитьНадписьПериодаСтрокой(ЗапросШапка.ПериодПланирования,ЗапросШапка.Сценарий);
//	ОбластьМакета.Параметры.Отбор = Отбор;
//	
//	ТабДокумент.Вывести(ОбластьМакета);

//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
//	ТабДокумент.Вывести(ОбластьМакета);
//	
//	ВыборкаОбщийИтог = РЕзультат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Общие");
//	ВыборкаОбщийИтог.Следующий();
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
//	ОбластьМакетаПодразделение = Макет.ПолучитьОбласть("Подразделение");
//	
//	ВыборкаПодразделение = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	Пока ВыборкаПодразделение.Следующий() Цикл
//		ОбластьМакетаПодразделение.Параметры.Заполнить(ВыборкаПодразделение);
//		ТабДокумент.Вывести(ОбластьМакетаПодразделение);
//		
//		Выборка = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//		Пока Выборка.Следующий() Цикл
//			ОбластьМакета.Параметры.Заполнить(Выборка);
//			ТабДокумент.Вывести(ОбластьМакета);
//		КонецЦикла;
//	КонецЦикла;
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("Итог");
//	ОбластьМакета.Параметры.Заполнить(ВыборкаОбщийИтог);
//	
//	ТабДокумент.Вывести(ОбластьМакета);
//	
//	
//	Возврат ТабДокумент;

//КонецФункции // Печать()

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

//// Процедура осуществляет печать документа. Можно направить печать на 
//// экран или принтер, а также распечатать необходмое количество копий.
////
////  Название макета печати передается в качестве параметра,
//// по переданному названию находим имя макета в соответствии.
////
//// Параметры:
////  НазваниеМакета - строка, название макета.
////
//Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

//	Если ЭтоНовый() Тогда
//		Предупреждение("Документ можно распечатать только после его записи");
//		Возврат;
//	ИначеЕсли Не УправлениеПользователями.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
//		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
//		Возврат;
//	КонецЕсли;
//	
//	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
//		Возврат;
//	КонецЕсли;

//	// Получить экземпляр документа на печать
//	Если ИмяМакета = "Макет" Тогда
//		Если ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ГСМ  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ГСМ");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Командировочные  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"Командировочные");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ТМЦ  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ТМЦ");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ТМЦНаОС  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ТМЦНаОС");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Командировочные  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"Командировочные");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Аренда  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"Аренда");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Коммунальные  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"Коммунальные");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета
//			ИЛИ ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Зарплата Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ПоГруппеСтатейБюджета");
//		Иначе
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"Макет");
//		Конецесли;
//	ИначеЕсли ИмяМакета = "Квартал" Тогда
//		Если ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ГСМ  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ГСМКвартал");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Командировочные  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"КомандировочныеКвартал");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ТМЦ  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ТМЦКвартал");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ТМЦНаОС  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ТМЦНаОСКвартал");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Командировочные  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"КомандировочныеКвартал");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Аренда  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"АрендаКвартал");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Коммунальные  Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"КоммунальныеКвартал");
//		ИначеЕсли ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета
//			ИЛИ ВидРасчетнойТаблицы = Перечисления.б_ВидыРасчетныхТаблиц.Зарплата Тогда
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"ПоГруппеСтатейБюджетаКвартал");
//		Иначе
//			ТабДокумент = ПечатьТаблицы( Новый ТабличныйДокумент,"МакетКвартал");
//		Конецесли;
//	ИначеЕсли ИмяМакета = "ПовышениеКвалификации" Тогда
//			ТабДокумент = ПечатьТаблицыПовышениеКвалификации( Новый ТабличныйДокумент,"ПовышениеКвалификации");
//	КонецЕсли;

//	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()));
//																																					
//КонецПроцедуры // Печать

//#КонецЕсли

//Функция ПолучитьБазовыеСтатьи(ТекСтатья) экспорт
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("Конецпериода",КонецГода(периодПланирования));
//	Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//	Запрос.УстановитьПараметр("Бюджет",ФормируемыйБюджет);
//	Запрос.УстановитьПараметр("СтатьяБюджета",ТекСтатья);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	б_БазовыеВидыСтатейПоОплатеСрезПоследних.БазоваяСтатьяБюджета,
//	|	б_БазовыеВидыСтатейПоОплатеСрезПоследних.Ставка,
//	|	РасчетнаяТаблицаДоп.ПорядковыйНомерПоказателя КАК ПорядковыйНомерПоказателя
//	|ИЗ
//	|	РегистрСведений.б_БазовыеВидыСтатейПоОплате.СрезПоследних(&КонецПериода, бюджет = &Бюджет И СтатьяБюджета = &сТАТЬЯбЮДЖЕТА) КАК б_БазовыеВидыСтатейПоОплатеСрезПоследних
//	|Внутреннее Соединение
//	|	(ВЫБРАТЬ
//	|		РасчетнаяТаблица.СтатьяБюджета,
//	|		РасчетнаяТаблица.ПорядковыйНомерПоказателя КАК ПорядковыйНомерПоказателя
//	|	ИЗ
//	|   	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК РасчетнаяТаблица
//	|	ГДЕ
//	|   	РасчетнаяТаблица.ссылка = &ТекДокумент
//	|   )  РасчетнаяТаблицаДоп
//	|	ПО 
//	|   	РасчетнаяТаблицаДоп.СтатьяБюджета = б_БазовыеВидыСтатейПоОплатеСрезПоследних.БазоваяСтатьяБюджета
//	|";
//	
//	тз = Запрос.Выполнить().Выгрузить();
//	
//	Возврат тз;
//	
//КонецФункции

//Процедура РассчитатьФОТ(ТекущаяСтрокаРасчТаблицы) Экспорт
//	
//	ТекущаяСтрокаРасчТаблицы.СуммаФОТ = 0;
//	Для А = 1 по 12 Цикл
//		ТекущаяСтрокаРасчТаблицы.СуммаФОТ = ТекущаяСтрокаРасчТаблицы.СуммаФОТ + ТекущаяСтрокаРасчТаблицы["Сумма"+СокрЛП(А)];
//	КонецЦикла;
//КонецПроцедуры

//Процедура РассчитатьМатПомощь() Экспорт
//	
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("Конецпериода",КонецГода(периодПланирования));
//	Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//	Запрос.УстановитьПараметр("Бюджет",ФормируемыйБюджет);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	б_БазовыеВидыСтатейПоОплатеСрезПоследних.СтатьяБюджета,
//	|	б_БазовыеВидыСтатейПоОплатеСрезПоследних.Ставка,
//	|	РасчетнаяТаблицаДоп.ПорядковыйНомерПоказателя КАК ПорядковыйНомерПоказателя
//	|ИЗ
//	|	РегистрСведений.б_БазовыеВидыСтатейПоОплате.СрезПоследних(&КонецПериода, бюджет = &Бюджет ) КАК б_БазовыеВидыСтатейПоОплатеСрезПоследних
//	|
//	|Внутреннее Соединение
//	|	(ВЫБРАТЬ
//	|		РасчетнаяТаблица.СтатьяБюджета,
//	|		РасчетнаяТаблица.ПорядковыйНомерПоказателя КАК ПорядковыйНомерПоказателя
//	|	ИЗ
//	|   	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК РасчетнаяТаблица
//	|	ГДЕ
//	|   	РасчетнаяТаблица.ссылка = &ТекДокумент
//	|   )  РасчетнаяТаблицаДоп
//	|	ПО 
//	|   	РасчетнаяТаблицаДоп.СтатьяБюджета = б_БазовыеВидыСтатейПоОплатеСрезПоследних.СтатьяБюджета
//	|";
//	
//	Результат = Запрос.Выполнить().Выбрать();
//	
//	Пока Результат.Следующий() Цикл
//		ТекСтатья = Результат.СтатьяБюджета;
//		
//		тз = ПолучитьБазовыеСтатьи(ТекСтатья);
//		
//		Для Каждого СтрокаТЧ ИЗ Зарплата Цикл
//			СтрокаТЧ["Сумма"+Результат.ПорядковыйНомерПоказателя] = 0;
//			РасчСумма =0;
//			Для Каждого СтрокаТЗ из ТЗ Цикл
//				РасчСумма = РасчСумма + СтрокаТЧ["Сумма"+СтрокаТЗ.ПорядковыйНомерПоказателя]*СтрокаТЗ.Ставка/100;
//			КонецЦикла;
//			СтрокаТЧ["Сумма"+Результат.ПорядковыйНомерПоказателя] = РасчСумма;
//			РассчитатьФОТ(СтрокаТЧ);
//		КонецЦикла;
//		
//	КонецЦИкла;
//КонецПроцедуры

//Процедура ПерерасчетФОТ(ЭтотОбъект,Параметры) Экспорт
//	
//	//КоэффициентПерерасчета = Параметры.КоэффициентПерерасчета;
//	ПериодПерерасчета = Параметры.ПериодПерерасчета;
//	
//	Если ЗНАЧЕНИЕЗАПОЛНЕНО(ПериодПерерасчета) Тогда
//		
//		Для Каждого СтрокаТЧ ИЗ Зарплата Цикл
//			Если НЕ ЗНАЧЕНИЕЗАПОЛНЕНО(СтрокаТЧ.ДолжностнойОкладПлановый) Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			СтрокаТЧ.Сумма1 = (Месяц(ПериодПерерасчета)-1)*(СтрокаТЧ.КоличествоСтавок*СтрокаТЧ.ДолжностнойОклад)
//			+(13-Месяц(ПериодПерерасчета))*(СтрокаТЧ.КоличествоСтавок*СтрокаТЧ.ДолжностнойОкладПлановый);
//			
//			ДополнительныеПоБюджетированию.РассчитатьЗависимыеВиды(ЭтотОбъект,СтрокаТЧ,"Перерасчет");
//			
//			РассчитатьФОТ(СтрокаТЧ);		
//		КонецЦикла;
//		
//		РассчитатьМатПомощь();
//		
//		Для Каждого СтрокаТЧ ИЗ РасчетнаяТаблица Цикл
//			ГодоваяСумма = Зарплата.Итог("Сумма"+СокрЛП(СтрокаТЧ.ПорядковыйНомерПоказателя));
//			
//			СтрокаТЧ.КонтрольнаяСумма = ГодоваяСумма;
//			
//			ИсключаемаяСумма = 0;
//			
//			НомерМесяца = Месяц(ПериодПерерасчета);
//			
//			Для А =1 По НомерМесяца-1 Цикл
//				ИсключаемаяСумма = ИсключаемаяСумма + СтрокаТЧ["Сумма"+СокрЛП(А)];
//			КонецЦикла;
//			
//			РаспределяемаяСумма = ГодоваяСумма - ИсключаемаяСумма;
//			
//			РаспределеннаяСумма = 0;
//			
//			Для А=НомерМесяца По 12 Цикл
//				Если А = 12 Тогда
//					СтрокаТЧ["Сумма"+СокрЛП(А)]= РаспределяемаяСумма - РаспределеннаяСумма;
//				Иначе
//					СтрокаТЧ["Сумма"+СокрЛП(А)]= Окр(РаспределяемаяСумма /(12-НомерМесяца+1),0,1);
//					РаспределеннаяСумма = РаспределеннаяСумма + Окр(РаспределяемаяСумма /(12-НомерМесяца+1),0,1);
//				Конецесли;
//				
//			КонецЦикла;
//			
//		КонецЦикла;
//	КонецЕсли;
//	
//	
//КонецПроцедуры

//Функция ПолучитьВыборку()
//	
//	СписокСтатейБюджета = Новый Массив;
//	СписокСтатейБюджета.Добавить(СтатьяБюджета);
//	Если ВидРасчетнойТаблицы = перечисления.б_ВидыРасчетныхТаблиц.Зарплата Тогда
//		Для Каждого СтрокаТЧ из Налоги Цикл
//			СписокСтатейБюджета.Добавить(СтрокаТЧ.СтатьяБюджета);
//		КонецЦикла;
//	Конецесли;
//	
//	
//	
//	мСубконтоДоходы = Новый Массив;
//	мСубконтоДоходы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.Доходы);
//	
//	мСубконтоТипыОпераций = Новый Массив;
//	мСубконтоТипыОпераций.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.ТипыОпераций);
//	
//	мСубконтоСтатьиЗатрат = Новый Массив;
//	мСубконтоСтатьиЗатрат.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.СтатьиЗатрат);
//	
//	мСубконтоОС = Новый Массив;
//	мСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.ОсновныеСредства);
//	
//	мСубконтоНМА = Новый Массив;
//	мСубконтоНМА.Добавить(ПланыВидовХарактеристик.ВидыСубконтоТиповые.НематериальныеАктивы);
//	
//	мСписокСчетовПоставщиков = Новый Массив;
//	мСписокСчетовПоставщиков.Добавить(ПланыСчетов.Типовой.КраткосрочнаяКредиторскаяЗадолженность);
//	
//	Запрос = Новый Запрос;
//	
//	мНачГраница = Новый Граница(НачалоДня(НачалоГода(ПериодПланирования)), ВидГраницы.Включая);
//	мКонГраница = Новый Граница(КонецДня(КонецМесяца(Дата(Год(ПериодПланирования),Видкорректировки.НомерМесяца-1,1))), ВидГраницы.Включая);

//	Запрос.УстановитьПараметр("мСписокСчетовПоставщиков", мСписокСчетовПоставщиков);
//	Запрос.УстановитьПараметр("мСубконтоОС", мСубконтоОС);
//	Запрос.УстановитьПараметр("мСубконтоНМА", мСубконтоНМА);
//	Запрос.УстановитьПараметр("мСубконтоСтатьиЗатрат", мСубконтоСтатьиЗатрат);
//	Запрос.УстановитьПараметр("мСубконтоДоходы", мСубконтоДоходы);
//	Запрос.УстановитьПараметр("мСубконтоТипыОпераций", мСубконтоТипыОпераций);
//	Запрос.УстановитьПараметр("ФормируемыйБюджет", ФормируемыйБюджет);
//	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Перечисления.ПорядкиОкругленияОтчетности.Окр1);
//	Запрос.УстановитьПараметр("Статус", перечисления.СостоянияОбъектов.Утвержден);
//	Запрос.УстановитьПараметр("НачалоПериода", мНачГраница);
//	Запрос.УстановитьПараметр("КонецПериода", мКонГраница);
//	Запрос.УстановитьПараметр("СтатьяБюджета", СписокСтатейБюджета);
//	Запрос.УстановитьПараметр("Организация", Организация);
//	
//	Запрос.Текст =
//	
//	"ВЫБРАТЬ
//	|	СтатьиБюджета.Ссылка КАК СтатьяБюджета,
//	|	ВЫБОР
//	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
//	|			ТОГДА ЕстьNull(Сумма(ОборотыБУ.Сумма),0) / 1000000
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
//	|					ТОГДА ЕстьNull(Сумма(ОборотыБУ.Сумма),0) / 1000
//	|				ИНАЧЕ ЕстьNull(Сумма(ОборотыБУ.Сумма),0)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Сумма,
//	|	ВЫБОР
//	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
//	|			ТОГДА ЕстьNull(Сумма(ОборотыБУ.СуммаПлан),0) / 1000000
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
//	|					ТОГДА ЕстьNull(Сумма(ОборотыБУ.СуммаПлан),0) / 1000
//	|				ИНАЧЕ ЕстьNull(Сумма(ОборотыБУ.СуммаПлан),0)
//	|			КОНЕЦ
//	|	КОНЕЦ КАК СуммаПлан
//	|	ИЗ
//	|	Справочник.СтатьиБюджета КАК СтатьиБюджета
//	|	Левое Соединение
//	|		(ВЫБРАТЬ
//	|		б_СоответствияСтатейБюджетаСчетамБУ.СтатьяБюджета КАК СтатьяБюджета,
//	|		ЕстьNull(ТиповойОбороты.Организация,Значение(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|		ВЫБОР
//	|			КОГДА б_СоответствияСтатейБюджетаСчетамБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
//	|				ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаСчетамБУ.ПризнакСуммы
//	|			ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаСчетамБУ.ПризнакСуммы
//	|		КОНЕЦ КАК Сумма,
//	|		0 КАК СуммаПлан
//	|	ИЗ
//	|		РегистрСведений.б_СоответствияСтатейБюджетаСчетамБУ КАК б_СоответствияСтатейБюджетаСчетамБУ
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
//	|					&НачалоПериода,
//	|					&КонецПериода,
//	|					,
//	|					Счет В
//	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|							СоответствияСтатейБюджетаСчетамБУ.Счет
//	|						ИЗ
//	|							РегистрСведений.б_СоответствияСтатейБюджетаСчетамБУ КАК СоответствияСтатейБюджетаСчетамБУ),
//	|					,
//	|					Организация = &Организация,
//	|					,
//	|					) КАК ТиповойОбороты
//	|			ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаСчетамБУ.Счет)
//	|	
//	|	Объединить Все
//	|		ВЫБРАТЬ
//	|			б_СоответствияСтатейБюджетаДоходамБУ.СтатьяБюджета,
//	|			ЕстьNull(ТиповойОбороты.Организация,Значение(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|			ВЫБОР
//	|				КОГДА б_СоответствияСтатейБюджетаДоходамБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
//	|					ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаДоходамБУ.ПризнакСуммы
//	|				ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаДоходамБУ.ПризнакСуммы
//	|			КОНЕЦ КАК Сумма,
//	|			0 КАК СуммаПлан
//	|		ИЗ
//	|			РегистрСведений.б_СоответствияСтатейБюджетаДоходамБУ КАК б_СоответствияСтатейБюджетаДоходамБУ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
//	|						&НачалоПериода,
//	|						&КонецПериода,
//	|						,
//	|						Счет В
//	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|								СоответствияСтатейБюджетаДоходамБУ.Счет
//	|							ИЗ
//	|								РегистрСведений.б_СоответствияСтатейБюджетаДоходамБУ КАК СоответствияСтатейБюджетаДоходамБУ),
//	|						&мСубконтоДоходы,
//	|						Организация = &Организация,
//	|						,
//	|						) КАК ТиповойОбороты
//	|				ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаДоходамБУ.Счет)
//	|					И (ТиповойОбороты.Субконто1 = б_СоответствияСтатейБюджетаДоходамБУ.Доход)
//	|	
//	|	Объединить Все
//	|		ВЫБРАТЬ
//	|			б_СоответствияСтатейБюджетаТипамОперацийБУ.СтатьяБюджета,
//	|			ЕстьNull(ТиповойОбороты.Организация,Значение(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|		ВЫБОР
//	|				КОГДА б_СоответствияСтатейБюджетаТипамОперацийБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
//	|					ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаТипамОперацийБУ.ПризнакСуммы
//	|				ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаТипамОперацийБУ.ПризнакСуммы
//	|			КОНЕЦ КАК Сумма,
//	|			0 КАК СуммаПлан
//	|		ИЗ
//	|			РегистрСведений.б_СоответствияСтатейБюджетаТипамОперацийБУ КАК б_СоответствияСтатейБюджетаТипамОперацийБУ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
//	|						&НачалоПериода,
//	|						&КонецПериода,
//	|						,
//	|						Счет В
//	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|								СоответствияСтатейБюджетаТипамОперацийБУ.Счет
//	|							ИЗ
//	|								РегистрСведений.б_СоответствияСтатейБюджетаТипамОперацийБУ КАК СоответствияСтатейБюджетаТипамОперацийБУ),
//	|						&мСубконтоТипыОпераций,
//	|						Организация = &Организация,
//	|						,
//	|						) КАК ТиповойОбороты
//	|				ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаТипамОперацийБУ.Счет)
//	|					И (ТиповойОбороты.Субконто1 = б_СоответствияСтатейБюджетаТипамОперацийБУ.ТипОперации)
//	|	
//	|	Объединить Все
//	|		ВЫБРАТЬ
//	|			б_СоответствияСтатейБюджетаСтатьямЗатратБУ.СтатьяБюджета,
//	|			ЕстьNull(ТиповойОбороты.Организация,Значение(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|		ВЫБОР
//	|				КОГДА б_СоответствияСтатейБюджетаСтатьямЗатратБУ.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Активный)
//	|					ТОГДА ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаСтатьямЗатратБУ.ПризнакСуммы
//	|				ИНАЧЕ ЕСТЬNULL(ТиповойОбороты.СуммаОборотКт, 0) * б_СоответствияСтатейБюджетаСтатьямЗатратБУ.ПризнакСуммы
//	|			КОНЕЦ КАК Сумма,
//	|			0 КАК СуммаПлан
//	|		ИЗ
//	|			РегистрСведений.б_СоответствияСтатейБюджетаСтатьямЗатратБУ КАК б_СоответствияСтатейБюджетаСтатьямЗатратБУ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
//	|						&НачалоПериода,
//	|						&КонецПериода,
//	|						,
//	|						Счет В
//	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|								СоответствияСтатейБюджетаСтатьямЗатратБУ.Счет
//	|							ИЗ
//	|								РегистрСведений.б_СоответствияСтатейБюджетаСтатьямЗатратБУ КАК СоответствияСтатейБюджетаСтатьямЗатратБУ),
//	|						&мСубконтоСтатьиЗатрат,
//	|						Организация = &Организация,
//	|						,
//	|						) КАК ТиповойОбороты
//	|				ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаСтатьямЗатратБУ.Счет)
//	|					И (ТиповойОбороты.Субконто1 = б_СоответствияСтатейБюджетаСтатьямЗатратБУ.СтатьяЗатрат)
//	|	
//	|	Объединить Все
//	|		ВЫБРАТЬ
//	|			б_СоответствияСтатейБюджетаГруппамОСБУ.СтатьяБюджета,
//	|			ЕстьNull(ТиповойОбороты.Организация,Значение(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|			ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаГруппамОСБУ.ПризнакСуммы КАК Сумма,
//	|			0 КАК СуммаПлан
//	|		ИЗ
//	|			РегистрСведений.б_СоответствияСтатейБюджетаГруппамОСБУ КАК б_СоответствияСтатейБюджетаГруппамОСБУ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
//	|						&НачалоПериода,
//	|						&КонецПериода,
//	|						,
//	|						Счет В
//	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|								СоответствияСтатейБюджетаГруппамОСБУ.Счет
//	|							ИЗ
//	|								РегистрСведений.б_СоответствияСтатейБюджетаГруппамОСБУ КАК СоответствияСтатейБюджетаГруппамОСБУ),
//	|						&мСубконтоОС,
//	|						Организация = &Организация,
//	|						КорСчет в ИЕРАРХИИ (&мСписокСчетовПоставщиков),
//	|						) КАК ТиповойОбороты
//	|				ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаГруппамОСБУ.Счет)
//	|					И (ТиповойОбороты.Субконто1.ГруппаОС = б_СоответствияСтатейБюджетаГруппамОСБУ.ГруппаОС)
//	|	
//	|	Объединить Все
//	|		ВЫБРАТЬ
//	|			б_СоответствияСтатейБюджетаВидамНМАБУ.СтатьяБюджета,
//	|			ЕстьNull(ТиповойОбороты.Организация,Значение(Справочник.Организации.ПустаяСсылка)) КАК Организация,
//	|			ЕСТЬNULL(ТиповойОбороты.СуммаОборотДт, 0) * б_СоответствияСтатейБюджетаВидамНМАБУ.ПризнакСуммы КАК Сумма,
//	|			0 КАК СуммаПлан
//	|		ИЗ
//	|			РегистрСведений.б_СоответствияСтатейБюджетаВидамНМАБУ КАК б_СоответствияСтатейБюджетаВидамНМАБУ
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Типовой.Обороты(
//	|						&НачалоПериода,
//	|						&КонецПериода,
//	|						,
//	|						Счет В
//	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|								СоответствияСтатейБюджетаВидамНМАБУ.Счет
//	|							ИЗ
//	|								РегистрСведений.б_СоответствияСтатейБюджетаВидамНМАБУ КАК СоответствияСтатейБюджетаВидамНМАБУ),
//	|						&мСубконтоНМА,
//	|						Организация = &Организация,
//	|						КорСчет в ИЕРАРХИИ (&мСписокСчетовПоставщиков),
//	|						) КАК ТиповойОбороты
//	|				ПО (ТиповойОбороты.Счет = б_СоответствияСтатейБюджетаВидамНМАБУ.Счет)
//	|					И (ТиповойОбороты.Субконто1.ВидНМА = б_СоответствияСтатейБюджетаВидамНМАБУ.ВидНМА)
//	|	
//	|	Объединить Все
//	|	ВЫБРАТЬ
//	|		б_БюджетОбороты.СтатьяБюджета КАК СтатьяБюджета,
//	|		б_БюджетОбороты.Организация КАК Организация,
//	|		0 КАК Сумма,
//	|		б_БюджетОбороты.СуммаОборот КАК СуммаПлан
//	|	ИЗ
//	|		РегистрНакопления.б_Бюджет.Обороты(
//	|				&НачалоПериода,
//	|				&КонецПериода,
//	|				,
//	|				Организация = &Организация
//	|					И Бюджет = &ФормируемыйБюджет
//	|					И Статус = &Статус) КАК б_БюджетОбороты
//	|	
//	|	
//	|	) КАК ОборотыБУ
//	|	ПО (ОборотыБУ.СтатьяБюджета = СтатьиБюджета.ссылка)
//	|	ГДЕ
//	|	СтатьиБюджета.Владелец = &ФормируемыйБюджет
//	|	И НЕ СтатьиБюджета.ЭтоГруппа
//	|	И СтатьиБюджета.ссылка В ИЕРАРХИИ
//	|			(&СтатьяБюджета)
//	|СГРУППИРОВАТЬ ПО СтатьиБюджета.Ссылка	
//	|	
//	|";
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//КонецФункции

//Процедура РассчитатьОтклонение() Экспорт
//	
//	
//	тзРезультат = ПолучитьВыборку();	
//	
//	Если ВидРасчетнойТаблицы = перечисления.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета
//		ИЛИ ВидРасчетнойТаблицы = перечисления.б_ВидыРасчетныхТаблиц.Зарплата Тогда
//		
//		Для Каждого СтрокаТЧ из РасчетнаяТаблица Цикл
//			СтрокаТЧ.Отклонение = 0;
//			СтрокаТЗ = тзРезультат.Найти(СтрокаТЧ.СтатьяБюджета,"СтатьяБюджета");
//			СтрокаТЧ.Отклонение = ?(СтрокаТЗ=НЕОПРЕДЕЛЕНО,0,СтрокаТЗ.СуммаПлан-СтрокаТЗ.Сумма);
//		КонецЦикла;
//		
//		Если ВидРасчетнойТаблицы = перечисления.б_ВидыРасчетныхТаблиц.Зарплата Тогда
//			Для Каждого СтрокаТЧ из Налоги Цикл
//				СтрокаТЧ.Отклонение = 0;
//				СтрокаТЗ = тзРезультат.Найти(СтрокаТЧ.СтатьяБюджета,"СтатьяБюджета");
//				СтрокаТЧ.Отклонение = ?(СтрокаТЗ=НЕОПРЕДЕЛЕНО,0,СтрокаТЗ.СуммаПлан-СтрокаТЗ.Сумма);
//			КонецЦикла;
//		Конецесли;
//		
//	Иначе
//		Отклонение = 0;
//		СтрокаТЗ = тзРезультат.Найти(СтатьяБюджета,"СтатьяБюджета");
//		Отклонение = ?(СтрокаТЗ=НЕОПРЕДЕЛЕНО,0,СтрокаТЗ.СуммаПлан-СтрокаТЗ.Сумма);
//	Конецесли;

//	
//КонецПроцедуры

//Функция СформироватьТаблицуВлияющихОборотов(СтруктураШапкиДокумента) Экспорт
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ВидТаблицы",СтруктураШапкиДокумента.ВидРасчетнойТаблицы);
//	Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//	Запрос.УстановитьПараметр("Началопериода",СтруктураШапкиДокумента.ПериодПланирования);
//	
//	Если ВидОперации = Перечисления.ВидыОперацийБюджет.Бюджет Тогда
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1 КАК Сумма, ПоступлениеСумма1 как ПоступлениеСумма, ВыбытиеСумма1 как ВыбытиеСумма
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2 КАК Сумма, ПоступлениеСумма2, ВыбытиеСумма2
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3 КАК Сумма, ПоступлениеСумма3, ВыбытиеСумма3
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4 КАК Сумма, ПоступлениеСумма4, ВыбытиеСумма4
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5 КАК Сумма, ПоступлениеСумма5, ВыбытиеСумма5
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6 КАК Сумма, ПоступлениеСумма6, ВыбытиеСумма6
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7 КАК Сумма, ПоступлениеСумма7, ВыбытиеСумма7
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8 КАК Сумма, ПоступлениеСумма8, ВыбытиеСумма8
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9 КАК Сумма, ПоступлениеСумма9, ВыбытиеСумма9
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10 КАК Сумма, ПоступлениеСумма10, ВыбытиеСумма10
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11 КАК Сумма, ПоступлениеСумма11, ВыбытиеСумма11
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12 КАК Сумма, ПоступлениеСумма12, ВыбытиеСумма12
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|/////////////////МАСЛО
//		//|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаяТаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|/////////////////НАЛОГИ
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|";
//		
//	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийБюджет.Корректировка Тогда
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1-ДанныеПоСтатьям.иСумма1 КАК Сумма   , ПоступлениеСумма1-ипоступлениесумма1 как ПоступлениеСумма, ВыбытиеСумма1 -ивыбытиесумма1 как ВыбытиеСумма
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2-ДанныеПоСтатьям.иСумма2 КАК Сумма,
//		|ПоступлениеСумма2-ипоступлениесумма2 , 
//		|ВыбытиеСумма2 -ивыбытиесумма2 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3-ДанныеПоСтатьям.иСумма3 КАК Сумма,
//		|ПоступлениеСумма3-ипоступлениесумма3 , 
//		|ВыбытиеСумма3 -ивыбытиесумма3 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4-ДанныеПоСтатьям.иСумма4 КАК Сумма,
//		|ПоступлениеСумма4-ипоступлениесумма4 , 
//		|ВыбытиеСумма4 -ивыбытиесумма4 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5-ДанныеПоСтатьям.иСумма5 КАК Сумма,
//		|ПоступлениеСумма5-ипоступлениесумма5 , 
//		|ВыбытиеСумма5 -ивыбытиесумма5 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6-ДанныеПоСтатьям.иСумма6 КАК Сумма,
//		|ПоступлениеСумма6-ипоступлениесумма6 , 
//		|ВыбытиеСумма6 -ивыбытиесумма6 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7-ДанныеПоСтатьям.иСумма7 КАК Сумма,
//		|ПоступлениеСумма7-ипоступлениесумма7 , 
//		|ВыбытиеСумма7 -ивыбытиесумма7 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8-ДанныеПоСтатьям.иСумма8 КАК Сумма,
//		|ПоступлениеСумма8-ипоступлениесумма8 , 
//		|ВыбытиеСумма8 -ивыбытиесумма8 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9-ДанныеПоСтатьям.иСумма9 КАК Сумма,
//		|ПоступлениеСумма9-ипоступлениесумма9 , 
//		|ВыбытиеСумма9 -ивыбытиесумма9 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10-ДанныеПоСтатьям.иСумма10 КАК Сумма,
//		|ПоступлениеСумма10-ипоступлениесумма10 , 
//		|ВыбытиеСумма10 -ивыбытиесумма10 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11-ДанныеПоСтатьям.иСумма11 КАК Сумма,
//		|ПоступлениеСумма11-ипоступлениесумма11 , 
//		|ВыбытиеСумма11 -ивыбытиесумма11 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12-ДанныеПоСтатьям.иСумма12 КАК Сумма,
//		|ПоступлениеСумма12-ипоступлениесумма12 , 
//		|ВыбытиеСумма12 -ивыбытиесумма12 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|/////////////////МАСЛО
//		//|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.иСумма1-ДанныеПоСтатьям.иСумма1 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаяТаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2-ДанныеПоСтатьям.иСумма2 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3-ДанныеПоСтатьям.иСумма3 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4-ДанныеПоСтатьям.иСумма4 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5-ДанныеПоСтатьям.иСумма5 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6-ДанныеПоСтатьям.иСумма6 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7-ДанныеПоСтатьям.иСумма7 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8-ДанныеПоСтатьям.иСумма8 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9-ДанныеПоСтатьям.иСумма9 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10-ДанныеПоСтатьям.иСумма10 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11-ДанныеПоСтатьям.иСумма11 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12-ДанныеПоСтатьям.иСумма12 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМАСЛО КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|/////////////////НАЛОГИ
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1-ДанныеПоСтатьям.иСумма1 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2-ДанныеПоСтатьям.иСумма2 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.иСумма3-ДанныеПоСтатьям.иСумма3 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4-ДанныеПоСтатьям.иСумма4 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5-ДанныеПоСтатьям.иСумма5 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6-ДанныеПоСтатьям.иСумма6 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7-ДанныеПоСтатьям.иСумма7 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8-ДанныеПоСтатьям.иСумма8 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9-ДанныеПоСтатьям.иСумма9 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10-ДанныеПоСтатьям.иСумма10 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11-ДанныеПоСтатьям.иСумма11 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|   ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12-ДанныеПоСтатьям.иСумма12 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.НАЛОГИ КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|";
//	КонецЕсли;
//	
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//КонецФункции

//// Заполняет таблицу зависимых оборотов рекурсивно зависимыми от статьи
//// переданной в качестве параметра.
////
//// Параметры
////  Статья  – <Справочник.СтатьиОборотовБюджета> – статья оборотов, для которой выбираются зависимые
////  ДатаДвижения - дата движения по влияющей статье
////  КоличествоПоСтатье - количественный оборот по влияющей статье
////  СуммаПоСтатье - суммовой оборот по влияющей статье
////
//Процедура ЗаполнитьЗависимымиОборотами(ТекБюджет,
//										ТекСтатьяБюджета,
//										ТекПериод,
//										СуммаПоСтатье,
//										СуммаПоступление,
//										СуммаВыбытие)
//										
//	Запрос = Новый Запрос;
//										
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ЗависимостиСтатейБюджета.ЗависимыйБюджет,
//	|	ЗависимостиСтатейБюджета.ЗависимаяСтатьяБюджета,
//	|	ЗависимостиСтатейБюджета.Коэффициент,
//	|	ЗависимостиСтатейБюджета.ПериодОтражения,
//	|	ЗависимостиСтатейБюджета.ИсточникДанных
//	|ИЗ
//	|	РегистрСведений.ЗависимостиСтатейБюджета КАК ЗависимостиСтатейБюджета
//	|ГДЕ
//	|	ЗависимостиСтатейБюджета.ВлияющийБюджет = &ТекБюджет
//	|	И ЗависимостиСтатейБюджета.ВлияющаяСтатьяБюджета = &ТекСтатьяБюджета";
//	
//	Запрос.УстановитьПараметр("ТекБюджет",ТекБюджет);
//	Запрос.УстановитьПараметр("ТекСтатьяБюджета",ТекСтатьяБюджета);

//	РезультатЗапроса=Запрос.Выполнить();

//	Если РезультатЗапроса.Пустой() Тогда
//		
//		Возврат;
//		
//	Иначе
//		
//		ТабЗависимыхСтатей=РезультатЗапроса.Выгрузить();
//		
//		Для Каждого ТекущаяЗависимость Из ТабЗависимыхСтатей Цикл
//				НовыйЗависимыйОборот				=ЗависимыеОбороты.Добавить();
//				НовыйЗависимыйОборот.Период			=?(ТекущаяЗависимость.ПериодОтражения>0,Дата(Год(ТекПериод),ТекущаяЗависимость.ПериодОтражения,1),ТекПериод);
//				НовыйЗависимыйОборот.Бюджет			= ТекущаяЗависимость.ЗависимыйБюджет;
//				НовыйЗависимыйОборот.СтатьяБюджета	= ТекущаяЗависимость.ЗависимаяСтатьяБюджета;
//				Если ТекущаяЗависимость.ИсточникДанных = Перечисления.ЦС_ВидыИсточниковСуммДляЗависимостейСтатейБюджета.Поступление тогда
//					РасчетнаяСумма = СуммаПоступление;
//				ИначеЕсли ТекущаяЗависимость.ИсточникДанных = Перечисления.ЦС_ВидыИсточниковСуммДляЗависимостейСтатейБюджета.Выбытие тогда
//					РасчетнаяСумма = СуммаВыбытие;
//				Иначе
//					РасчетнаяСумма = СуммаПоСтатье;
//				КонецЕсли;
//				
//				НовыйЗависимыйОборот.Сумма			= РасчетнаяСумма*ТекущаяЗависимость.Коэффициент;
//				
//				ЗаполнитьЗависимымиОборотами(НовыйЗависимыйОборот.Бюджет,
//											НовыйЗависимыйОборот.СтатьяБюджета,
//											НовыйЗависимыйОборот.Период,
//											НовыйЗависимыйОборот.Сумма,
//											НовыйЗависимыйОборот.Сумма,
//											НовыйЗависимыйОборот.Сумма)
//		КонецЦикла;
//	Конецесли;
//	
//		

//КонецПроцедуры
//									
//// Инициирует процесс заполнения ТЧ "ЗависимыеОбороты"
////
//Процедура РассчитатьЗависимыеОбороты() Экспорт
//	
//	ЗависимыеОбороты.Очистить();
//	
//	
//	СтруктураШапкиДокумента   = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
//	тз = СформироватьТаблицуВлияющихОборотов(СтруктураШапкиДокумента);
//	
//	тз.Свернуть("Бюджет,СтатьяБюджета,Период","Сумма,ПоступлениеСумма,ВыбытиеСумма");
//	Для Каждого СтрокаТЗ из тз Цикл
//		ЗаполнитьЗависимымиОборотами(СтрокаТЗ.Бюджет,
//									СтрокаТЗ.СтатьяБюджета,
//									СтрокаТЗ.Период,
//									СтрокаТЗ.Сумма,
//									СтрокаТЗ.ПоступлениеСумма,
//									СтрокаТЗ.ВыбытиеСумма);
//	КонецЦикла;
//	
//КонецПроцедуры // РассчитатьЗависимые()

////
//Процедура ЗаполнитьПоТаблицеГСМ() Экспорт
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ГСМ.ОС КАК ОС
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ГСМ
//	|ГДЕ
//	| ГСМ.Ссылка = &ТекДокумент
//	|";
//	
//	тз = Запрос.Выполнить().Выгрузить();
//	
//	РасчетнаяТаблицаМасло.Загрузить(тз);
//	
//КонецПроцедуры

//// Возвращает доступные варианты печати документа.
////
//// Вовращаемое значение:
////  Струткура, каждая строка которой соответствует одному из вариантов печати
////  
//Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
//	
//	Возврат Новый Структура("Макет,Квартал,ПовышениеКвалификации","Расчетная таблица","Расчетная таблица (только квартал)","Повышение квалификации");

//КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////
//Функция СформироватьЗапросПОТабличнойЧасти()
//	
//	Запрос = Новый Запрос;
//	
//	Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДанныеПоМесяцам.Период,
//	|	ДанныеПоМесяцам.Сумма,
//	|	Данные.Номенклатура
//	|ИЗ
//	|	Документ.б_Расчетнаятаблица.ДанныеПоМесяцам КАК ДанныеПоМесяцам
//	|Левое соединение
//	|	(ВЫБРАТЬ
//	|		Расчетнаятаблица.IDстроки КАК IDстроки,
//	|		Расчетнаятаблица.Номенклатура КАК Номенклатура
//	|    ИЗ
//	|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК Расчетнаятаблица
//	|    ГДЕ
//	|    	 Расчетнаятаблица.ссылка = &ТекДокумент) КАК Данные
//	|   ПО Данные.IDСтроки = ДанныеПоМесяцам.IDСтроки
//	|ГДЕ
//	|	ДанныеПоМесяцам.ссылка = &ТекДокумент
//	|";
//	
//	Возврат Запрос.Выполнить();
//КонецФункции


//// Проверяет правильность заполнения шапки документа.
//// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
//// заполнен не корректно, то выставляется флаг отказа в проведении.
//// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
//// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
////
//// Параметры: 
////  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
////  Отказ                   - флаг отказа в проведении,
////  Заголовок               - строка, заголовок сообщения об ошибке проведения.
////
//Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

//	// Укажем, что надо проверить:
//	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийБюджет.Бюджет Тогда
//	СтруктураОбязательныхПолей = Новый Структура("Организация, 
//									|ФормируемыйБюджет,
//									|Сценарий,
//									|СтатьяБюджета");
//	
//	ИначеЕсли СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийБюджет.Корректировка Тогда
//	СтруктураОбязательныхПолей = Новый Структура("Организация, 
//									|ФормируемыйБюджет,
//									|Сценарий,
//									|ВидКорректировки,
//									|СтатьяБюджета");
//	КонецЕсли;	
//	// Теперь позовем общую процедуру проверки.
//	ОбщегоНазначения.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

//КонецПроцедуры // ПроверитьЗаполнениеШапки()

//Функция ПодготовитьТаблицу(СтруктураШапкиДокумента)
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("ВидТаблицы",СтруктураШапкиДокумента.ВидРасчетнойТаблицы);
//	Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//	Запрос.УстановитьПараметр("Началопериода",СтруктураШапкиДокумента.ПериодПланирования);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация КАК Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет КАК Бюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий КАК Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ КАК СтатьяБюджета,
//	|	ДанныеПоСтатьям.Номенклатура КАК Номенклатура,
//	|	ДанныеПоСтатьям.ОС КАК ОС,
//	|	&НачалоПериода КАК Период,
//	|	ДанныеПоСтатьям.Сумма1 КАК Сумма,
//	|	ДанныеПоСтатьям.ПоступлениеСумма1 КАК ПоступлениеСумма,
//	|	ДанныеПоСтатьям.ВыбытиеСумма1 КАК ВыбытиеСумма
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 1),
//	|	ДанныеПоСтатьям.Сумма2,
//	|	ДанныеПоСтатьям.ПоступлениеСумма2,
//	|	ДанныеПоСтатьям.ВыбытиеСумма2
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 2),
//	|	ДанныеПоСтатьям.Сумма3,
//	|	ДанныеПоСтатьям.ПоступлениеСумма3,
//	|	ДанныеПоСтатьям.ВыбытиеСумма3
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 3),
//	|	ДанныеПоСтатьям.Сумма4,
//	|	ДанныеПоСтатьям.ПоступлениеСумма4,
//	|	ДанныеПоСтатьям.ВыбытиеСумма4
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 4),
//	|	ДанныеПоСтатьям.Сумма5,
//	|	ДанныеПоСтатьям.ПоступлениеСумма5,
//	|	ДанныеПоСтатьям.ВыбытиеСумма5
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 5),
//	|	ДанныеПоСтатьям.Сумма6,
//	|	ДанныеПоСтатьям.ПоступлениеСумма6,
//	|	ДанныеПоСтатьям.ВыбытиеСумма6
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 6),
//	|	ДанныеПоСтатьям.Сумма7,
//	|	ДанныеПоСтатьям.ПоступлениеСумма7,
//	|	ДанныеПоСтатьям.ВыбытиеСумма7
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 7),
//	|	ДанныеПоСтатьям.Сумма8,
//	|	ДанныеПоСтатьям.ПоступлениеСумма8,
//	|	ДанныеПоСтатьям.ВыбытиеСумма8
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 8),
//	|	ДанныеПоСтатьям.Сумма9,
//	|	ДанныеПоСтатьям.ПоступлениеСумма9,
//	|	ДанныеПоСтатьям.ВыбытиеСумма9
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 9),
//	|	ДанныеПоСтатьям.Сумма10,
//	|	ДанныеПоСтатьям.ПоступлениеСумма10,
//	|	ДанныеПоСтатьям.ВыбытиеСумма10
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 10),
//	|	ДанныеПоСтатьям.Сумма11,
//	|	ДанныеПоСтатьям.ПоступлениеСумма11,
//	|	ДанныеПоСтатьям.ВыбытиеСумма11
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	ДанныеПоСтатьям.Ссылка.Организация,
//	|	ДанныеПоСтатьям.Ссылка.ФормируемыйБюджет,
//	|	ДанныеПоСтатьям.Ссылка.Сценарий,
//	|	ВЫБОР
//	|		КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//	|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА &ВидТаблицы = ЗНАЧЕНИЕ(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//	|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//	|				ИНАЧЕ ДанныеПоСтатьям.Ссылка.СтатьяБюджета
//	|			КОНЕЦ
//	|	КОНЕЦ,
//	|	ДанныеПоСтатьям.Номенклатура,
//	|	ДанныеПоСтатьям.ОС,
//	|	ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 11),
//	|	ДанныеПоСтатьям.Сумма12,
//	|	ДанныеПоСтатьям.ПоступлениеСумма12,
//	|	ДанныеПоСтатьям.ВыбытиеСумма12
//	|ИЗ
//	|	Документ.б_РасчетнаяТаблица.РасчетнаяТаблица КАК ДанныеПоСтатьям
//	|ГДЕ
//	|	ДанныеПоСтатьям.Ссылка = &ТекДокумент";
//	
//	
//	Возврат Запрос.Выполнить().Выгрузить();
// 
//КонецФункции

//Функция ПодготовитьТаблицуДляБюджета(СтруктураШапкиДокумента)
//	
//	Если ВидОперации = Перечисления.ВидыОперацийБюджет.Бюджет Тогда
//		Запрос = Новый Запрос;
//		Запрос.УстановитьПараметр("ВидТаблицы",СтруктураШапкиДокумента.ВидРасчетнойТаблицы);
//		Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//		Запрос.УстановитьПараметр("Началопериода",СтруктураШапкиДокумента.ПериодПланирования);
//		
//		Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1 КАК Сумма,  ПоступлениеСумма1 как ПоступлениеСумма, выбытиеСумма1 как Выбытиесумма
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2 КАК Сумма   ,  ПоступлениеСумма2 , выбытиеСумма2 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3 КАК Сумма ,  ПоступлениеСумма3 , выбытиеСумма3 
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4 КАК Сумма  ,  ПоступлениеСумма4 , выбытиеСумма4
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5 КАК Сумма ,  ПоступлениеСумма5 , выбытиеСумма5
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6 КАК Сумма     ,  ПоступлениеСумма6 , выбытиеСумма6
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7 КАК Сумма   ,  ПоступлениеСумма7 , выбытиеСумма7
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8 КАК Сумма   ,  ПоступлениеСумма8 , выбытиеСумма8
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9 КАК Сумма  ,  ПоступлениеСумма9 , выбытиеСумма9
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10 КАК Сумма  ,  ПоступлениеСумма10 , выбытиеСумма10
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11 КАК Сумма ,  ПоступлениеСумма11 , выбытиеСумма11
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|	ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|		ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|		ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       КОНЕЦ
//		|	КОНЕЦ КАК СтатьяБюджета,
//		|	ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияОС)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаЗемлю)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаТранспорт)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.НалогНаИмущество)
//		|				ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Коммунальные)
//		|	ТОГДА ДанныеПоСтатьям.ОС
//		|	ИНАЧЕ 
//		|		ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.АмортизацияНМА)
//		|		ТОГДА ДанныеПоСтатьям.НМА
//		|		ИНАЧЕ 
//		|			ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|						ИЛИ &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|			ТОГДА """"
//		|			ИНАЧЕ ДанныеПоСтатьям.Номенклатура
//		|       	КОНЕЦ
//		|       КОНЕЦ
//		|	КОНЕЦ КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12 КАК Сумма ,  ПоступлениеСумма12 , выбытиеСумма12
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|/////////////////////////Для ГСМ
//		|ОБЪЕДИНИТЬ ВСЕ
//		|ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1 КАК Сумма   ,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2 КАК Сумма ,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Номенклатура КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|/////////////////////////Для Зарплаты 
//		|ОБЪЕДИНИТЬ ВСЕ
//		|ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	&НачалоПериода КАК Период,
//		|	ДанныеПоСтатьям.Сумма1 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|	ДанныеПоСтатьям.Сумма2 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|	ДанныеПоСтатьям.Сумма3 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|	ДанныеПоСтатьям.Сумма4 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|	ДанныеПоСтатьям.Сумма5 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|	ДанныеПоСтатьям.Сумма6 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|	ДанныеПоСтатьям.Сумма7 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|	ДанныеПоСтатьям.Сумма8 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|	ДанныеПоСтатьям.Сумма9 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|	ДанныеПоСтатьям.Сумма10 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|	ДанныеПоСтатьям.Сумма11 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.ссылка.ФормируемыйБюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|	ДанныеПоСтатьям.Сумма12 КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|
//		|/////////////////////////////Зависимыеобороты
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.Бюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	"""" КАК ДополнительнаяАналитика,
//		|	ДанныеПоСтатьям.Период КАК Период,
//		|	ДанныеПоСтатьям.Сумма КАК Сумма,0,0
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.ЗависимыеОбороты КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|";
//	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийБюджет.Корректировка Тогда
//		Запрос = Новый Запрос;
//		Запрос.УстановитьПараметр("ВидТаблицы",СтруктураШапкиДокумента.ВидРасчетнойТаблицы);
//		Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
//		Запрос.УстановитьПараметр("ФормируемыйБюджет",СтруктураШапкиДокумента.ФормируемыйБюджет);
//		Запрос.УстановитьПараметр("ТекДокумент",ЭтотОбъект.Ссылка);
//		Запрос.УстановитьПараметр("Началопериода",СтруктураШапкиДокумента.ПериодПланирования);
//		Запрос.УстановитьПараметр("Конецпериода",КонецГода(СтруктураШапкиДокумента.ПериодПланирования));
//		Запрос.УстановитьПараметр("Статус",Перечисления.СостоянияОбъектов.Утвержден);
//		
//		Текст =
//		"ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Январь.СтатьяБюджета,
//		|   &НачалоПериода КАК Период,
//		|   Январь.Сумма - Январь.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма1) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма1) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма1) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма1) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма1) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма1) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Январь
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Январь.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И &НачалоПериода = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Февраль.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) КАК Период,
//		|   Февраль.Сумма - Февраль.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма2) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма2) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма2) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма2) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма2) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма2) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Февраль
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Февраль.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,1) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Март.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) КАК Период,
//		|   Март.Сумма - Март.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма3) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма3) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма3) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма3) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма3) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма3) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Март
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Март.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,2) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Апрель.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) КАК Период,
//		|   Апрель.Сумма - Апрель.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма4) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма4) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма4) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма4) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма4) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма4) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Апрель
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Апрель.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,3) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Май.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) КАК Период,
//		|   май.Сумма - май.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма5) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма5) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма5) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма5) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма5) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма5) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Май
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Май.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,4) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Июнь.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) КАК Период,
//		|   Июнь.Сумма - Июнь.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма6) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма6) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма6) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма6) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма6) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма6) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Июнь
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Июнь.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,5) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Июль.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) КАК Период,
//		|   Июль.Сумма - Июль.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма7) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма7) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма7) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма7) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма7) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма7) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Июль
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Июль.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,6) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Август.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) КАК Период,
//		|   Август.Сумма -  Август.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма8) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма8) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма8) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма8) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма8) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма8) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Август
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Август.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,7) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Сентябрь.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) КАК Период,
//		|   Сентябрь.Сумма - Сентябрь.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма9) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма9) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма9) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма9) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма9) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма9) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Сентябрь
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Сентябрь.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,8) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Октябрь.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) КАК Период,
//		|   Октябрь.Сумма - Октябрь.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма10) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма10) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма10) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма10) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма10) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма10) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Октябрь
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Октябрь.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,9) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Ноябрь.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) КАК Период,
//		|   Ноябрь.Сумма - Ноябрь.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма11) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма11) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма11) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма11) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма11) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма11) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Ноябрь
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Ноябрь.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,10) = б_ГодовойБюджетОбороты.Период
//		|
//		|Объединить Все
//		|ВЫБРАТЬ
//		|   &Организация КАК организация,
//		|   &ФормируемыйБюджет КАК Бюджет,
//		|   Декабрь.СтатьяБюджета,
//		|	ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) КАК Период,
//		|   Декабрь.Сумма - Декабрь.иСумма КАК Сумма
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма12) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма12) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Расчетнаятаблица КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО 
//		|		ВЫБОР КОГДА &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.ПоГруппеСтатейБюджета)
//		|			ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|			ИНАЧЕ 
//		|				ВЫБОР КОГДА  &ВидТаблицы = Значение(Перечисление.б_ВидыРасчетныхТаблиц.Зарплата)
//		|					ТОГДА ДанныеПоСтатьям.СтатьяБюджета
//		|					ИНАЧЕ ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|       		КОНЕЦ
//		|		КОНЕЦ
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.ссылка.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма12) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма12) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.РасчетнаятаблицаМасло КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.ссылка.СтатьяБюджета
//		|
//		|	Объединить Все
//		|	ВЫБРАТЬ
//		|		ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|		Сумма(ДанныеПоСтатьям.Сумма12) КАК Сумма,
//		|		Сумма(ДанныеПоСтатьям.ИСумма12) КАК ИСумма
//		|	ИЗ
//		|		Документ.б_Расчетнаятаблица.Налоги КАК ДанныеПоСтатьям
//		|	Где
//		|		ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|   СГРУППИРОВАТЬ ПО ДанныеПоСтатьям.СтатьяБюджета
//		|   ) КАК Декабрь
//		|
//		//|Левое Соединение	РегистрНакопления.б_Бюджет.Обороты(
//		//|			&Началопериода,
//		//|			&КонецПериода,
//		//|			Месяц,
//		//|			Организация = &Организация
//		//|				И Бюджет = &ФормируемыйБюджет
//		//|				И Статус = &Статус) КАК б_ГодовойБюджетОбороты	
//		//|		ПО Декабрь.СтатьяБюджета = б_ГодовойБюджетОбороты.СтатьяБюджета
//		//|          И ДОБАВИТЬКДАТЕ(&НачалоПериода,Месяц,11) = б_ГодовойБюджетОбороты.Период
//		|/////////////////////////////Зависимыеобороты
//		|Объединить Все
//		| ВЫБРАТЬ
//		|	ДанныеПоСтатьям.ссылка.Организация КАК Организация,
//		|	ДанныеПоСтатьям.Бюджет КАК Бюджет,
//		|	ДанныеПоСтатьям.СтатьяБюджета КАК СтатьяБюджета,
//		|	ДанныеПоСтатьям.Период КАК Период,
//		|	ДанныеПоСтатьям.Сумма КАК Сумма
//		|ИЗ
//		|	Документ.б_Расчетнаятаблица.ЗависимыеОбороты КАК ДанныеПоСтатьям
//		|Где
//		|	ДанныеПоСтатьям.ссылка = &ТекДокумент
//		|";
//		
//		Запрос.Текст = Текст;

//		
//		КонецЕсли;
//	
//	
//	Возврат Запрос.Выполнить().Выгрузить();
// 
//КонецФункции


//// Процедура выполняет движения по регистрам
////
//Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента,
//									ТаблицаПоРасчетнойТаблице, ТаблицаПоРасчетнойТаблицеДляБюджета, Отказ, Заголовок)
//									
//	//Зафиксировать расчетную таблицу
//	ДвижениеПоБюджетам	= Движения.СформированныеРасчетныеТаблицы.Добавить();
//	ДвижениеПоБюджетам.Бюджет = СтруктураШапкиДокумента.Формируемыйбюджет;
//	ДвижениеПоБюджетам.Организация = СтруктураШапкиДокумента.Организация;
//	ДвижениеПоБюджетам.Сценарий 			= СтруктураШапкиДокумента.Сценарий;
//	ДвижениеПоБюджетам.Видоперации 			= СтруктураШапкиДокумента.Видоперации;
//	ДвижениеПоБюджетам.ПериодПланирования 	= СтруктураШапкиДокумента.ПериодПланирования;
//	//ДвижениеПоБюджетам.Проект = СтруктураШапкиДокумента.Проект;
//	ДвижениеПоБюджетам.СтатьяБюджета 		= СтруктураШапкиДокумента.СтатьяБюджета;
//	//ЦС
//	ДвижениеПоБюджетам.ВидКорректировки 		= СтруктураШапкиДокумента.ВидКорректировки;
//	ДвижениеПоБюджетам.ПодразделениеОрганизации = СтруктураШапкиДокумента.ПодразделениеОрганизации;
//	//ЦС
//	
//	// Выполнить движения по регистру накопления 	
//	НаборДвижений = Движения.б_Бюджет;
//	
//	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
//	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
//	
//	// Заполним таблицу движений.
//	ТаблицаДанныхДляБюджета = ТаблицаПоРасчетнойТаблицеДляБюджета.Скопировать();
//	
//	
//	ТаблицаДанныхДляБюджета.Колонки.Добавить("Активность");
//	ТаблицаДанныхДляБюджета.Колонки.Добавить("Статус");
//	
//	ТаблицаДанныхДляБюджета.ЗаполнитьЗначения(Истина, "Активность");
//	ТаблицаДанныхДляБюджета.ЗаполнитьЗначения(СтруктураШапкиДокумента.Состояние, "Статус");
//	
//	
//	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДанныхДляБюджета, ТаблицаДвижений);
//	
//	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
//	
//	Если Не Отказ Тогда
//		//Движения.б_ОборотРасчетныхтаблиц.ВыполнитьДвижения();
//		Движения.б_Бюджет.ВыполнитьДвижения();
//		
//		ДвиженияПоБюджету = Движения.Бюджетирование;
//		
//		
//		ТабПроводокДокумента = ДополнительныеПоБюджетированию.ВыполнитьДвижениеПроводокПоБюджетированию(ЭтотОбъект, ДвиженияПоБюджету, СтруктураШапкиДокумента, ТаблицаДанныхДляБюджета);
//	КонецЕсли;

//Конецпроцедуры
//								
//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

//// Процедура - обработчик события "ОбработкаЗаполнения".
////
//Процедура ОбработкаЗаполнения(Основание)
//	// Обработка для работы в версии 8.2
//	Если ТипЗнч(Основание) <> Тип("Структура")
//		И Основание <> НЕОПРЕДЕЛЕНО Тогда
//	
//		//ЗаполнитьПоДокументуОснования(Основание);
//	КонецЕсли;
//КонецПроцедуры // ОбработкаЗаполнения()

//// Процедура вызывается перед записью документа 
////
//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;

//	//Если НЕ РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда 
//	//	РассчитатьЗависимыеОбороты();
//	//КонецЕсли;
//	
//КонецПроцедуры // ПередЗаписью

//Процедура ОбработкаПроведения(Отказ, РежимПроведения)

//	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
//	//Перем ДеревоПолейЗапросаПоШапке;

//	//// Заголовок для сообщений об ошибках проведения.
//	//Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
//	//
//	//
//	//// Проверка ручной корректировки
//	//Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
//	//	Возврат
//	//КонецЕсли;
//	//
//	//
//	//СтруктураШапкиДокумента   = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
//	//

//	//// Проверим правильность заполнения шапки документа
//	//ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

//	//ТаблицаДанных = ПодготовитьТаблицу(СтруктураШапкиДокумента);
//	//
//	//ТаблицаДанныхДляБюджета = ПодготовитьТаблицуДляБюджета(СтруктураШапкиДокумента);
//	//
//	//
//	//// Движения по документу
//	//Если Не Отказ Тогда

//	//	ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
//	//						ТаблицаДанных, ТаблицаДанныхДляБюджета,  Отказ, Заголовок);
//	//						
//	//КонецЕсли;
//	
//КонецПроцедуры // ОбработкаПроведения()

//// Предопределенная процедура обработки удаления проведения документа
////
//Процедура ОбработкаУдаленияПроведения(Отказ)
//	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка);
//КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

//мВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();
