&наКлиенте
Перем мОбработкаТайпинга;
&наКлиенте
Перем мТекстТайпинга;
&наКлиенте
Перем мПоследнееЗначениеЭлементаТайпинга;
&наКлиенте
Перем мСтруктураИзмерений Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

// Процедура вызывается при открытии формы.
//
&наКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Объект.ТолькоПросмотр     = НЕ Объект.ДоступностьОбъекта;
	Если Объект.Вид = Неопределено Тогда
		Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Объект) И Объект.ДоступностьОбъекта Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Объект;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Вид) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Вид;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.Представление;
	КонецЕсли;
	мПоследнееЗначениеЭлементаТайпинга = Объект.Вид;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыЗаписать(Кнопка)
	Сохранение(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Сохранение(Закрывать) 
	Если Объект.Представление <> "" И ЗначениеЗаполнено(Объект.Вид) Тогда
		ЭтаФорма.ЗакрыватьПриВыборе = Истина;
		ОповеститьОВыборе(куфиб_УправлениеКонтактнойИнформациейКлиент.СохранениеКИ(Объект, Параметры));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Кнопка)
	Сохранение(Истина);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

// Процедура вызывается при очистке значения элемента формы Объект.
//
&наКлиенте
Процедура ОбъектОчистка(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Объект.Вид) = Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
		Объект.Вид = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли; 
КонецПроцедуры

// Процедура перехватывает момент начала выбора вида контактной информации.
//
// Параметры
//  Элемент - элемент формы, выбор значения которого должен произойти
//  СтандартнаяОбработка - булево, флаг стандартной обработки выбора.
&наКлиенте
Процедура ВидНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Объект.Объект = Неопределено ИЛИ Объект.Объект.Пустая() Тогда
		Сообщить("Выберите объект.");
		Возврат;
	КонецЕсли;
	куфиб_УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуВыбораВидаКИ(Истина, Элемент, Объект.Тип, куфиб_УправлениеКонтактнойИнформацией.ВидОбъектаКИ(Объект.Объект));
КонецПроцедуры

// Процедура вызывается при начале выбора значения реквизита Объект.
//
&наКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	мОграниченныйСписокТиповОбъекта = Ложь;
	СтандартнаяОбработка = куфиб_УправлениеКонтактнойИнформациейКлиент.НачалоВыбораОбъектаКИ(ЭтаФорма, Элемент, глТекущийПользователь, мОграниченныйСписокТиповОбъекта);
	Если Этаформа.МодальныйРежим Тогда
		Если Элемент.Значение <> Неопределено И НЕ Элемент.Значение.Пустая() Тогда
			СтруктураОтбора = Новый Структура();
			ВыборкаВидовКИ = ВидКонтактнойИнформации(Элемент);
			Пока ВыборкаВидовКИ.Следующий() Цикл
				Если ВыборкаВидовКИ.Тип = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
					Объект.Вид = ВыборкаВидовКИ.Ссылка;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&наСервере
Функция ВидКонтактнойИнформации(Элемент)
	Возврат Справочники.ВидыКонтактнойИнформации.Выбрать("ВидОбъектаКонтактнойИнформации", ?(ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Контрагенты"), 
												 Предопределенноезначение("Перечисление.ВидыОбъектовКонтактнойИнформации.Контрагенты"), 
												 ПредопределенноеЗначение("Перечисление.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица")));
КонецФункции

// Процедура обработчик события ОкончаниеВводаТекста элемента формы Вид.
//
&наКлиенте
Процедура ВидОкончаниеВводаТекста(Элемент, Текст, Значение, СтандартнаяОбработка)
	куфиб_РаботаСДиалогами.ОкончаниеВводаТекстаВЭлементеУправления(Элемент, Текст, Значение, СтандартнаяОбработка, Новый Структура("Тип, ВидОбъектаКонтактнойИнформации", Объект.Тип, куфиб_УправлениеКонтактнойИнформацией.ВидОбъектаКИ(Объект.Объект)), ЭтаФорма, Тип("СправочникСсылка.ВидыКонтактнойИнформации"), мОбработкаТайпинга, мТекстТайпинга, мПоследнееЗначениеЭлементаТайпинга);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	куфиб_УправлениеКонтактнойИнформацией.УстановкаПараметровОкна(Параметры, Объект, Элементы);
	//оформление
	оф_АдресЭПЗаголовок = "Адрес электронной почты";
КонецПроцедуры




мОбработкаТайпинга                 = Ложь;
мТекстТайпинга                     = "";
мПоследнееЗначениеЭлементаТайпинга = Неопределено;
мСтруктураИзмерений                = Неопределено;
