
&НаКлиенте
Процедура РольПоляПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СпособОтображенияПриИзменении(Элемент)
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
    Элементы.Сортировка.Видимость = Объект.РольПоля=ПредопределенноеЗначение("Перечисление.фин_РолиПолейПользовательскихОтчетов.Измерение");
    Элементы.АгрегатнаяФункция.Видимость = Объект.РольПоля<>ПредопределенноеЗначение("Перечисление.фин_РолиПолейПользовательскихОтчетов.Измерение");
    Элементы.Измерение.Видимость = Объект.СпособОтображения=ПредопределенноеЗначение("Перечисление.фин_СпособыОтображенияПолейПользовательскихОтчетов.ПоСоответствиюИзмерениямБюджетирования");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.ЗаполнитьСписокРазрезовУчета(СписокВыбораРазрезыУчета);
	фин_УправлениеОтчетамиБюджетирование.НастроитьРасширенноеПредставлениеРазрезов(ЭтотОбъект,"Измерение","",Ложь,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокВыбораРазрезыУчета;
КонецПроцедуры
