////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	 
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();
    
КонецФункции // СформироватьЗапросПоШапке()

// Формирует запрос по таблице "Штатные единицы" документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоСхемыМотивации(Режим)
	
	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧПоощрения.НомерСтроки КАК НомерСтроки,
	|	ТЧПоощрения.ВидРасчета,
	|	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
	|	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
	|	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
	|	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
	|	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
	|	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
	|	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
	|	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
	|	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
	|	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
	|	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
	|	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
	|	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
	|	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	|	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	|	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	|	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	|	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	|	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
	|	Показатели1.Показатель.Валюта КАК Показатель1Валюта,
	|	Показатели2.Показатель.Валюта КАК Показатель2Валюта,
	|	Показатели3.Показатель.Валюта КАК Показатель3Валюта,
	|	Показатели4.Показатель.Валюта КАК Показатель4Валюта,
	|	Показатели5.Показатель.Валюта КАК Показатель5Валюта,
	|	Показатели6.Показатель.Валюта КАК Показатель6Валюта,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
	|	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
	|	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
	|	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
	|	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
	|	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный
	|ПОМЕСТИТЬ ВТ_ПоказателиПоощрений
	|ИЗ
	|	Документ.ИзменениеСхемМотивацииРаботников.Поощрения КАК ТЧПоощрения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели
	|		ПО ТЧПоощрения.ВидРасчета = Показатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели1
	|		ПО ТЧПоощрения.ВидРасчета = Показатели1.Ссылка
	|			И (Показатели1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели2
	|		ПО ТЧПоощрения.ВидРасчета = Показатели2.Ссылка
	|			И (Показатели2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели3
	|		ПО ТЧПоощрения.ВидРасчета = Показатели3.Ссылка
	|			И (Показатели3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели4
	|		ПО ТЧПоощрения.ВидРасчета = Показатели4.Ссылка
	|			И (Показатели4.НомерСтроки = 4)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели5
	|		ПО ТЧПоощрения.ВидРасчета = Показатели5.Ссылка
	|			И (Показатели5.НомерСтроки = 5)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеНачисления.Показатели КАК Показатели6
	|		ПО ТЧПоощрения.ВидРасчета = Показатели6.Ссылка
	|			И (Показатели6.НомерСтроки = 6)
	|ГДЕ
	|	ТЧПоощрения.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧПоощрения.НомерСтроки,
	|	ТЧПоощрения.ВидРасчета,
	|	Показатели1.Показатель.Наименование,
	|	Показатели2.Показатель.Наименование,
	|	Показатели3.Показатель.Наименование,
	|	Показатели4.Показатель.Наименование,
	|	Показатели5.Показатель.Наименование,
	|	Показатели6.Показатель.Наименование,
	|	Показатели1.Показатель.ТипПоказателя,
	|	Показатели2.Показатель.ТипПоказателя,
	|	Показатели3.Показатель.ТипПоказателя,
	|	Показатели4.Показатель.ТипПоказателя,
	|	Показатели5.Показатель.ТипПоказателя,
	|	Показатели6.Показатель.ТипПоказателя,
	|	Показатели1.Показатель.ВозможностьИзменения,
	|	Показатели2.Показатель.ВозможностьИзменения,
	|	Показатели3.Показатель.ВозможностьИзменения,
	|	Показатели4.Показатель.ВозможностьИзменения,
	|	Показатели5.Показатель.ВозможностьИзменения,
	|	Показатели6.Показатель.ВозможностьИзменения,
	|	Показатели1.Показатель.Валюта,
	|	Показатели2.Показатель.Валюта,
	|	Показатели3.Показатель.Валюта,
	|	Показатели4.Показатель.Валюта,
	|	Показатели5.Показатель.Валюта,
	|	Показатели6.Показатель.Валюта,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели1.Показатель.Предопределенный,
	|	Показатели2.Показатель.Предопределенный,
	|	Показатели3.Показатель.Предопределенный,
	|	Показатели4.Показатель.Предопределенный,
	|	Показатели5.Показатель.Предопределенный,
	|	Показатели6.Показатель.Предопределенный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧВзыскания.НомерСтроки КАК НомерСтроки,
	|	ТЧВзыскания.ВидРасчета,
	|	МАКСИМУМ(Показатели.НомерСтроки) КАК КоличествоПоказателей,
	|	Показатели1.Показатель.Наименование КАК Показатель1Наименование,
	|	Показатели2.Показатель.Наименование КАК Показатель2Наименование,
	|	Показатели3.Показатель.Наименование КАК Показатель3Наименование,
	|	Показатели4.Показатель.Наименование КАК Показатель4Наименование,
	|	Показатели5.Показатель.Наименование КАК Показатель5Наименование,
	|	Показатели6.Показатель.Наименование КАК Показатель6Наименование,
	|	Показатели1.Показатель.ТипПоказателя КАК Показатель1ТипПоказателя,
	|	Показатели2.Показатель.ТипПоказателя КАК Показатель2ТипПоказателя,
	|	Показатели3.Показатель.ТипПоказателя КАК Показатель3ТипПоказателя,
	|	Показатели4.Показатель.ТипПоказателя КАК Показатель4ТипПоказателя,
	|	Показатели5.Показатель.ТипПоказателя КАК Показатель5ТипПоказателя,
	|	Показатели6.Показатель.ТипПоказателя КАК Показатель6ТипПоказателя,
	|	Показатели1.Показатель.ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	|	Показатели2.Показатель.ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	|	Показатели3.Показатель.ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	|	Показатели4.Показатель.ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	|	Показатели5.Показатель.ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	|	Показатели6.Показатель.ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
	|	Показатели1.Показатель.Валюта КАК Показатель1Валюта,
	|	Показатели2.Показатель.Валюта КАК Показатель2Валюта,
	|	Показатели3.Показатель.Валюта КАК Показатель3Валюта,
	|	Показатели4.Показатель.Валюта КАК Показатель4Валюта,
	|	Показатели5.Показатель.Валюта КАК Показатель5Валюта,
	|	Показатели6.Показатель.Валюта КАК Показатель6Валюта,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях КАК Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели1.Показатель.Предопределенный КАК Показатель1Предопределенный,
	|	Показатели2.Показатель.Предопределенный КАК Показатель2Предопределенный,
	|	Показатели3.Показатель.Предопределенный КАК Показатель3Предопределенный,
	|	Показатели4.Показатель.Предопределенный КАК Показатель4Предопределенный,
	|	Показатели5.Показатель.Предопределенный КАК Показатель5Предопределенный,
	|	Показатели6.Показатель.Предопределенный КАК Показатель6Предопределенный
	|ПОМЕСТИТЬ ВТ_ПоказателиВзысканий
	|ИЗ
	|	Документ.ИзменениеСхемМотивацииРаботников.Взыскания КАК ТЧВзыскания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели
	|		ПО ТЧВзыскания.ВидРасчета = Показатели.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели1
	|		ПО ТЧВзыскания.ВидРасчета = Показатели1.Ссылка
	|			И (Показатели1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели2
	|		ПО ТЧВзыскания.ВидРасчета = Показатели2.Ссылка
	|			И (Показатели2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели3
	|		ПО ТЧВзыскания.ВидРасчета = Показатели3.Ссылка
	|			И (Показатели3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели4
	|		ПО ТЧВзыскания.ВидРасчета = Показатели4.Ссылка
	|			И (Показатели4.НомерСтроки = 4)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели5
	|		ПО ТЧВзыскания.ВидРасчета = Показатели5.Ссылка
	|			И (Показатели5.НомерСтроки = 5)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.УправленческиеУдержания.Показатели КАК Показатели6
	|		ПО ТЧВзыскания.ВидРасчета = Показатели6.Ссылка
	|			И (Показатели6.НомерСтроки = 6)
	|ГДЕ
	|	ТЧВзыскания.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧВзыскания.НомерСтроки,
	|	ТЧВзыскания.ВидРасчета,
	|	Показатели1.Показатель.Наименование,
	|	Показатели2.Показатель.Наименование,
	|	Показатели3.Показатель.Наименование,
	|	Показатели4.Показатель.Наименование,
	|	Показатели5.Показатель.Наименование,
	|	Показатели6.Показатель.Наименование,
	|	Показатели1.Показатель.ТипПоказателя,
	|	Показатели2.Показатель.ТипПоказателя,
	|	Показатели3.Показатель.ТипПоказателя,
	|	Показатели4.Показатель.ТипПоказателя,
	|	Показатели5.Показатель.ТипПоказателя,
	|	Показатели6.Показатель.ТипПоказателя,
	|	Показатели1.Показатель.ВозможностьИзменения,
	|	Показатели2.Показатель.ВозможностьИзменения,
	|	Показатели3.Показатель.ВозможностьИзменения,
	|	Показатели4.Показатель.ВозможностьИзменения,
	|	Показатели5.Показатель.ВозможностьИзменения,
	|	Показатели6.Показатель.ВозможностьИзменения,
	|	Показатели1.Показатель.Валюта,
	|	Показатели2.Показатель.Валюта,
	|	Показатели3.Показатель.Валюта,
	|	Показатели4.Показатель.Валюта,
	|	Показатели5.Показатель.Валюта,
	|	Показатели6.Показатель.Валюта,
	|	Показатели1.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели2.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели3.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели4.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели5.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели6.ЗапрашиватьПриКадровыхПеремещениях,
	|	Показатели1.Показатель.Предопределенный,
	|	Показатели2.Показатель.Предопределенный,
	|	Показатели3.Показатель.Предопределенный,
	|	Показатели4.Показатель.Предопределенный,
	|	Показатели5.Показатель.Предопределенный,
	|	Показатели6.Показатель.Предопределенный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Поощрения"" КАК ТабличнаяЧасть,
	|	Док.НомерСтроки КАК НомерСтроки,
	|	Док.Подразделение,
	|	Док.Подразделение.Наименование,
	|	Док.Должность.Наименование,
	|	Док.Должность,
	|	Док.ВидРасчета,
	|	ВЫБОР
	|		КОГДА Док.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроизвольнаяФормулаРасчета,
	|	ПоказателиПоощрений.КоличествоПоказателей,
	|	Док.ВидРасчета.ЗачетОтработанногоВремени КАК ОсновноеНачисление,
	|	Док.Показатель1,
	|	Док.Показатель2,
	|	Док.Показатель3,
	|	Док.Показатель4,
	|	Док.Показатель5,
	|	Док.Показатель6,
	|	Док.Валюта1,
	|	Док.Валюта2,
	|	Док.Валюта3,
	|	Док.Валюта4,
	|	Док.Валюта5,
	|	Док.Валюта6,
	|	ПоказателиПоощрений.Показатель1Наименование КАК Показатель1Наименование,
	|	ПоказателиПоощрений.Показатель2Наименование КАК Показатель2Наименование,
	|	ПоказателиПоощрений.Показатель3Наименование КАК Показатель3Наименование,
	|	ПоказателиПоощрений.Показатель4Наименование КАК Показатель4Наименование,
	|	ПоказателиПоощрений.Показатель5Наименование КАК Показатель5Наименование,
	|	ПоказателиПоощрений.Показатель6Наименование КАК Показатель6Наименование,
	|	ПоказателиПоощрений.Показатель1ТипПоказателя КАК Показатель1ТипПоказателя,
	|	ПоказателиПоощрений.Показатель2ТипПоказателя КАК Показатель2ТипПоказателя,
	|	ПоказателиПоощрений.Показатель3ТипПоказателя КАК Показатель3ТипПоказателя,
	|	ПоказателиПоощрений.Показатель4ТипПоказателя КАК Показатель4ТипПоказателя,
	|	ПоказателиПоощрений.Показатель5ТипПоказателя КАК Показатель5ТипПоказателя,
	|	ПоказателиПоощрений.Показатель6ТипПоказателя КАК Показатель6ТипПоказателя,
	|	ПоказателиПоощрений.Показатель1ВозможностьИзменения КАК Показатель1ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель2ВозможностьИзменения КАК Показатель2ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель3ВозможностьИзменения КАК Показатель3ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель4ВозможностьИзменения КАК Показатель4ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель5ВозможностьИзменения КАК Показатель5ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель6ВозможностьИзменения КАК Показатель6ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель1Предопределенный,
	|	ПоказателиПоощрений.Показатель2Предопределенный,
	|	ПоказателиПоощрений.Показатель3Предопределенный,
	|	ПоказателиПоощрений.Показатель4Предопределенный,
	|	ПоказателиПоощрений.Показатель5Предопределенный,
	|	ПоказателиПоощрений.Показатель6Предопределенный,
	|	МИНИМУМ(ПоощренияПовторы.НомерСтроки) КАК КонфликтнаяСтрокаНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать) КАК Действие,
	|	Док.ВидРасчета.СпособРасчета КАК СпособРасчета,
	|	ЛОЖЬ КАК ТребуетВводаТарифногоРазряда,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд
	|ИЗ
	|	Документ.ИзменениеСхемМотивацииРаботников.Поощрения КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиПоощрений КАК ПоказателиПоощрений
	|		ПО Док.НомерСтроки = ПоказателиПоощрений.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеСхемМотивацииРаботников.Поощрения КАК ПоощренияПовторы
	|		ПО Док.Подразделение = ПоощренияПовторы.Подразделение
	|			И Док.Должность = ПоощренияПовторы.Должность
	|			И Док.НомерСтроки < ПоощренияПовторы.НомерСтроки
	|			И (Док.ВидРасчета.ЗачетОтработанногоВремени
	|					И ПоощренияПовторы.ВидРасчета.ЗачетОтработанногоВремени
	|				ИЛИ Док.ВидРасчета = ПоощренияПовторы.ВидРасчета)
	|			И Док.Ссылка = ПоощренияПовторы.Ссылка
	|ГДЕ
	|	Док.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.НомерСтроки,
	|	Док.Подразделение,
	|	Док.Должность,
	|	Док.ВидРасчета,
	|	Док.Показатель1,
	|	Док.Валюта1,
	|	Док.Показатель2,
	|	Док.Валюта2,
	|	Док.Показатель3,
	|	Док.Валюта3,
	|	Док.Показатель4,
	|	Док.Валюта4,
	|	Док.Показатель5,
	|	Док.Валюта5,
	|	Док.Показатель6,
	|	Док.Валюта6,
	|	Док.ВидРасчета.ЗачетОтработанногоВремени,
	|	ПоказателиПоощрений.Показатель1Наименование,
	|	ПоказателиПоощрений.Показатель1ТипПоказателя,
	|	ПоказателиПоощрений.Показатель1ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель2Наименование,
	|	ПоказателиПоощрений.Показатель2ТипПоказателя,
	|	ПоказателиПоощрений.Показатель2ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель3Наименование,
	|	ПоказателиПоощрений.Показатель3ТипПоказателя,
	|	ПоказателиПоощрений.Показатель3ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель4Наименование,
	|	ПоказателиПоощрений.Показатель4ТипПоказателя,
	|	ПоказателиПоощрений.Показатель4ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель5Наименование,
	|	ПоказателиПоощрений.Показатель5ТипПоказателя,
	|	ПоказателиПоощрений.Показатель5ВозможностьИзменения,
	|	ПоказателиПоощрений.Показатель6Наименование,
	|	ПоказателиПоощрений.Показатель6ТипПоказателя,
	|	ПоказателиПоощрений.Показатель6ВозможностьИзменения,
	|	Док.Подразделение.Наименование,
	|	Док.Должность.Наименование,
	|	ПоказателиПоощрений.Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиПоощрений.Показатель1Предопределенный,
	|	ПоказателиПоощрений.Показатель2Предопределенный,
	|	ПоказателиПоощрений.Показатель3Предопределенный,
	|	ПоказателиПоощрений.Показатель4Предопределенный,
	|	ПоказателиПоощрений.Показатель5Предопределенный,
	|	ПоказателиПоощрений.Показатель6Предопределенный,
	|	ПоказателиПоощрений.КоличествоПоказателей,
	|	ВЫБОР
	|		КОГДА Док.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Взыскания"",
	|	Док.НомерСтроки,
	|	Док.Подразделение,
	|	Док.Подразделение.Наименование,
	|	Док.Должность.Наименование,
	|	Док.Должность,
	|	Док.ВидРасчета,
	|	ВЫБОР
	|		КОГДА Док.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ПоказателиВзысканий.КоличествоПоказателей,
	|	NULL,
	|	Док.Показатель1,
	|	Док.Показатель2,
	|	Док.Показатель3,
	|	Док.Показатель4,
	|	Док.Показатель5,
	|	Док.Показатель6,
	|	Док.Валюта1,
	|	Док.Валюта2,
	|	Док.Валюта3,
	|	Док.Валюта4,
	|	Док.Валюта5,
	|	Док.Валюта6,
	|	ПоказателиВзысканий.Показатель1Наименование,
	|	ПоказателиВзысканий.Показатель2Наименование,
	|	ПоказателиВзысканий.Показатель3Наименование,
	|	ПоказателиВзысканий.Показатель4Наименование,
	|	ПоказателиВзысканий.Показатель5Наименование,
	|	ПоказателиВзысканий.Показатель6Наименование,
	|	ПоказателиВзысканий.Показатель1ТипПоказателя,
	|	ПоказателиВзысканий.Показатель2ТипПоказателя,
	|	ПоказателиВзысканий.Показатель3ТипПоказателя,
	|	ПоказателиВзысканий.Показатель4ТипПоказателя,
	|	ПоказателиВзысканий.Показатель5ТипПоказателя,
	|	ПоказателиВзысканий.Показатель6ТипПоказателя,
	|	ПоказателиВзысканий.Показатель1ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель2ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель3ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель4ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель5ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель6ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель1Предопределенный,
	|	ПоказателиВзысканий.Показатель2Предопределенный,
	|	ПоказателиВзысканий.Показатель3Предопределенный,
	|	ПоказателиВзысканий.Показатель4Предопределенный,
	|	ПоказателиВзысканий.Показатель5Предопределенный,
	|	ПоказателиВзысканий.Показатель6Предопределенный,
	|	МИНИМУМ(ВзысканияПовторы.НомерСтроки),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействияСНачислением.Начать),
	|	Док.ВидРасчета.СпособРасчета,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.ТарифныеРазряды.ПустаяСсылка) КАК ТарифныйРазряд
	|ИЗ
	|	Документ.ИзменениеСхемМотивацииРаботников.Взыскания КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоказателиВзысканий КАК ПоказателиВзысканий
	|		ПО Док.НомерСтроки = ПоказателиВзысканий.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеСхемМотивацииРаботников.Взыскания КАК ВзысканияПовторы
	|		ПО Док.Подразделение = ВзысканияПовторы.Подразделение
	|			И Док.Должность = ВзысканияПовторы.Должность
	|			И Док.ВидРасчета = ВзысканияПовторы.ВидРасчета
	|			И Док.Ссылка = ВзысканияПовторы.Ссылка
	|			И Док.НомерСтроки < ВзысканияПовторы.НомерСтроки
	|ГДЕ
	|	Док.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Док.НомерСтроки,
	|	Док.Подразделение,
	|	Док.Должность,
	|	Док.ВидРасчета,
	|	Док.Показатель1,
	|	Док.Валюта1,
	|	Док.Показатель2,
	|	Док.Валюта2,
	|	Док.Показатель3,
	|	Док.Валюта3,
	|	Док.Показатель4,
	|	Док.Валюта4,
	|	Док.Показатель5,
	|	Док.Валюта5,
	|	Док.Показатель6,
	|	Док.Валюта6,
	|	ПоказателиВзысканий.Показатель1Наименование,
	|	ПоказателиВзысканий.Показатель1ТипПоказателя,
	|	ПоказателиВзысканий.Показатель1ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель2Наименование,
	|	ПоказателиВзысканий.Показатель2ТипПоказателя,
	|	ПоказателиВзысканий.Показатель2ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель3Наименование,
	|	ПоказателиВзысканий.Показатель3ТипПоказателя,
	|	ПоказателиВзысканий.Показатель3ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель4Наименование,
	|	ПоказателиВзысканий.Показатель4ТипПоказателя,
	|	ПоказателиВзысканий.Показатель4ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель5Наименование,
	|	ПоказателиВзысканий.Показатель5ТипПоказателя,
	|	ПоказателиВзысканий.Показатель5ВозможностьИзменения,
	|	ПоказателиВзысканий.Показатель6Наименование,
	|	ПоказателиВзысканий.Показатель6ТипПоказателя,
	|	ПоказателиВзысканий.Показатель6ВозможностьИзменения,
	|	Док.Подразделение.Наименование,
	|	Док.Должность.Наименование,
	|	ПоказателиВзысканий.Показатель1ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель2ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель3ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель4ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель5ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель6ЗапрашиватьПриКадровыхПеремещениях,
	|	ПоказателиВзысканий.Показатель1Предопределенный,
	|	ПоказателиВзысканий.Показатель2Предопределенный,
	|	ПоказателиВзысканий.Показатель4Предопределенный,
	|	ПоказателиВзысканий.Показатель3Предопределенный,
	|	ПоказателиВзысканий.Показатель5Предопределенный,
	|	ПоказателиВзысканий.Показатель6Предопределенный,
	|	ПоказателиВзысканий.КоличествоПоказателей,
	|	ВЫБОР
	|		КОГДА Док.ВидРасчета.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	              
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоСхемыМотивации()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)


КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "Штатные единицы" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по строке ТЧ, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок					- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиМотивации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части " + ВыборкаПоСтрокамДокумента.ТабличнаяЧасть + ": ";
	// Подразделение
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Подразделение) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбрано подразделение!", Отказ, Заголовок);
	КонецЕсли;

	// Должность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Должность) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не выбрана должность!", Отказ, Заголовок);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке + "не указано " + ?(ВыборкаПоСтрокамДокумента.ТабличнаяЧасть = "Поощрения","начисление!","удержание!"), Отказ, Заголовок);
	Иначе
		
		СоответствиеВалютныеСпособыРасчета = ПроведениеРасчетов.ПолучитьСоответствиеСпособовРасчетаТребующихВалюту();
	
		ПроведениеРасчетов.ПроверкаПоказателейВПлановыхНачислениях(ВыборкаПоСтрокамДокумента, СтрокаНачалаСообщенияОбОшибке, Ложь, Отказ, Заголовок, Истина, СоответствиеВалютныеСпособыРасчета);
		
		// Одинаковые строки
 		Если ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер) Тогда
			Если ВыборкаПоСтрокамДокумента.ТабличнаяЧасть = "Поощрения" И
				ВыборкаПоСтрокамДокумента.ОсновноеНачисление Тогда
 				СтрокаСообщениеОбОшибке = "основное начисление для строки кадрового плана (" + ВыборкаПоСтрокамДокумента.ПодразделениеНаименование + ", " + ВыборкаПоСтрокамДокумента.ДолжностьНаименование + ") следует редактировать в одной строке (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
 			Иначе
 				СтрокаСообщениеОбОшибке = "для строки кадрового плана (" + ВыборкаПоСтрокамДокумента.ПодразделениеНаименование + ", " + ВыборкаПоСтрокамДокумента.ДолжностьНаименование + ") не может быть назначено одно и тоже " + ?(ВыборкаПоСтрокамДокумента.ТабличнаяЧасть = "Поощрения","начисление","удержание") + " дважды (см. строку " + ВыборкаПоСтрокамДокумента.КонфликтнаяСтрокаНомер + ")!"; 
 			КонецЕсли;
 			ОбщегоНазначения.ОшибкаПриПроведении(СтрокаНачалаСообщенияОбОшибке  + СтрокаСообщениеОбОшибке, Отказ, Заголовок);
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиРабочегоМеста()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры: 
//  ВыборкаПоШапкеДокумента                - выборка из результата запроса по шапке документа,
//  СтруктураПроведенияПоРегистрамСведений - структура, содержащая имена регистров 
//                                           сведений по которым надо проводить документ,
//  СтруктураПараметров                    - структура параметров проведения,
//
// Возвращаемое значение:
//  Нет.
//
Процедура ДобавитьСтрокуВСхемуМотивации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента)
	
	Движение = Движения.СхемыМотивацииРаботников.Добавить();
	
	// Измерения
	Движение.Подразделение			= ВыборкаПоСтрокамДокумента.Подразделение;
	Движение.Должность				= ВыборкаПоСтрокамДокумента.Должность;
	Движение.ВидРасчета				= ВыборкаПоСтрокамДокумента.ВидРасчета;
	
	// Ресурсы
	Движение.Показатель1			= ВыборкаПоСтрокамДокумента.Показатель1;
	Движение.Показатель2			= ВыборкаПоСтрокамДокумента.Показатель2;
	Движение.Показатель3			= ВыборкаПоСтрокамДокумента.Показатель3;
	Движение.Показатель4			= ВыборкаПоСтрокамДокумента.Показатель4;
	Движение.Показатель5			= ВыборкаПоСтрокамДокумента.Показатель5;
	Движение.Показатель6			= ВыборкаПоСтрокамДокумента.Показатель6;
	Движение.Валюта1				= ВыборкаПоСтрокамДокумента.Валюта1;
	Движение.Валюта2				= ВыборкаПоСтрокамДокумента.Валюта2;
	Движение.Валюта3				= ВыборкаПоСтрокамДокумента.Валюта3;
	Движение.Валюта4				= ВыборкаПоСтрокамДокумента.Валюта4;
	Движение.Валюта5				= ВыборкаПоСтрокамДокумента.Валюта5;
	Движение.Валюта6				= ВыборкаПоСтрокамДокумента.Валюта6;
		
КонецПроцедуры // ДобавитьСтрокуВСхемуМотивации

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//структура, содержащая имена регистров сведений по которым надо проводить документ
	Перем СтруктураПроведенияПоРегистрамСведений;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
    РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);
	// Получим реквизиты шапки из запроса
    ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда

		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);

		// Движения стоит добавлять, если в проведении еще не отказано (отказ = ложь)
		Если НЕ Отказ Тогда

			// В циклах по строкам табличных частей будем добавлять информацию в движения регистров
	        ВыборкаПоСтрокиМотивации = СформироватьЗапросПоСхемыМотивации(Режим).Выбрать();
	        Пока ВыборкаПоСтрокиМотивации.Следующий() Цикл 

				// проверим очередную строку табличной части
				ПроверитьЗаполнениеСтрокиМотивации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокиМотивации, Отказ, Заголовок);

				// Движения стоит записывать, если в проведении еще не отказано (отказ =ложь)
				Если Не Отказ Тогда
					ДобавитьСтрокуВСхемуМотивации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокиМотивации);
				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

