////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция выбирает все позиции из текущих заявок
//
Функция ПолучитьСписокНоменклатуры() Экспорт
	
	Возврат гз_ПроцедурыОперативногоУчетаЗакупок.ПолучитьСписокНоменклатурыДляФормированияПотребностей(ФормированиеПотребностей,УчитыватьОстатки,УчитыватьНеисполненныеПозицииДругихЗаказов);
	
КонецФункции //ПолучитьСписокНоменклатуры()

// Процедура получает список зарегистрированных заказов
//
Процедура  ПолучитьСписокЗаказов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	гз_СостоянияТекущихЗаявокСрезПоследних.Заявка КАК ДокументОснование
	               |ИЗ
	               |	РегистрСведений.гз_СостоянияТекущихЗаявок.СрезПоследних(&Момент, Организация = &Организация) КАК гз_СостоянияТекущихЗаявокСрезПоследних
	               |ГДЕ
	               |	гз_СостоянияТекущихЗаявокСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.гз_СостоянияЗаказа.Зарегистрирован)";
	Запрос.УстановитьПараметр("Момент",	ФормированиеПотребностей.Дата);
	Запрос.УстановитьПараметр("Организация",	ФормированиеПотребностей.Организация);
	ФормированиеПотребностей.ДокументыОснования.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры //ПолучитьСписокЗаказов()

