
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	Диалог = Новый ДиалогВыбораФайла(Режим);
	Диалог.Заголовок = "Выбор файла для выгрузки данных";
	Диалог.Фильтр = "XML-файл (*.xml)|*.xml";
	ОписаниеОбработкаВыбораФайла = Новый ОписаниеОповещения("ОбработкаВыбораФайла",ЭтотОбъект);
	Диалог.Показать(ОписаниеОбработкаВыбораФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайла(МассивФайлов,ДополнительныеПараметры) Экспорт
	Если МассивФайлов<>Неопределено И МассивФайлов.Количество()>0 Тогда
		ИмяФайла = МассивФайлов[0];
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("РежимДиалога",РежимДиалога);
	Если НЕ ЗначениеЗаполнено(РежимДиалога) Тогда
		РежимДиалога = "Открытие";
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		ПоказатьПредупреждение(,"Укажите путь к файлу");
	Иначе
		ОповеститьОВыборе(Новый Структура("Настройка,ИмяФайла",Элементы.Список.ТекущиеДанные.Ссылка,ИмяФайла));
	КонецЕсли;
КонецПроцедуры

