#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать. Начало 

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// анализ промежуточного исполнения
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланЗакупок";
	КомандаПечати.Представление = НСтр("ru = 'План закупок'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	// анализ промежуточного исполнения
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланЗакупокПериоды";
	КомандаПечати.Представление = НСтр("ru = 'План закупок (По периодам)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	// анализ промежуточного исполнения
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПланЗакупокПодробно";
	КомандаПечати.Представление = НСтр("ru = 'План закупок (Подробно)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	Возврат;	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПланЗакупок") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПланЗакупок",
			НСтр("ru = 'План закупок'"),
			ПечатьПланЗакупок(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.узп_ПланЗакупок.ПФ_MXL_ПланЗакупок");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПланЗакупокПериоды") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПланЗакупокПериоды",
			НСтр("ru = 'План закупок (По периодам)'"),
			ПечатьПланЗакупокПериоды(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.узп_ПланЗакупок.ПФ_MXL_ПланЗакупокПериоды");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПланЗакупокПодробно") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПланЗакупокПодробно",
			НСтр("ru = 'План закупок (Подробно)'"),
			ПечатьПланЗакупокПодробно(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.узп_ПланЗакупок.ПФ_MXL_ПланЗакупокПодробно");
	КонецЕсли;	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Функция ПечатьПланЗакупок(МассивОбъектов, ОбъектыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Макет = Документы.узп_ПланЗакупок.ПолучитьМакет("ПФ_MXL_ПланЗакупок");
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати 	= "узп_ПланЗакупок_ПланЗакупок";
	
	ПризнакПроекта 	= фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("узп_ВестиУчетЗакупокПоПроектам");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланЗакупок.Ссылка,
	|	ПланЗакупок.Автор,
	|	ПланЗакупок.Дата,
	|	ПланЗакупок.ОбластьПланирования,
	|	ПланЗакупок.Номер,
	|	ПланЗакупок.Организация,
	|	ПланЗакупок.Ответственный,
	|	ПланЗакупок.ПериодПланирования,
	|	ПланЗакупок.Подразделение,
	|	ПланЗакупок.СтруктурноеПодразделение,
	|	ПланЗакупок.Сценарий
	|ИЗ
	|	Документ.узп_ПланЗакупок КАК ПланЗакупок
	|ГДЕ
	|	ПланЗакупок.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	//Товары
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланЗакупокТовары.Номенклатура,
	|	ПланЗакупокТовары.ПериодПланирования КАК ПериодПланирования,
	|	ПланЗакупокТовары.ЕдиницаИзмерения,
	|	СУММА(ПланЗакупокТовары.Количество) КАК Количество,
	|	ПланЗакупокТовары.Цена,
	|	СУММА(ПланЗакупокТовары.Сумма) КАК Сумма,
	|	ПланЗакупокТовары.Подразделение,
	|	ПланЗакупокТовары.Характеристика,
	|	ПланЗакупокТовары.Поставщик,
	|	ПланЗакупокТовары.Коэффициент,
	|	ПланЗакупокТовары.Проект,
	|	ПланЗакупокТовары.ОбъектРемонта
	|ИЗ
	|	Документ.узп_ПланЗакупок.Товары КАК ПланЗакупокТовары
	|ГДЕ
	|	ПланЗакупокТовары.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланЗакупокТовары.Поставщик,
	|	ПланЗакупокТовары.Номенклатура,
	|	ПланЗакупокТовары.ПериодПланирования,
	|	ПланЗакупокТовары.ЕдиницаИзмерения,
	|	ПланЗакупокТовары.Характеристика,
	|	ПланЗакупокТовары.Подразделение,
	|	ПланЗакупокТовары.Цена,
	|	ПланЗакупокТовары.Коэффициент,
	|	ПланЗакупокТовары.Проект,
	|	ПланЗакупокТовары.ОбъектРемонта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланЗакупокТовары.Номенклатура.Наименование,
	|	ПланЗакупокТовары.Характеристика.Наименование,
	|	ПериодПланирования";
	ВыборкаТовары = Запрос.Выполнить().Выбрать();
	//Услуги
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланЗакупокТовары.Номенклатура,
	|	ПланЗакупокТовары.ПериодПланирования КАК ПериодПланирования,
	|	СУММА(ПланЗакупокТовары.Количество) КАК Количество,
	|	ПланЗакупокТовары.Цена,
	|	СУММА(ПланЗакупокТовары.Сумма) КАК Сумма,
	|	ПланЗакупокТовары.Подразделение,
	|	ПланЗакупокТовары.Характеристика,
	|	ПланЗакупокТовары.Поставщик,
	|	ПланЗакупокТовары.Проект,
	|	ПланЗакупокТовары.ОбъектРемонта
	|ИЗ
	|	Документ.узп_ПланЗакупок.Услуги КАК ПланЗакупокТовары
	|ГДЕ
	|	ПланЗакупокТовары.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланЗакупокТовары.ПериодПланирования,
	|	ПланЗакупокТовары.Номенклатура,
	|	ПланЗакупокТовары.Характеристика,
	|	ПланЗакупокТовары.Поставщик,
	|	ПланЗакупокТовары.Подразделение,
	|	ПланЗакупокТовары.Цена,
	|	ПланЗакупокТовары.Проект,
	|	ПланЗакупокТовары.ОбъектРемонта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланЗакупокТовары.Номенклатура.Наименование,
	|	ПланЗакупокТовары.Характеристика.Наименование,
	|	ПериодПланирования";
	ВыборкаУслуги = Запрос.Выполнить().Выбрать();
    //Дополнительные затраты
	Запрос.Текст =
	"ВЫБРАТЬ
	|	узп_ПланЗакупокДополнительныеЗатраты.Номенклатура,
	|	узп_ПланЗакупокДополнительныеЗатраты.ПериодПланирования КАК ПериодПланирования,
	|	узп_ПланЗакупокДополнительныеЗатраты.Подразделение,
	|	узп_ПланЗакупокДополнительныеЗатраты.Размер,
	|	узп_ПланЗакупокДополнительныеЗатраты.Проект
	|ИЗ
	|	Документ.узп_ПланЗакупок.ДополнительныеЗатраты КАК узп_ПланЗакупокДополнительныеЗатраты
	|ГДЕ
	|	узп_ПланЗакупокДополнительныеЗатраты.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	узп_ПланЗакупокДополнительныеЗатраты.ПериодПланирования,
	|	узп_ПланЗакупокДополнительныеЗатраты.Номенклатура,
	|	узп_ПланЗакупокДополнительныеЗатраты.Подразделение,
	|	узп_ПланЗакупокДополнительныеЗатраты.Размер,
	|	узп_ПланЗакупокДополнительныеЗатраты.Проект
	|
	|УПОРЯДОЧИТЬ ПО
	|	узп_ПланЗакупокДополнительныеЗатраты.Номенклатура.Наименование,
	|	ПериодПланирования";
	ВыборкаДопЗатраты = Запрос.Выполнить().Выбрать();
	
	Шапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка 		= Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары 			= Макет.ПолучитьОбласть("Товары");
	ОбластьУслугиШапка 		= Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги 			= Макет.ПолучитьОбласть("Услуги");
	ОбластьДопЗатратыШапка 	= Макет.ПолучитьОбласть("ДопЗатратыШапка");
	ОбластьДопЗатраты 		= Макет.ПолучитьОбласть("ДопЗатраты");
	
	Подвал 					= Макет.ПолучитьОбласть("Подвал");

	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало 							= ТабличныйДокумент.ВысотаТаблицы + 1;
		ВставлятьРазделительСтраниц 				= Ложь;
		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ОрганизацияНаименование = Выборка.Организация.Наименование+?(ЗначениеЗаполнено(Выборка.СтруктурноеПодразделение),"/"+Выборка.СтруктурноеПодразделение.Наименование,"");
//		Шапка.Параметры.ПодразделениеНаименование = ?(Выборка.ОбластьПланирования=Перечисления.узп_ИсточникиЗаявокМТС.Подразделение,Выборка.Подразделение.Наименование,Выборка.ИсточникЗаявки);
		Шапка.Параметры.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПредставлениеИнтервалаСтрокой(Выборка.ПериодПланирования,Выборка.Сценарий); 
		ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());

		Если ВыборкаТовары.Количество()>0 Тогда
			ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
		КонецЕсли;
		НомерСтроки = 1;
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ОбластьТовары.Параметры.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ВыборкаТовары.ПериодПланирования,Выборка.Сценарий);
			ОбластьТовары.Параметры.НомерСтроки  =  НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			Если ЗначениеЗаполнено(ВыборкаТовары.Характеристика) Тогда
				ОбластьТовары.Параметры.Номенклатура = ВыборкаТовары.Номенклатура.Наименование + " / "+ВыборкаТовары.Характеристика.Наименование;
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		НомерСтроки = 1;
		Если ВыборкаУслуги.Количество()>0 Тогда
			ТабличныйДокумент.Вывести(ОбластьУслугиШапка);
		КонецЕсли;
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ОбластьУслуги.Параметры.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ВыборкаТовары.ПериодПланирования,Выборка.Сценарий);
			ОбластьУслуги.Параметры.НомерСтроки  =  НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			Если ЗначениеЗаполнено(ВыборкаУслуги.Характеристика) Тогда
				ОбластьУслуги.Параметры.Номенклатура = ВыборкаУслуги.Номенклатура.Наименование + " / "+ВыборкаУслуги.Характеристика.Наименование;
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
		КонецЦикла;		
		Подвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьПланЗакупокПодробно(МассивОбъектов, ОбъектыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Макет 									= Документы.узп_ПланЗакупок.ПолучитьМакет("ПФ_MXL_ПланЗакупокПодробно");
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати 	= "узп_ПланЗакупок_ПланЗакупокПодробно";
	
	ПризнакПроекта 	= фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("узп_ВестиУчетЗакупокПоПроектам");
	Если ПризнакПроекта тогда
		Проект = ", Проект";
	Иначе
		Проект = "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланЗакупок.Ссылка,
	|	ПланЗакупок.Автор,
	|	ПланЗакупок.Дата,
	|	ПланЗакупок.ОбластьПланирования,
	|	ПланЗакупок.Номер,
	|	ПланЗакупок.Организация,
	|	ПланЗакупок.Ответственный,
	|	ПланЗакупок.ПериодПланирования,
	|	ПланЗакупок.Подразделение,
	|	ПланЗакупок.СтруктурноеПодразделение,
	|	ПланЗакупок.Сценарий,
	|	ПланЗакупок.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		ЕдиницаИзмерения,
	|		Коэффициент,
	|		ПериодПланирования,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		Подразделение,
	|		Приоритет,
	|		ОбъектРемонта,
	|		Поставщик,
	|		Заявка"+ Проект+"
	|	),
	|	ПланЗакупок.Услуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		ПериодПланирования,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		Подразделение,
	|		ОбъектРемонта,
	|		Приоритет,
	|		Поставщик,
	|		Заявка"+ Проект+"
	|	),
	|	ПланЗакупок.ДополнительныеЗатраты.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ПериодПланирования,
	|		Размер,
	|		Подразделение
	|	)
	|ИЗ
	|	Документ.узп_ПланЗакупок КАК ПланЗакупок
	|ГДЕ
	|	ПланЗакупок.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьУслугиШапка = Макет.ПолучитьОбласть("УслугиШапка");
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьДопЗатратыШапка = Макет.ПолучитьОбласть("ДопЗатратыШапка");
	ОбластьДопЗатраты = Макет.ПолучитьОбласть("ДопЗатраты");
	
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало 							= ТабличныйДокумент.ВысотаТаблицы + 1;
   		Если НЕ ПризнакПроекта Тогда
			ОбластьТоварыШапка.УдалитьОбласть(ОбластьТоварыШапка.Область("ШапкаТоварыПроекты"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьУслугиШапка.УдалитьОбласть(ОбластьУслугиШапка.Область("ШапкаУслугиПроекты"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьТовары.УдалитьОбласть(ОбластьТовары.Область("ТоварыПроекты"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
			ОбластьУслуги.УдалитьОбласть(ОбластьУслуги.Область("УслугиПроекты"),ТипСмещенияТабличногоДокумента.ПоГоризонтали);
		КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ОрганизацияНаименование = Выборка.Организация.Наименование+?(ЗначениеЗаполнено(Выборка.СтруктурноеПодразделение),"/"+Выборка.СтруктурноеПодразделение.Наименование,"");
		Шапка.Параметры.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПредставлениеИнтервалаСтрокой(Выборка.ПериодПланирования,Выборка.Сценарий); 
		ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());

		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если ВыборкаТовары.Количество()>0 Тогда
			ТабличныйДокумент.Вывести(ОбластьТоварыШапка);
		КонецЕсли;
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ОбластьТовары.Параметры.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ВыборкаТовары.ПериодПланирования,Выборка.Сценарий);
			Если ЗначениеЗаполнено(ВыборкаТовары.Характеристика) Тогда
				ОбластьТовары.Параметры.Номенклатура = ВыборкаТовары.Номенклатура.Наименование + " / "+ВыборкаТовары.Характеристика.Наименование;
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Если ВыборкаУслуги.Количество()>0 Тогда
			ТабличныйДокумент.Вывести(ОбластьУслугиШапка);
		КонецЕсли;
		Пока ВыборкаУслуги.Следующий() Цикл
			ОбластьУслуги.Параметры.Заполнить(ВыборкаУслуги);
			ОбластьУслуги.Параметры.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ВыборкаТовары.ПериодПланирования,Выборка.Сценарий);
			Если ЗначениеЗаполнено(ВыборкаУслуги.Характеристика) Тогда
				ОбластьУслуги.Параметры.Номенклатура = ВыборкаУслуги.Номенклатура.Наименование + " / "+ВыборкаУслуги.Характеристика.Наименование;
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьУслуги, ВыборкаУслуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьПланЗакупокПериоды(МассивОбъектов, ОбъектыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Макет 									= Документы.узп_ПланЗакупок.ПолучитьМакет("ПФ_MXL_ПланЗакупокПериоды");
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати 	= "узп_ПланЗакупок_ПланЗакупокПериоды";
	
	ПризнакПроекта 	= фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("узп_ВестиУчетЗакупокПоПроектам");
	Если ПризнакПроекта тогда
		Проект = ", Проект";
	Иначе
		Проект = "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланЗакупок.Ссылка,
	|	ПланЗакупок.Автор,
	|	ПланЗакупок.Дата,
	|	ПланЗакупок.ОбластьПланирования,
	|	ПланЗакупок.Номер,
	|	ПланЗакупок.Организация,
	|	ПланЗакупок.Ответственный,
	|	ПланЗакупок.ПериодПланирования,
	|	ПланЗакупок.Подразделение,
	|	ПланЗакупок.СтруктурноеПодразделение,
	|	ПланЗакупок.Сценарий,
	|	ПланЗакупок.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		ЕдиницаИзмерения,
	|		Коэффициент,
	|		ПериодПланирования,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		Подразделение,
	|		Приоритет,
	|		ОбъектРемонта,
	|		Заявка,
	|		Поставщик"+ Проект+"
	|	),
	|	ПланЗакупок.Услуги.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Характеристика,
	|		ПериодПланирования,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		Подразделение,
	|		ОбъектРемонта,
	|		Приоритет,
	|		Заявка,
	|		Поставщик"+Проект+"
	|	),
	|	ПланЗакупок.ДополнительныеЗатраты.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ПериодПланирования,
	|		Размер,
	|		Подразделение
	|	)
	|ИЗ
	|	Документ.узп_ПланЗакупок КАК ПланЗакупок
	|ГДЕ
	|	ПланЗакупок.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
	//Таблица Товаров
	ТаблицаТовары = Новый ТаблицаЗначений;
	ТаблицаТовары.Колонки.Добавить("НомерСтроки");
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	Массив.Добавить(Тип("СправочникСсылка.фин_ПлановаяНоменклатура"));
	//ТаблицаТовары.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТовары.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов(Массив));
	ТаблицаТовары.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.узп_ПлановыеХарактеристикиНоменклатуры"));
	ТаблицаТовары.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаТовары.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("Число"));
	Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
		ТаблицаТовары.Колонки.Добавить("ТоварыПериод"+НомерПериода,Новый ОписаниеТипов("Дата"));
		ТаблицаТовары.Колонки.Добавить("ТоварыКоличество"+НомерПериода,Новый ОписаниеТипов("Число"));
		ТаблицаТовары.Колонки.Добавить("ТоварыЦена"+НомерПериода,Новый ОписаниеТипов("Число"));
		ТаблицаТовары.Колонки.Добавить("ТоварыСумма"+НомерПериода,Новый ОписаниеТипов("Число"));
	КонецЦикла;
	ТаблицаТовары.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаТовары.Колонки.Добавить("Приоритет");
	ТаблицаТовары.Колонки.Добавить("ОбъектРемонта");
	ТаблицаТовары.Колонки.Добавить("Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаТовары.Колонки.Добавить("Заявка",Новый ОписаниеТипов("ДокументСсылка.узп_ЗаявкаМТС"));
	Если ПризнакПроекта тогда
		ТаблицаТовары.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	КонецЕсли;
	//Таблица Услуг
	ТаблицаУслуги = Новый ТаблицаЗначений;
	ТаблицаУслуги.Колонки.Добавить("НомерСтроки");
	ТаблицаУслуги.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаУслуги.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.узп_ПлановыеХарактеристикиНоменклатуры"));
	ТаблицаУслуги.Колонки.Добавить("ЕдиницаИзмерения",Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТаблицаУслуги.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("Число"));
	Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
		ТаблицаУслуги.Колонки.Добавить("УслугиПериод"+НомерПериода,Новый ОписаниеТипов("Дата"));
		ТаблицаУслуги.Колонки.Добавить("УслугиКоличество"+НомерПериода,Новый ОписаниеТипов("Число"));
		ТаблицаУслуги.Колонки.Добавить("УслугиЦена"+НомерПериода,Новый ОписаниеТипов("Число"));
		ТаблицаУслуги.Колонки.Добавить("УслугиСумма"+НомерПериода,Новый ОписаниеТипов("Число"));
	КонецЦикла;
	ТаблицаУслуги.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаУслуги.Колонки.Добавить("Приоритет");
	ТаблицаУслуги.Колонки.Добавить("ОбъектРемонта");
	ТаблицаУслуги.Колонки.Добавить("Поставщик",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаУслуги.Колонки.Добавить("Заявка",Новый ОписаниеТипов("ДокументСсылка.узп_ЗаявкаМТС"));
	Если ПризнакПроекта тогда
		ТаблицаУслуги.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	КонецЕсли;	
	//Таблица Дополнительных затрат
	ТаблицаДопЗатраты = Новый ТаблицаЗначений;
	ТаблицаДопЗатраты.Колонки.Добавить("НомерСтроки");
	ТаблицаДопЗатраты.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
		ТаблицаДопЗатраты.Колонки.Добавить("ДопЗатратыПериод"+НомерПериода,Новый ОписаниеТипов("Дата"));
		ТаблицаДопЗатраты.Колонки.Добавить("ДопЗатратыРазмер"+НомерПериода,Новый ОписаниеТипов("Число"));
	КонецЦикла;
	ТаблицаДопЗатраты.Колонки.Добавить("Подразделение",Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	/////////////////////////
	ВыборкаТовары = Выборка.Товары.Выбрать();
	Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
		Пока ВыборкаТовары.Следующий() Цикл
			ТекущийПериод = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ДобавитьМесяц(Выборка.ПериодПланирования,НомерПериода-1),Выборка.Сценарий);
			Если ПризнакПроекта тогда
				ПараметрыПоиска = Новый Структура ("Номенклатура,Характеристика,Проект,ЕдиницаИзмерения,Коэффициент,Подразделение,Поставщик,Заявка",
										  ВыборкаТовары.Номенклатура,ВыборкаТовары.Характеристика,ВыборкаТовары.Проект,
										  ВыборкаТовары.ЕдиницаИзмерения,ВыборкаТовары.Коэффициент,ВыборкаТовары.Подразделение,
										  ВыборкаТовары.Поставщик, ВыборкаТовары.Заявка);
			Иначе
				ПараметрыПоиска = Новый Структура ("Номенклатура,Характеристика,ЕдиницаИзмерения,Коэффициент,Подразделение,Поставщик,Заявка",
										  ВыборкаТовары.Номенклатура,ВыборкаТовары.Характеристика,
										  ВыборкаТовары.ЕдиницаИзмерения,ВыборкаТовары.Коэффициент,ВыборкаТовары.Подразделение,
										  ВыборкаТовары.Поставщик, ВыборкаТовары.Заявка);
			КонецЕсли;	
			
			НайденныеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыПоиска);
			Если фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ВыборкаТовары.ПериодПланирования,Выборка.Сценарий) = ТекущийПериод Тогда
				Если НайденныеСтроки.Количество()=0 Тогда
					НоваяСтрока = ТаблицаТовары.Добавить();
					НоваяСтрока.НомерСтроки = ВыборкаТовары.НомерСтроки;
					НоваяСтрока.Номенклатура = ВыборкаТовары.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаТовары.Характеристика;
					НоваяСтрока.ЕдиницаИзмерения = ВыборкаТовары.ЕдиницаИзмерения;
					НоваяСтрока.Коэффициент = ВыборкаТовары.Коэффициент;
					НоваяСтрока["ТоварыПериод"+Строка(НомерПериода)] = ВыборкаТовары.ПериодПланирования;
					НоваяСтрока["ТоварыКоличество"+Строка(НомерПериода)] = ВыборкаТовары.Количество;
					НоваяСтрока["ТоварыЦена"+Строка(НомерПериода)] = ВыборкаТовары.Цена;
					НоваяСтрока["ТоварыСумма"+Строка(НомерПериода)] = ВыборкаТовары.Сумма;
					НоваяСтрока.Подразделение = ВыборкаТовары.Подразделение;
					НоваяСтрока.Приоритет = ВыборкаТовары.Приоритет;
					НоваяСтрока.ОбъектРемонта = ВыборкаТовары.ОбъектРемонта;
					НоваяСтрока.Поставщик = ВыборкаТовары.Поставщик;
					НоваяСтрока.Заявка = ВыборкаТовары.Заявка;
					Если ПризнакПроекта Тогда
						НоваяСтрока.Проект = ВыборкаТовары.Проект;
					КонецЕсли;
					
				Иначе
					СтрокаПериод = ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыПериод" + Строка(НомерПериода)];
					СтрокаКоличество = ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыКоличество" + Строка(НомерПериода)];
					СтрокаЦена = ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыЦена" + Строка(НомерПериода)];
					СтрокаСумма = ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыСумма" + Строка(НомерПериода)];
					ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыПериод" + Строка(НомерПериода)] = ВыборкаТовары.ПериодПланирования;
					ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыКоличество" + Строка(НомерПериода)] = ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыКоличество" + Строка(НомерПериода)]+ВыборкаТовары.Количество;
					ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыЦена"+Строка(НомерПериода)] = ВыборкаТовары.Цена;
					ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыСумма" + Строка(НомерПериода)] = ТаблицаТовары.Получить(ТаблицаТовары.Индекс(НайденныеСтроки[0]))["ТоварыСумма" + Строка(НомерПериода)]+ВыборкаТовары.Сумма;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ВыборкаТовары.Сбросить();
	КонецЦикла;
	Выборка.Следующий();
	ВыборкаУслуги = Выборка.Услуги.Выбрать();
	Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
		Пока ВыборкаУслуги.Следующий() Цикл
			ТекущийПериод = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ДобавитьМесяц(Выборка.ПериодПланирования,НомерПериода-1),Выборка.Сценарий);
		    Если ПризнакПроекта тогда
				ПараметрыПоиска = Новый Структура ("Номенклатура,Характеристика,Проект,Подразделение,Поставщик,Заявка",
										  ВыборкаУслуги.Номенклатура,ВыборкаУслуги.Характеристика,ВыборкаУслуги.Проект,
										  ВыборкаУслуги.Подразделение,
										  ВыборкаУслуги.Поставщик, ВыборкаУслуги.Заявка);
			Иначе
				ПараметрыПоиска = Новый Структура ("Номенклатура,Характеристика,Подразделение,Поставщик,Заявка",
										  ВыборкаУслуги.Номенклатура,ВыборкаУслуги.Характеристика,
										  ВыборкаУслуги.Подразделение,
										  ВыборкаУслуги.Поставщик, ВыборкаУслуги.Заявка);
			КонецЕсли; 
			НайденныеСтроки = ТаблицаУслуги.НайтиСтроки(ПараметрыПоиска);
			Если фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ВыборкаУслуги.ПериодПланирования,Выборка.Сценарий) = ТекущийПериод Тогда
				Если НайденныеСтроки.Количество()=0 Тогда
					НоваяСтрока = ТаблицаУслуги.Добавить();
					НоваяСтрока.НомерСтроки = ВыборкаУслуги.НомерСтроки;
					НоваяСтрока.Номенклатура = ВыборкаУслуги.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаУслуги.Характеристика;
					НоваяСтрока["УслугиПериод"+Строка(НомерПериода)] = ВыборкаУслуги.ПериодПланирования;
					НоваяСтрока["УслугиКоличество"+Строка(НомерПериода)] = ВыборкаУслуги.Количество;
					НоваяСтрока["УслугиЦена"+Строка(НомерПериода)] = ВыборкаУслуги.Цена;
					НоваяСтрока["УслугиСумма"+Строка(НомерПериода)] = ВыборкаУслуги.Сумма;
					НоваяСтрока.Подразделение = ВыборкаУслуги.Подразделение;
					НоваяСтрока.Приоритет = ВыборкаУслуги.Приоритет;
					НоваяСтрока.ОбъектРемонта = ВыборкаУслуги.ОбъектРемонта;
					НоваяСтрока.Поставщик = ВыборкаУслуги.Поставщик;
					НоваяСтрока.Заявка = ВыборкаУслуги.Заявка;
					Если ПризнакПроекта Тогда
						НоваяСтрока.Проект = ВыборкаУслуги.Проект;
					КонецЕсли;
					
				Иначе
					СтрокаПериод = ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиПериод" + Строка(НомерПериода)];
					СтрокаКоличество = ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиКоличество" + Строка(НомерПериода)];
					СтрокаЦена = ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиЦена" + Строка(НомерПериода)];
					СтрокаСумма = ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиСумма" + Строка(НомерПериода)];
					ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиПериод" + Строка(НомерПериода)] = ВыборкаУслуги.ПериодПланирования;
					ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиКоличество" + Строка(НомерПериода)] = ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиКоличество" + Строка(НомерПериода)]+ВыборкаУслуги.Количество;
					ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиЦена"+Строка(НомерПериода)] = ВыборкаУслуги.Цена;
					ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиСумма" + Строка(НомерПериода)] = ТаблицаУслуги.Получить(ТаблицаУслуги.Индекс(НайденныеСтроки[0]))["УслугиСумма" + Строка(НомерПериода)]+ВыборкаУслуги.Сумма;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ВыборкаУслуги.Сбросить();
	КонецЦикла;
	
	//Перебор полей выборки дополнительных затрат
	Выборка.Следующий();
	ВыборкаДопЗатраты = Выборка.ДополнительныеЗатраты.Выбрать();
	Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
		Пока ВыборкаДопЗатраты.Следующий() Цикл
			ТекущийПериод = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ДобавитьМесяц(Выборка.ПериодПланирования,НомерПериода-1),Выборка.Сценарий);
		    ПараметрыПоиска = Новый Структура ("Номенклатура,Подразделение",
										  ВыборкаДопЗатраты.Номенклатура,
										  ВыборкаДопЗатраты.Подразделение
										  );
			НайденныеСтроки = ТаблицаДопЗатраты.НайтиСтроки(ПараметрыПоиска);
			Если фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ВыборкаДопЗатраты.ПериодПланирования,Выборка.Сценарий) = ТекущийПериод Тогда
				Если НайденныеСтроки.Количество()=0 Тогда
					НоваяСтрока = ТаблицаДопЗатраты.Добавить();
					НоваяСтрока.НомерСтроки = ВыборкаДопЗатраты.НомерСтроки;
					НоваяСтрока.Номенклатура = ВыборкаДопЗатраты.Номенклатура;
					НоваяСтрока["ДопЗатратыПериод"+Строка(НомерПериода)] = ВыборкаДопЗатраты.ПериодПланирования;
					НоваяСтрока["ДопЗатратыРазмер"+Строка(НомерПериода)] = ВыборкаДопЗатраты.Размер;
					НоваяСтрока.Подразделение = ВыборкаДопЗатраты.Подразделение;
					
				Иначе
					СтрокаПериод = ТаблицаДопЗатраты.Получить(ТаблицаДопЗатраты.Индекс(НайденныеСтроки[0]))["ДопЗатратыПериод" + Строка(НомерПериода)];
					СтрокаСумма = ТаблицаДопЗатраты.Получить(ТаблицаДопЗатраты.Индекс(НайденныеСтроки[0]))["ДопЗатратыРазмер" + Строка(НомерПериода)];
					ТаблицаДопЗатраты.Получить(ТаблицаДопЗатраты.Индекс(НайденныеСтроки[0]))["ДопЗатратыПериод" + Строка(НомерПериода)] = ВыборкаДопЗатраты.ПериодПланирования;
					ТаблицаДопЗатраты.Получить(ТаблицаДопЗатраты.Индекс(НайденныеСтроки[0]))["ДопЗатратыРазмер" + Строка(НомерПериода)] = ТаблицаДопЗатраты.Получить(ТаблицаДопЗатраты.Индекс(НайденныеСтроки[0]))["ДопЗатратыРазмер" + Строка(НомерПериода)]+ВыборкаДопЗатраты.Размер;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ВыборкаДопЗатраты.Сбросить();
		//ВыборкаДопЗатраты=Выборка.ДополнительныеЗатраты.Выбрать();
	КонецЦикла;	
	Выборка.Сбросить();
	/////////////////////////////////////////////
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьТоварыДоПериода = Макет.ПолучитьОбласть("ТоварыДоПериода");
	ОбластьТоварыПослеПериода = Макет.ПолучитьОбласть("ТоварыПослеПериода");
	ОбластьТоварыШапкаДоПериода = Макет.ПолучитьОбласть("ТоварыШапкаДоПериода");
	ОбластьТоварыШапкаПослеПериода = Макет.ПолучитьОбласть("ТоварыШапкаПослеПериода");
	ОбластьШапкаТоварыПериоды = Макет.ПолучитьОбласть("ТоварыПериодыШапка");
	ОбластьТоварыПериоды = Макет.ПолучитьОбласть("ТоварыПериоды");
	ОбластьШапкаТоварыПроекты = Макет.ПолучитьОбласть("ШапкаТоварыПроекты");
	ОбластьТоварыПроекты = Макет.ПолучитьОбласть("ТоварыПроекты");
	ОбластьУслугиДоПериода = Макет.ПолучитьОбласть("УслугиДоПериода");
	ОбластьУслугиПослеПериода = Макет.ПолучитьОбласть("УслугиПослеПериода");
	ОбластьУслугиШапкаДоПериода = Макет.ПолучитьОбласть("УслугиШапкаДоПериода");
	ОбластьУслугиШапкаПослеПериода = Макет.ПолучитьОбласть("УслугиШапкаПослеПериода");
	ОбластьШапкаУслугиПериоды = Макет.ПолучитьОбласть("УслугиПериодыШапка");
	ОбластьУслугиПериоды = Макет.ПолучитьОбласть("УслугиПериоды");
	ОбластьШапкаУслугиПроекты = Макет.ПолучитьОбласть("ШапкаУслугиПроекты");
	ОбластьУслугиПроекты = Макет.ПолучитьОбласть("УслугиПроекты");
	
	ОбластьДопЗатратыДоПериода = Макет.ПолучитьОбласть("ДопЗатратыДоПериода");
	ОбластьДопЗатратыПослеПериода = Макет.ПолучитьОбласть("ДопЗатратыПослеПериода");
	ОбластьДопЗатратыШапкаДоПериода = Макет.ПолучитьОбласть("ДопЗатратыШапкаДоПериода");
	ОбластьДопЗатратыШапкаПослеПериода = Макет.ПолучитьОбласть("ДопЗатратыШапкаПослеПериода");
	ОбластьШапкаДопЗатратыПериоды = Макет.ПолучитьОбласть("ДопЗатратыПериодыШапка");
	ОбластьДопЗатратыПериоды = Макет.ПолучитьОбласть("ДопЗатратыПериоды");
	
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ОбластьСпейсера = Макет.ПолучитьОбласть("Спейсер");
	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало 			= ТабличныйДокумент.ВысотаТаблицы + 1;
		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ОрганизацияНаименование = Выборка.Организация.Наименование+?(ЗначениеЗаполнено(Выборка.СтруктурноеПодразделение),"/"+Выборка.СтруктурноеПодразделение.Наименование,"");
		Шапка.Параметры.ПериодПланирования = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПредставлениеИнтервалаСтрокой(Выборка.ПериодПланирования,Выборка.Сценарий); 
		
		ТабличныйДокумент.Вывести(Шапка, Выборка.Уровень());
		ТабличныйДокумент.Вывести(ОбластьСпейсера);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если ВыборкаТовары.Количество()>0 Тогда
			ТабличныйДокумент.Вывести(ОбластьТоварыШапкаДоПериода);
			СекцияРодитель = ОбластьШапкаТоварыПериоды.ПолучитьОбласть("ТоварыПериодыШапка");
			Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
				Секция = СекцияРодитель;
				Секция.Параметры["Период"] = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ДобавитьМесяц(Выборка.ПериодПланирования,НомерПериода-1),Выборка.Сценарий);
				ТабличныйДокумент.Присоединить(Секция);
				СекцияРодитель = Секция.ПолучитьОбласть("ТоварыПериодыШапка");
			КонецЦикла;
			ТабличныйДокумент.Присоединить(ОбластьТоварыШапкаПослеПериода);		
			Если ПризнакПроекта Тогда
				ТабличныйДокумент.Присоединить(ОбластьШапкаТоварыПроекты);
			КонецЕсли;
			Для Каждого СтрокаТЧ из ТаблицаТовары Цикл
				ОбластьТоварыДоПериода.Параметры.Заполнить(СтрокаТЧ);
				ОбластьТоварыПослеПериода.Параметры.Заполнить(СтрокаТЧ);
				Если ЗначениеЗаполнено(ВыборкаТовары.Характеристика) Тогда
					ОбластьТоварыДоПериода.Параметры.Номенклатура = ВыборкаТовары.Номенклатура.Наименование + " / "+ВыборкаТовары.Характеристика.Наименование;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьТоварыДоПериода, ВыборкаТовары.Уровень());
				СекцияРодитель = ОбластьТоварыПериоды.ПолучитьОбласть("ТоварыПериоды");
				Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
					Секция = СекцияРодитель;
					Секция.Параметры["Сумма"] = СтрокаТЧ["ТоварыСумма"+НомерПериода];
					Секция.Параметры["Количество"] = СтрокаТЧ["ТоварыКоличество"+НомерПериода];
					Секция.Параметры["Цена"] = СтрокаТЧ["ТоварыЦена"+НомерПериода];
					ТабличныйДокумент.Присоединить(Секция, ВыборкаТовары.Уровень());
					СекцияРодитель = Секция.ПолучитьОбласть("ТоварыПериоды");
				КонецЦикла;
				ТабличныйДокумент.Присоединить(ОбластьТоварыПослеПериода, ВыборкаТовары.Уровень());
				Если ПризнакПроекта Тогда
					ОбластьТоварыПроекты.Параметры.Проект = СтрокаТЧ.Проект;
					ТабличныйДокумент.Присоединить(ОбластьТоварыПроекты);
				КонецЕсли;
			КонецЦикла;
			ТабличныйДокумент.Вывести(ОбластьСпейсера);
			КонецЕсли;
        //Услуги
		ВыборкаУслуги = Выборка.Услуги.Выбрать();
		Если ВыборкаУслуги.Количество()>0 Тогда	
			ТабличныйДокумент.Вывести(ОбластьУслугиШапкаДоПериода);
			СекцияРодитель = ОбластьШапкаУслугиПериоды.ПолучитьОбласть("УслугиПериодыШапка");
			Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
				Секция = СекцияРодитель;
				Секция.Параметры["Период"] = фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьПериодСтрокой(ДобавитьМесяц(Выборка.ПериодПланирования,НомерПериода-1),Выборка.Сценарий);
				ТабличныйДокумент.Присоединить(Секция);
				СекцияРодитель = Секция.ПолучитьОбласть("УслугиПериодыШапка");
			КонецЦикла;
			ТабличныйДокумент.Присоединить(ОбластьУслугиШапкаПослеПериода);
			Если ПризнакПроекта Тогда
				ТабличныйДокумент.Присоединить(ОбластьШапкаУслугиПроекты);
			КонецЕсли;

			Для Каждого СтрокаТЧ из ТаблицаУслуги Цикл
				ОбластьУслугиДоПериода.Параметры.Заполнить(СтрокаТЧ);
				ОбластьУслугиПослеПериода.Параметры.Заполнить(СтрокаТЧ);
				Если ЗначениеЗаполнено(ВыборкаУслуги.Характеристика) Тогда
					ОбластьУслугиДоПериода.Параметры.Номенклатура = ВыборкаУслуги.Номенклатура.Наименование + " / "+ВыборкаУслуги.Характеристика.Наименование;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьУслугиДоПериода, ВыборкаУслуги.Уровень());
				СекцияРодитель = ОбластьУслугиПериоды.ПолучитьОбласть("УслугиПериоды");
				Для НомерПериода = 1 По ПродолжительностьЦикла(Выборка.Сценарий) Цикл
					Секция = СекцияРодитель;
					Секция.Параметры["Сумма"] = СтрокаТЧ["УслугиСумма"+НомерПериода];
					Секция.Параметры["Количество"] = СтрокаТЧ["УслугиКоличество"+НомерПериода];
					Секция.Параметры["Цена"] = СтрокаТЧ["УслугиЦена"+НомерПериода];
					ТабличныйДокумент.Присоединить(Секция, ВыборкаУслуги.Уровень());
					СекцияРодитель = Секция.ПолучитьОбласть("УслугиПериоды");
				КонецЦикла;
				ТабличныйДокумент.Присоединить(ОбластьУслугиПослеПериода, ВыборкаУслуги.Уровень());
				Если ПризнакПроекта Тогда
					ОбластьУслугиПроекты.Параметры.Проект = СтрокаТЧ.Проект;
					ТабличныйДокумент.Присоединить(ОбластьУслугиПроекты);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Подвал);
		ВставлятьРазделительСтраниц = Истина;
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.  Конец
////////////////////////////////////////////////////////////////////////////////
// Прочее. Начало

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	Если фин_ОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию(ПользователиКлиентСервер.АвторизованныйПользователь(), "РедактированиеДокументовЗакупокВМатричномВиде") и ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаДокументаПоПериодам";
	КонецЕсли;
КонецПроцедуры

Функция ПродолжительностьЦикла(Сценарий)
	Запрос = Новый Запрос;
	запрос.УстановитьПараметр("Ссылка", Сценарий);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СценарииПланирования.ПродолжительностьЦикла
	               |ИЗ
	               |	Справочник.СценарииПланирования КАК СценарииПланирования
	               |ГДЕ
	               |	СценарииПланирования.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	Возврат Результат.ПродолжительностьЦикла;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//Прочее. Конец

////////////////////////////////////////////////////////////////////////////////
// Проверка табличных частей

Процедура ПроверитьТоварыУслуги(ЭтотОбъект, Отказ) Экспорт
	Товары 		= ЭтотОбъект.Товары;
	Услуги 		= ЭтотОбъект.Услуги;
	Заголовок 	= "";
	
	//Проверка что нет услуг в товарах
	Для каждого СтрокаТаблицы Из Товары Цикл
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
		                               """ табличной части """ + "Товары" + """: ";
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)
		   И  СтрокаТаблицы.Номенклатура.Услуга Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаНачалаСообщенияОбОшибке + "содержится услуга. " +
				                   "Услуг здесь быть не должно!",,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	//Проверка что нет товаров в услугах
	Для Каждого СтрокаТаблицы Из Услуги Цикл
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.НомерСтроки) +
        	                       """ табличной части """ + "Услуги" + """: ";
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)
		   И  Не СтрокаТаблицы.Номенклатура.Услуга Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаНачалаСообщенияОбОшибке + "содержится номенклатура, не являющаяся услугой. " +
				                   "Здесь могут быть только услуги!",,,,Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Проверка лимитов при проведении

Функция ПроверкаНаЛимиты(ЭтотОбъект) Экспорт
	Лимиты 					= ПолучитьПараметрыЛимитов(ЭтотОбъект);
	//Контроль по лимитам согласно сценария
	Если Лимиты.КонтрольПоЛимитам Тогда
		//Сводная таблица товаров и услуг
		ОбщаяТаблица 		= Новый ТаблицаЗначений;
		//загрузка сводной таблицы
		ЗагрузкаОбщейТаблицы(ОбщаяТаблица, ЭтотОбъект);
		
		ОшибкаЛимита 		= Ложь; 										//флаг ошибки лимитов
		МассивСообщений 	= Новый Массив;									//инициализация массива сообщений пользователю
		СписокНоменклатуры 	= ОбщаяТаблица.ВыгрузитьКолонку("Номенклатура");//список номенклатуры текущего документа
		СписокНоменклатуры.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		СписокНоменклатуры.Добавить(ПредопределенноеЗначение("Справочник.фин_ПлановаяНоменклатура.ПустаяСсылка"));
		СписокНоменклатуры.Добавить();
		мПериодичность 		= Строка(ЭтотОбъект.Сценарий.Периодичность); 	//периодичность сценария (Месяц,Квартал,Год)
		ДатаНачалоПериода 	= ЭтотОбъект.ПериодПланирования;				//Начало всего периода
		ДатаКонецПериода 	= фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьГоризонтПланирования(ЭтотОбъект.ПериодПланирования,ЭтотОбъект.Сценарий);//конец всего периода
		//определение списка подразделений
		Если ЭтотОбъект.ОбластьПланирования = Перечисления.узп_ИсточникиЗаявокМТС.Подразделение Тогда
			СписокПодразделений = Новый Массив;
			СписокПодразделений.Добавить(ЭтотОбъект.Подразделение);
		Иначе
			СписокПодразделений = ОбщаяТаблица.ВыгрузитьКолонку("Подразделение");
		КонецЕсли;
		//выгрузка в таблицу всей проведенной номенклатуры за период документа
		ТаблицаПроведеннойНоменклатуры = ПолучитьПроведеннуюНоменклатуру(ОбщаяТаблица,СписокНоменклатуры,мПериодичность,ДатаНачалоПериода,ДатаКонецПериода,СписокПодразделений, ЭтотОбъект);
		мСценарий 		 = Новый Массив;
		мСценарий.Добавить(ЭтотОбъект.Сценарий);
		мСценарий.Добавить(ПредопределенноеЗначение("Справочник.СценарииПланирования.ПустаяСсылка"));
		СписокФП 		 = Неопределено;
		Если Лимиты.НаОснованииБюджетов Тогда	
			Запрос 		 = Новый Запрос;
			Запрос.УстановитьПараметр("Подразделение",СписокПодразделений);
			Запрос.Текст = "ВЫБРАТЬ
			               |	узп_НастройкиНормированияОбъемовСнабжения.Подразделение,
			               |	узп_НастройкиНормированияОбъемовСнабжения.ФинансовыйПоказательНормированияСнабжения КАК ФинансовыйПоказатель,
						   |	узп_НастройкиНормированияОбъемовСнабжения.РежимНормирования
			               |ИЗ
			               |	РегистрСведений.узп_НастройкиНормированияОбъемовСнабжения КАК узп_НастройкиНормированияОбъемовСнабжения
			               |ГДЕ
			               |	узп_НастройкиНормированияОбъемовСнабжения.Подразделение В(&Подразделение)";
			СписокФП 	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФинансовыйПоказатель");
	    КонецЕсли;
		//получение норм
		НормыПодразделения = ПолучитьНормы(Лимиты,СписокПодразделений,мСценарий,СписокНоменклатуры,СписокФП, ЭтотОбъект);
		
		//Проверка на превышение лимита по номенклатурам
		ЛимитПроверкаПоНоменклатуре(Лимиты,ОшибкаЛимита,МассивСообщений,ОбщаяТаблица,ТаблицаПроведеннойНоменклатуры,НормыПодразделения, ЭтотОбъект);
		//ПроверкаНаЛимитыПоНоменклатурам(Лимиты,ОшибкаЛимита,МассивСообщений,ОбщаяТаблица);
		
		//проверка на превышение лимита по подразделению в целом
		ЛимитПроверкаПоПодразделению(Лимиты,ОшибкаЛимита,МассивСообщений,ОбщаяТаблица,ТаблицаПроведеннойНоменклатуры,НормыПодразделения, ЭтотОбъект);
		//ПроверкаНаЛимитыПоПодразделению(Лимиты,ОшибкаЛимита,МассивСообщений,ОбщаяТаблица);
		Для Каждого СообщениеИзМассива Из МассивСообщений Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеИзМассива);
		КонецЦикла;
		Если Не МассивСообщений.Количество()=0 Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПолучитьПараметрыЛимитов(ЭтотОбъект)
	Лимиты = Новый Структура;
	Лимиты.Вставить("КонтрольПоЛимитам",Ложь);
	Лимиты.Вставить("НаОснованииБюджетов",Ложь);
	Лимиты.Вставить("КонтрольПоПодразделению",Ложь);
	Лимиты.Вставить("КонтрольПоНоменклатуре",Ложь);
	Лимиты.Вставить("ЛимитПоПодразделениюСумма", 0);
	Лимиты.Вставить("ЛимитПоПодразделениюКоличество", 0);
	Лимиты.Вставить("ЛимитПоНоменклатурам", Новый Массив);
	//Проверка на лимиты по заявкам
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	фин_УчетнаяПолитикаПоБюджетированиюСрезПоследних.Период,
	               |	фин_УчетнаяПолитикаПоБюджетированиюСрезПоследних.НормироватьОбъемыСнабжения,
	               |	фин_УчетнаяПолитикаПоБюджетированиюСрезПоследних.ИсточникПолученияНормСнабжения
	               |ИЗ
	               |	РегистрСведений.фин_УчетнаяПолитикаПоБюджетированию.СрезПоследних(&Дата, ) КАК фин_УчетнаяПолитикаПоБюджетированиюСрезПоследних";
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.ПериодПланирования);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Лимиты.КонтрольПоЛимитам=Результат.НормироватьОбъемыСнабжения;
		Если Результат.ИсточникПолученияНормСнабжения = Перечисления.узп_ИсточникиПолученияНормСнабжения.НаОснованииБюджетов Тогда
			Лимиты.НаОснованииБюджетов = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Лимиты;	
КонецФункции

Процедура ЗагрузкаОбщейТаблицы(ОбщаяТаблица, ЭтотОбъект)
	ТипыНоменклатуры = Новый Массив;
	ТипыНоменклатуры.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ТипыНоменклатуры.Добавить(Тип("СправочникСсылка.фин_ПлановаяНоменклатура"));
	ОбщаяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов(ТипыНоменклатуры));
	ОбщаяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ОбщаяТаблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ОбщаяТаблица.Колонки.Добавить("КоличествоПоПрочимЗаявкам", Новый ОписаниеТипов("Число"));
	ОбщаяТаблица.Колонки.Добавить("СуммаПоПрочимЗаявкам", Новый ОписаниеТипов("Число"));
	ОбщаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ОбщаяТаблица.Колонки.Добавить("ПериодПланирования", Новый ОписаниеТипов("Дата"));
	Таблицы = Новый Массив;
	Таблицы.Добавить(ЭтотОбъект.Товары);
	Таблицы.Добавить(ЭтотОбъект.Услуги);
	Для Каждого ТаблицаНоменклатур Из Таблицы Цикл
		Для каждого СтрокаТЧ Из ТаблицаНоменклатур Цикл
			НоваяСтрока 					= ОбщаяТаблица.Добавить();
			НоваяСтрока.Номенклатура 		= СтрокаТЧ.Номенклатура;
			НоваяСтрока.Количество 			= СтрокаТЧ.Количество;
			НоваяСтрока.Сумма 				= СтрокаТЧ.Сумма;
			НоваяСтрока.Подразделение 		= ПолучитьПодразделениеТекущейСтроки(СтрокаТЧ, ЭтотОбъект);
			НоваяСтрока.ПериодПланирования 	= фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ДатаНачалаПериода(СтрокаТЧ.ПериодПланирования,ЭтотОбъект.Сценарий);
		КонецЦикла;
	КонецЦикла;
	ОбщаяТаблица.Свернуть("Номенклатура,Подразделение,ПериодПланирования", "Количество,Сумма,КоличествоПоПрочимЗаявкам,СуммаПоПрочимЗаявкам");
КонецПроцедуры

Функция ПолучитьПроведеннуюНоменклатуру(ОбщаяТаблица,СписокНоменклатуры,мПериодичность,ДатаНачалоПериода,ДатаКонецПериода,СписокПодразделений, ЭтотОбъект)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаКонецПериода);
	Запрос.УстановитьПараметр("Номенклатура",СписокНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Подразделение",СписокПодразделений);
	Запрос.УстановитьПараметр("ПустойСценарий",);
	Запрос.Текст ="ВЫБРАТЬ
	              |	узп_ПланыЗакупокОбороты.Номенклатура,
	              |	узп_ПланыЗакупокОбороты.ПериодПланирования,
	              |	узп_ПланыЗакупокОбороты.Подразделение,
	              |	СУММА(ЕСТЬNULL(узп_ПланыЗакупокОбороты.КоличествоОборот, 0)) КАК Количество,
	              |	СУММА(ЕСТЬNULL(узп_ПланыЗакупокОбороты.СуммаОборот, 0)) КАК Сумма,
	              |	СУММА(ЕСТЬNULL(узп_ПланыЗакупокОбороты.СуммаОборот, 0)) КАК СуммаПоПрочимЗаявкам,
	              |	СУММА(ЕСТЬNULL(узп_ПланыЗакупокОбороты.КоличествоОборот, 0)) КАК КоличествоПоПрочимЗаявкам
	              |ИЗ
	              |	РегистрНакопления.узп_ПланыЗакупок.Обороты(
	              |			,
	              |			,
	              |			Регистратор,
	              |			ПериодПланирования МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНачала, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)
	              |				И Подразделение В (&Подразделение)
	              |				И Сценарий <> &ПустойСценарий) КАК узп_ПланыЗакупокОбороты
	              |ГДЕ
	              |	узп_ПланыЗакупокОбороты.Регистратор <> &Ссылка
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	узп_ПланыЗакупокОбороты.Номенклатура,
	              |	узп_ПланыЗакупокОбороты.ПериодПланирования,
	              |	узп_ПланыЗакупокОбороты.Подразделение";
	НоменклатураПодразделения = Запрос.Выполнить().Выгрузить();
	Возврат НоменклатураПодразделения;;
КонецФункции

Функция ПолучитьНормы(Лимиты,СписокПодразделений,мСценарий,СписокНоменклатуры,СписокФП, ЭтотОбъект)
	Если Лимиты.НаОснованииБюджетов Тогда
		БюджетированиеПоОрганизациям = Константы.фин_БюджетированиеПоОрганизациям.Получить();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаНачала",ЭтотОбъект.ПериодПланирования);
		Запрос.УстановитьПараметр("ДатаОкончания",фин_ПроцедурыМеханизмовБюджетированияКлиентСервер.ПолучитьГоризонтПланирования(ЭтотОбъект.ПериодПланирования,ЭтотОбъект.Сценарий));
		Запрос.УстановитьПараметр("Номенклатура",СписокНоменклатуры);
		Запрос.УстановитьПараметр("Подразделение",СписокПодразделений);
		Запрос.УстановитьПараметр("Сценарий",мСценарий);
		Запрос.УстановитьПараметр("ФинансовыйПоказатель",СписокФП);
		Запрос.УстановитьПараметр("Организация",ЭтотОбъект.Организация);
		Запрос.Текст = "ВЫБРАТЬ
		               |	фин_ОборотыБюджетовОбороты.Сценарий,
		               |	фин_ОборотыБюджетовОбороты.Номенклатура,
		               |	ЕСТЬNULL(фин_ОборотыБюджетовОбороты.КоличествоОборот, 0) КАК Количество,
		               |	ЕСТЬNULL(фин_ОборотыБюджетовОбороты.СуммаУпрОборот, 0) КАК Сумма,
		               |	фин_ОборотыБюджетовОбороты.УправленческоеПодразделение КАК Подразделение,
		               |	фин_ОборотыБюджетовОбороты.ПериодПланирования КАК Период,
		               |	узп_НастройкиНормированияОбъемовСнабжения.РежимНормирования
		               |ИЗ
		               |	РегистрНакопления.фин_ОборотыБюджетов.Обороты(
		               |			,
		               |			,
		               |			,
		               |			ПериодПланирования МЕЖДУ &ДатаНачала И &ДатаОкончания
		               //|				И Номенклатура В (&Номенклатура)
		               |				И УправленческоеПодразделение В (&Подразделение)
		               |				И Сценарий В (&Сценарий)
		               |				И ФинансовыйПоказатель В (&ФинансовыйПоказатель)
					   |				"+?(БюджетированиеПоОрганизациям,"И Организация = &Организация","")+"
					   |				) КАК фин_ОборотыБюджетовОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.узп_НастройкиНормированияОбъемовСнабжения КАК узп_НастройкиНормированияОбъемовСнабжения
		               |		ПО фин_ОборотыБюджетовОбороты.УправленческоеПодразделение = узп_НастройкиНормированияОбъемовСнабжения.Подразделение
		               |			И фин_ОборотыБюджетовОбороты.ФинансовыйПоказатель = узп_НастройкиНормированияОбъемовСнабжения.ФинансовыйПоказательНормированияСнабжения";
					   
		Результат = Запрос.Выполнить().Выгрузить();
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Подразделение", СписокПодразделений);
		Запрос.УстановитьПараметр("Сценарий", мСценарий);
		Запрос.УстановитьПараметр("Номенклатура",СписокНоменклатуры);
		Запрос.УстановитьПараметр("Дата",ЭтотОбъект.ПериодПланирования);
		Запрос.Текст = "ВЫБРАТЬ
		               |	узп_НормыСнабженияИЗакупаСрезПоследних.Подразделение,
		               |	узп_НормыСнабженияИЗакупаСрезПоследних.Номенклатура,
		               |	узп_НормыСнабженияИЗакупаСрезПоследних.Сценарий,
		               |	узп_НормыСнабженияИЗакупаСрезПоследних.КоличествоЗакуп КАК Количество,
		               |	узп_НормыСнабженияИЗакупаСрезПоследних.СуммаЗакуп КАК Сумма,
		               |	узп_НормыСнабженияИЗакупаСрезПоследних.Период,
		               |	ВЫБОР
		               |		КОГДА узп_НормыСнабженияИЗакупаСрезПоследних.КоличествоЗакуп > 0
		               |				И узп_НормыСнабженияИЗакупаСрезПоследних.СуммаЗакуп > 0
		               |			ТОГДА ""Все""
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА узп_НормыСнабженияИЗакупаСрезПоследних.КоличествоЗакуп > 0
		               |						И узп_НормыСнабженияИЗакупаСрезПоследних.СуммаЗакуп = 0
		               |					ТОГДА ЗНАЧЕНИЕ(Перечисление.Узп_РежимыНормированияОбъемовСнабжения.ПоКоличеству)
		               |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.Узп_РежимыНормированияОбъемовСнабжения.ПоСумме)
		               |			КОНЕЦ
		               |	КОНЕЦ КАК РежимНормирования
		               |ИЗ
		               |	РегистрСведений.узп_НормыСнабженияИЗакупа.СрезПоследних(&Дата, ) КАК узп_НормыСнабженияИЗакупаСрезПоследних
		               |ГДЕ
		               |	узп_НормыСнабженияИЗакупаСрезПоследних.Подразделение В(&Подразделение)
		               |	И узп_НормыСнабженияИЗакупаСрезПоследних.Сценарий В(&Сценарий)";
		Результат = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ЛимитПроверкаПоНоменклатуре(Лимиты,ОшибкаЛимита,МассивСообщений,ОбщаяТаблица,ТаблицаПроведеннойНоменклатуры,НормыПодразделения, ЭтотОбъект)
	Для Каждого СтрокаНоменклатура Из ОбщаяТаблица Цикл
		ДатаОкончания 		= СтрокаНоменклатура.ПериодПланирования;
		ДатаНачала 			= ОпределитьНачальнуюДатуПоСценарию(ЭтотОбъект.Сценарий,СтрокаНоменклатура.ПериодПланирования);
		КоличествоПроведенное 	= 0;
		СуммаПроведенное		= 0;
		КоличествоПоПрочимЗаявкам 	= 0;
		СуммаПоПрочимЗаявкам		= 0;
		
		НайденнаяПроведеннаяНоменклатура = ТаблицаПроведеннойНоменклатуры.НайтиСтроки(Новый Структура("Номенклатура,Подразделение",СтрокаНоменклатура.Номенклатура,СтрокаНоменклатура.Подразделение));
		
		Для Каждого СтрокаНайденнойПроведеннойНоменклатуры Из НайденнаяПроведеннаяНоменклатура Цикл
			Если СтрокаНайденнойПроведеннойНоменклатуры.ПериодПланирования > ДатаНачала 
				И СтрокаНайденнойПроведеннойНоменклатуры.ПериодПланирования <= ДатаОкончания Тогда
				КоличествоПроведенное 	= КоличествоПроведенное + СтрокаНайденнойПроведеннойНоменклатуры.Количество;
				СуммаПроведенное 		= СуммаПроведенное + СтрокаНайденнойПроведеннойНоменклатуры.Сумма;
				КоличествоПоПрочимЗаявкам 	= КоличествоПоПрочимЗаявкам + СтрокаНайденнойПроведеннойНоменклатуры.Количество;
				СуммаПоПрочимЗаявкам		= СуммаПоПрочимЗаявкам + СтрокаНайденнойПроведеннойНоменклатуры.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		КоличествоОбщее 	= КоличествоПроведенное + СтрокаНоменклатура.Количество;
		СуммаОбщее 			= СуммаПроведенное + СтрокаНоменклатура.Сумма;
		
		НайденныеНормыПодразделения = НормыПодразделения.НайтиСтроки(Новый Структура("Номенклатура, Подразделение",СтрокаНоменклатура.Номенклатура, СтрокаНоменклатура.Подразделение));
		Если Не НайденныеНормыПодразделения.Количество() = 0 Тогда 
			СтрокаНорм = НайденныеНормыПодразделения[0];
			ТекстОшибки = "";
			Если КоличествоОбщее > СтрокаНорм.Количество 
				И Не СтрокаНорм.Количество = 0 Тогда
				ОшибкаЛимита = Истина;
				ТекстОшибки = "количество";
			КонецЕсли;
			Если Не ТекстОшибки = "" Тогда
				ТекстСообщения = "Превышен лимит: подразделение """+СтрокаНоменклатура.Подразделение + 
				""", номенклатура """+СтрокаНоменклатура.Номенклатура + """, период " + 
				Формат(СтрокаНоменклатура.ПериодПланирования,"ДФ=""ММММ гггг""")+
				" "+ТРег(ТекстОшибки)+": запрошено "+?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)+?(ТекстОшибки = "сумма",?(СуммаПоПрочимЗаявкам=0,""," (в т. ч. по прочим планам "+СуммаПоПрочимЗаявкам+")"),?(КоличествоПоПрочимЗаявкам=0,""," (в т. ч. по прочим заявкам "+КоличествоПоПрочимЗаявкам+")"))+", разрешено "+?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество)+" , превышение "+(?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)-?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество));
				Если МассивСообщений.Найти(ТекстСообщения)=Неопределено ТОгда
					МассивСообщений.Добавить(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
			ТекстОшибки = "";
			Если СуммаОбщее > СтрокаНорм.Сумма 
				И Не СтрокаНорм.Сумма = 0 Тогда
				ОшибкаЛимита = Истина;
				ТекстОшибки = "сумма";
			КонецЕсли;
			Если Не ТекстОшибки = "" Тогда
				ТекстСообщения = "Превышен лимит: подразделение """+СтрокаНоменклатура.Подразделение + 
				""", номенклатура """+СтрокаНоменклатура.Номенклатура + """, период " + 
				Формат(СтрокаНоменклатура.ПериодПланирования,"ДФ=""ММММ гггг""")+
				" "+ТРег(ТекстОшибки)+": запрошено "+?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)+?(ТекстОшибки = "сумма",?(СуммаПоПрочимЗаявкам=0,""," (в т. ч. по прочим планам "+СуммаПоПрочимЗаявкам+")"),?(КоличествоПоПрочимЗаявкам=0,""," (в т. ч. по прочим заявкам "+КоличествоПоПрочимЗаявкам+")"))+", разрешено "+?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество)+" , превышение "+(?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)-?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество));
				Если МассивСообщений.Найти(ТекстСообщения)=Неопределено ТОгда
					МассивСообщений.Добавить(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЛимитПроверкаПоПодразделению(Лимиты,ОшибкаЛимита,МассивСообщений,ОбщаяТаблица,ТаблицаПроведеннойНоменклатуры,НормыПодразделения, ЭтотОбъект)
	ОбщаяТаблица1 = ОбщаяТаблица.Скопировать();
	ОбщаяТаблица1.Свернуть("Подразделение, ПериодПланирования","Сумма,Количество");
	Для Каждого СтрокаНоменклатура Из ОбщаяТаблица1 Цикл
		ДатаОкончания 		= СтрокаНоменклатура.ПериодПланирования;
		ДатаНачала 			= ОпределитьНачальнуюДатуПоСценарию(ЭтотОбъект.Сценарий,СтрокаНоменклатура.ПериодПланирования);
		КоличествоПроведенное 	= 0;
		СуммаПроведенное		= 0;
		КоличествоПоПрочимЗаявкам 	= 0;
		СуммаПоПрочимЗаявкам		= 0;
		
		НайденнаяПроведеннаяНоменклатура = ТаблицаПроведеннойНоменклатуры.НайтиСтроки(Новый Структура("Подразделение",СтрокаНоменклатура.Подразделение));
		
		Для Каждого СтрокаНайденнойПроведеннойНоменклатуры Из НайденнаяПроведеннаяНоменклатура Цикл
			Если СтрокаНайденнойПроведеннойНоменклатуры.ПериодПланирования > ДатаНачала 
				И СтрокаНайденнойПроведеннойНоменклатуры.ПериодПланирования <= ДатаОкончания Тогда
				КоличествоПроведенное 	= КоличествоПроведенное + СтрокаНайденнойПроведеннойНоменклатуры.Количество;
				СуммаПроведенное 		= СуммаПроведенное + СтрокаНайденнойПроведеннойНоменклатуры.Сумма;
				КоличествоПоПрочимЗаявкам 	= КоличествоПоПрочимЗаявкам + СтрокаНайденнойПроведеннойНоменклатуры.Количество;
				СуммаПоПрочимЗаявкам		= СуммаПоПрочимЗаявкам + СтрокаНайденнойПроведеннойНоменклатуры.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		КоличествоОбщее 	= КоличествоПроведенное + СтрокаНоменклатура.Количество;
		СуммаОбщее 			= СуммаПроведенное + СтрокаНоменклатура.Сумма;
		
		НормыПодразделения1 = НормыПодразделения.Скопировать();
		НормыПодразделения1.Свернуть("Номенклатура, Подразделение","Сумма,Количество");
		
		НайденныеНормыПодразделения = НормыПодразделения1.НайтиСтроки(Новый Структура("Номенклатура, Подразделение",, СтрокаНоменклатура.Подразделение));
		Если Не НайденныеНормыПодразделения.Количество() = 0 Тогда 
			СтрокаНорм = НайденныеНормыПодразделения[0];
			ТекстОшибки = "";
			Если КоличествоОбщее > СтрокаНорм.Количество 
				И Не СтрокаНорм.Количество = 0 Тогда
				ОшибкаЛимита = Истина;
				ТекстОшибки = "количество";
			КонецЕсли;
			Если Не ТекстОшибки = "" Тогда
				ТекстСообщения = "Превышен лимит: подразделение """+СтрокаНоменклатура.Подразделение + 
				""", период " + 
				Формат(СтрокаНоменклатура.ПериодПланирования,"ДФ=""ММММ гггг""")+
				" "+ТРег(ТекстОшибки)+": запрошено "+?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)+?(ТекстОшибки = "сумма",?(СуммаПоПрочимЗаявкам=0,""," (в т. ч. по прочим планам "+СуммаПоПрочимЗаявкам+")"),?(КоличествоПоПрочимЗаявкам=0,""," (в т. ч. по прочим заявкам "+КоличествоПоПрочимЗаявкам+")"))+", разрешено "+?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество)+" , превышение "+(?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)-?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество));
				Если МассивСообщений.Найти(ТекстСообщения)=Неопределено ТОгда
					МассивСообщений.Добавить(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
			ТекстОшибки = "";
			Если СуммаОбщее > СтрокаНорм.Сумма 
				И Не СтрокаНорм.Сумма = 0 Тогда
				ОшибкаЛимита = Истина;
				ТекстОшибки = "сумма";
			КонецЕсли;
			Если Не ТекстОшибки = "" Тогда
				ТекстСообщения = "Превышен лимит: подразделение """+СтрокаНоменклатура.Подразделение + 
				""", период " + 
				Формат(СтрокаНоменклатура.ПериодПланирования,"ДФ=""ММММ гггг""")+
				" "+ТРег(ТекстОшибки)+": запрошено "+?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)+?(ТекстОшибки = "сумма",?(СуммаПоПрочимЗаявкам=0,""," (в т. ч. по прочим планам "+СуммаПоПрочимЗаявкам+")"),?(КоличествоПоПрочимЗаявкам=0,""," (в т. ч. по прочим заявкам "+КоличествоПоПрочимЗаявкам+")"))+", разрешено "+?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество)+" , превышение "+(?(ТекстОшибки = "сумма",СуммаОбщее,КоличествоОбщее)-?(ТекстОшибки = "сумма",СтрокаНорм.Сумма,СтрокаНорм.Количество));
				Если МассивСообщений.Найти(ТекстСообщения)=Неопределено ТОгда
					МассивСообщений.Добавить(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьПодразделениеТекущейСтроки(СтрокаТЧ, ЭтотОбъект);
	Если ЭтотОбъект.ОбластьПланирования = Перечисления.узп_ИсточникиЗаявокМТС.Подразделение Тогда
		мПодразделение = ЭтотОбъект.Подразделение;
	Иначе
		мПодразделение = СтрокаТЧ.Подразделение;
	КонецЕсли;
	Возврат мПодразделение;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ДополнительныеПараметрыЗапросов = Новый Структура();
		
	ДополнительныеЗапросы = Новый Массив;
		
	ПараметрыПроведения = фин_УправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка,Отказ,Истина,Истина,,,,,ДополнительныеПараметрыЗапросов,ДополнительныеЗапросы);
	
	Возврат ПараметрыПроведения;

КонецФункции 

Функция ОпределитьНачальнуюДатуПоСценарию(Сценарий, Период)
	Если Сценарий.Периодичность = Перечисления.фин_Периодичность.День Тогда
		НачальнаяДата = Период - 86400;
	ИначеЕсли Сценарий.Периодичность = Перечисления.фин_Периодичность.Неделя Тогда
		НачальнаяДата = Период - 604800;
	ИначеЕсли Сценарий.Периодичность = Перечисления.фин_Периодичность.Декада тогда
		НачальнаяДата = Период - 864000;
	ИначеЕсли Сценарий.Периодичность = Перечисления.фин_Периодичность.Месяц тогда
		НачальнаяДата = ДобавитьМесяц(Период, -1);
	ИначеЕсли Сценарий.Периодичность = Перечисления.фин_Периодичность.Квартал тогда
		НачальнаяДата = ДобавитьМесяц(Период, -3);
	ИначеЕсли Сценарий.Периодичность = Перечисления.фин_Периодичность.Полугодие тогда
		НачальнаяДата = ДобавитьМесяц(Период, -6);
	ИначеЕсли Сценарий.Периодичность = Перечисления.фин_Периодичность.Год тогда
		НачальнаяДата = ДобавитьМесяц(Период, -12);
	КонецЕсли;
	Возврат НачальнаяДата;
КонецФункции

#КонецЕсли




