
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Адрес") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	СписокРасчетов = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Таблица = СписокРасчетов.Скопировать();
	Таблица.Свернуть("Модель");
	СписокМоделей = Новый СписокЗначений;
	СписокМоделей.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("Модель"));
	ДеревоРасчетов = ДанныеФормыВЗначение(мДеревоРасчетов,Тип("ДеревоЗначений"));
	Для Каждого Модель Из СписокМоделей Цикл
		СтрокаДерева = ДеревоРасчетов.Строки.Добавить();
		СтрокаДерева.Объект = "Модель: "+ Модель.Значение;
		СтрокаДерева.Картинка = 0;
		Таблица = СписокРасчетов.Скопировать(Новый Структура("Модель",Модель.Значение));
		Таблица.Свернуть("Расчет");
		СписокРасчетовМодели = Новый СписокЗначений;
		СписокРасчетовМодели.ЗагрузитьЗначения(Таблица.ВыгрузитьКолонку("Расчет"));
		Для Каждого Расчет Из СписокРасчетовМодели Цикл
			СтрокаРасчета = СтрокаДерева.Строки.Добавить();
			СтрокаРасчета.Объект = "Расчет: "+ Расчет.Значение;
			СтрокаРасчета.Картинка = 1;
			Таблица = СписокРасчетов.Скопировать(Новый Структура("Модель,Расчет",Модель.Значение,Расчет.Значение));
			Таблица.Свернуть("Период,Дата");
			Таблица.Сортировать("Дата");
			Для Каждого Период Из Таблица Цикл
				СтрокаПериода = СтрокаРасчета.Строки.Добавить();
				СтрокаПериода.Объект = "Период: "+ Период.Период;
				СтрокаПериода.Картинка = 2;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ЗначениеВДанныеФормы(ДеревоРасчетов,мДеревоРасчетов);
КонецПроцедуры
