
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отказ = Истина;
	УтвердитьНаСервере(ПараметрКоманды,отказ);
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Если Отказ Тогда 
		Предупреждение("Недостаточно прав");	
	иначе
		ОповеститьОбИзменении(ПредопределенноеЗначение("Документ.ЦС_ПланГосЗакупок.ПустаяСсылка"));
	КонецЕсли;
КонецПроцедуры

Процедура УтвердитьНаСервере(МассивДокументов,Отказ)
	Если РольДоступна("УтверждениеПланаЗакупокТРУ") тогда
		Утвержден = ПредопределенноеЗначение("Перечисление.СостоянияОбъектов.Утвержден");
		Для Каждого ЭлементМассива Из МассивДокументов Цикл
			Док = ЭлементМассива.ПолучитьОбъект();
			Док.состояние = Утвержден;
			Док.Записать();			
		КонецЦикла;	
		Отказ = Ложь;
	КонецЕсли; 
КонецПроцедуры
