
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("БазовыйКоэффициент",					БазовыйКоэффициент);
	Параметры.Свойство("КоличествоПериодовРаспределения",		КоличествоПериодовРаспределения);
	Параметры.Свойство("ПриращениеЗаПериод",					ПриращениеЗаПериод);
	Параметры.Свойство("ТипРаспределения",						ТипРаспределения);
	Параметры.Свойство("СмещениеПервогоПериодаРаспределения",	СмещениеПервогоПериодаРаспределения);
	Параметры.Свойство("ТипИзменения",							ТипИзменения);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)

	СтруктураНастройки=Новый Структура;
	СтруктураНастройки.Вставить("БазовыйКоэффициент"					,БазовыйКоэффициент);
	СтруктураНастройки.Вставить("КоличествоПериодовРаспределения"		,КоличествоПериодовРаспределения);
	СтруктураНастройки.Вставить("ПриращениеЗаПериод"					,ПриращениеЗаПериод);
	СтруктураНастройки.Вставить("ТипРаспределения"						,ТипРаспределения);
    СтруктураНастройки.Вставить("СмещениеПервогоПериодаРаспределения"	,СмещениеПервогоПериодаРаспределения);
	СтруктураНастройки.Вставить("ТипИзменения"							,ТипИзменения);
	
	ОповеститьОВыборе(СтруктураНастройки);
КонецПроцедуры
