Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ВРаботе;	
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
КонецПроцедуры

Функция ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
	
	//Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСВР Тогда
	//	Возврат КурирующийЧП;
	//КонецЕсли;
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемФД Тогда
		Возврат ДиректорФД;
	КонецЕсли;


		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Бит_АдресацияУведомленийПоКомандировкам.Адресат,
	|	Бит_АдресацияУведомленийПоКомандировкам.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.Бит_АдресацияУведомленийПоКомандировкам КАК Бит_АдресацияУведомленийПоКомандировкам
	|ГДЕ
	|	(Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &Пользователь
	|			ИЛИ Бит_АдресацияУведомленийПоКомандировкам.Пользователь = &ПустойПользователь)
	|	И Бит_АдресацияУведомленийПоКомандировкам.ЭтапМаршрута = &ЭтапМаршрута
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователь УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Постановщик);
	Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());

	Запрос.УстановитьПараметр("ЭтапМаршрута", ТочкаЭтапа);
	
	Результат = Запрос.Выполнить();
	Выборка = результат.Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Адресат;
	КонецЕсли;
КонецФункции

Процедура ОбработатьЭтап(Постановщик, ТочкаЭтапа,ФормируемыеЗадачи,Отказ, ЯвныйАдресат = Неопределено)
	
	Если ТочкаЭтапа = Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором тогда 
		Адресат = Постановщик;
	Иначе    
		Если ЯвныйАдресат = Неопределено тогда
			Адресат = ПолучитьАдресатаДляТекущегоЭтапа(Постановщик,ТочкаЭтапа);
		Иначе
			Адресат = ЯвныйАдресат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Адресат = Неопределено или Адресат.Пустая() тогда 
		Отказ = Истина;
		Сообщить("Для текущего пользователя на этапе "+ТочкаЭтапа+" не найден адресат");
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача из ФормируемыеЗадачи Цикл
		
//		Задача.ЗаявкаНаРасходованиеСредств = ЗаявкаНаРасходованиеСредств;
		Если ТипЗнч(Адресат) = Тип("СправочникСсылка.Пользователи") тогда
			Задача.Пользователь = Адресат;
		Иначе
			Задача.Подразделение = Адресат;
		КонецЕсли;
		ЦС_ОбщегоНазначенияСервер.ОтправитьПисьмоПоИзменениюЗаявок(Задача.бизнеспроцесс, Адресат, Задача);
	КонецЦикла;
				
КонецПроцедуры

Процедура ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат,МаркерЭтапа)
	
	Если МаркерЭтапа = "Разрешено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Разрешено;
	ИначеЕсли МаркерЭтапа = "Возвращено" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Возвращено;
	ИначеЕсли МаркерЭтапа = "Отказано" тогда
		Результат = ТочкаВыбораВарианта.Варианты.Отказано;
	КонецЕсли;
	
КонецПроцедуры

Процедура РаботаСЗаявкойАвторомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.ОтправленНаДоработкуАвтором,ФормируемыеЗадачи,Отказ);
КонецПроцедуры                   


Процедура СогласованиеСДиректоромФДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемФД,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура РезультатПроверкиДиректоромФДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПроверкаДиректоромФДВыполнена);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ОтказанРуководителемФД;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверкаВРПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСВР,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура РезультатПроверкиВРОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПодписанПредседателем);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ОтказанВР;
	КонецЕсли;

	Если ПроверкаДиректоромКДВыполнена = "Разрешено" Тогда
		
		ЭтотОбъект.РеестрСогласован = Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;
	

КонецПроцедуры

Процедура СозданиеПППриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СозданиеПП,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура ИзменитьВключениеВРеестр(ПараметрЗаявка);
	//+++ Oleg SmartT. 2021-03-29
	Если ЗначениеЗаполнено(ПараметрЗаявка) Тогда
		ДокументОбъект = ПараметрЗаявка.ПолучитьОбъект();
		
		Если ДокументОбъект.ЗаявкаВключенаВРеестр = Ложь Тогда
			ДокументОбъект.ЗаявкаВключенаВРеестр = Истина;
			ДокументОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	//--- Oleg SmartT. 2021-03-29
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Платежи.Количество() > 0 И ЭтотОбъект.РеестрСогласован = Истина Тогда
		
		Для Каждого Строка из Платежи Цикл
			
			//+++ Oleg SmartT. 2021-03-29
			ИзменитьВключениеВРеестр(Строка.ЗаявкаНаФинансирование);
			ИзменитьВключениеВРеестр(Строка.ЗаявкаНаФинансированиеПредставительств);
			ИзменитьВключениеВРеестр(Строка.ЗаявкаСХТП);
			ИзменитьВключениеВРеестр(Строка.ЗаявкаПоЗакупу);
			//--- Oleg SmartT. 2021-03-29	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СогласованиеСДиректоромКДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОбработатьЭтап(Автор,Справочники.ЦС_ЭтапыМаршрутовБП.СогласованиеСРуководителемКД,ФормируемыеЗадачи,Отказ);

КонецПроцедуры

Процедура РезультатПроверкиДиректоромКДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПроверкаДиректоромКДВыполнена);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.ОтказанРуководителемДепартамента;
	КонецЕсли;

	Если Результат = ТочкаВыбораВарианта.Варианты.Разрешено Тогда
		
		ЭтотОбъект.РеестрСогласован = Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура СогласованиеСФДПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если ЗначениеЗаполнено(ДиректорФД) Тогда
		Результат = Истина
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура РезультатДБУСогласованиеПередПеречислениемДенегОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ОбработатьВыборВарианта(ТочкаВыбораВарианта, Результат, ПроверкаПередачаНаОплату);	
	
	Если Результат = ТочкаВыбораВарианта.Варианты.Отказано Тогда  
		Завершен = Истина;
		Состояние = Перечисления.ЦС_СостоянияСогласованияПлатежей.Отказано;
	КонецЕсли;

	Если Результат = ТочкаВыбораВарианта.Варианты.Разрешено Тогда
		
		ЭтотОбъект.РеестрСогласован = Истина;
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры






